
&НаКлиенте
Перем ЗаполнятьРеквизитыПоИНН;

&НаКлиенте
// Содержит признак того, что было вызвано оповещение в текущей форме.
Перем РассылкаОповещенияИзТекущейФормы;
&НаКлиенте 
Перем ТекущийТекстНомераСчета; // Текст, набранный в поле ввода номера счета

&НаКлиенте
// Содержит признак того, что было вызвано оповещение в текущей форме.
Перем ВыбираемаяКартинка;


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Печать
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Установка списка выбора головных организаций
	Элементы.ГоловнаяОрганизация.СписокВыбора.ЗагрузитьЗначения(ПолучитьСписокГоловныхОрганизацийОбособленногоПодразделения().ВыгрузитьЗначения());
	
	// Исключим редактируемую организацию из списка головных
	Если Параметры.Ключ.Пустая() Тогда
		ОрганизацияСсылка         = Справочники.Организации.ПолучитьСсылку();
		ЭлементТекущаяОрганизация = Элементы.ГоловнаяОрганизация.СписокВыбора.НайтиПоЗначению(Объект.Ссылка);
		Если ЭлементТекущаяОрганизация <> Неопределено Тогда
			Элементы.ГоловнаяОрганизация.СписокВыбора.Удалить(ЭлементТекущаяОрганизация);
		КонецЕсли;
		РедактированиеПериодическихСведений.ИнициализироватьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ИсторияРегистрацийВОрганеПФР", ОрганизацияСсылка);
		ОтобразитьЗаполнениеПоДаннымЕГР = Истина;
	Иначе
		ОрганизацияСсылка = Объект.Ссылка;
	КонецЕсли;
	
	АдресныйКлассификаторПуст = НЕ АдресныйКлассификатор.КлассификаторЗагружен();
	
	Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо
	   И Объект.ОбособленноеПодразделение 
	   И ЗначениеЗаполнено(Объект.ГоловнаяОрганизация) Тогда // обособленное подразделение
		СтруктураУчетнойПолитики = ПараметрыСистемыНалогообложенияПоОрганизации(Объект.ГоловнаяОрганизация);
	ИначеЕсли ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда // копируем учетную политику
		СтруктураУчетнойПолитики = ПараметрыСистемыНалогообложенияПоОрганизации(Параметры.ЗначениеКопирования);
	Иначе
		Параметры.Свойство("СтруктураУчетнойПолитики", СтруктураУчетнойПолитики);
	КонецЕсли;
	ИсточникУчетнойПолитики = ?(СтруктураУчетнойПолитики = Неопределено Или Не Параметры.Ключ.Пустая(),
								ОрганизацияСсылка, СтруктураУчетнойПолитики);
	СистемаНалогообложенияПредставление = ПредставлениеСистемыНалогообложения(ИсточникУчетнойПолитики);
	
	ПараметрыУчета = ОбщегоНазначенияБПВызовСервера.ОпределитьПараметрыУчета();
	
	УплачиватьДобровольныеВзносыВФСС = УплачиватьДобровольныеВзносыВФСС(Объект.Ссылка);
	
	ИспользоватьРазделениеПоОбластямДанных = ПолучитьФункциональнуюОпцию("РаботаВМоделиСервиса");
	
	ЦветГиперссылкаТабличнойЧасти 	= ЦветаСтиля.ГиперссылкаТабличнойЧасти;
	ЦветНезаполненныйРеквизит 		= ЦветаСтиля.НезаполненныйРеквизит;
	ЦветВыделенияНекорректногоЗначение = ЦветаСтиля.ЦветВыделенияКонтрагентаСОшибкой;
	
	НаименованиеПоУмолчанию = Справочники.Организации.НаименованиеПоУмолчанию();
	
	НаименованиеСокращенноеДоИзменения	= Объект.НаименованиеСокращенное;
	
	НаименованиеСокращенное	= Объект.НаименованиеСокращенное;
	НаименованиеПолное		= Объект.НаименованиеПолное;
	
	УчетЗарплатыИКадровВоВнешнейПрограмме	= Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить();
	
	ИнициализироватьФорму();
	
	РазместитьКонтактнуюИнформацию();
	
	УстановитьСписокВыбораВариантаНаименованияДляПечатныхФорм(ЭтотОбъект);
	
	Элементы.КодНалоговогоОрганаПолучателя.Доступность = Объект.КрупнейшийНалогоплательщик;
	
	// Обработчик подсистемы "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	
	// Установка доступности ссылок в зависимости от доступности данных формы для изменения
	Элементы.ГруппаЗагрузкаАдресногоКлассификатора.Видимость = НЕ ИспользоватьРазделениеПоОбластямДанных И АдресныйКлассификаторПуст;
	Элементы.ГруппаЗагрузкаАдресногоКлассификатора.Доступность = НЕ ТолькоПросмотр;	
	Элементы.ЗагрузитьАдресныйКлассификатор.Доступность = НЕ ТолькоПросмотр;	
	Элементы.НадписьСформироватьЗаявлениеНаПодключениеКЭлектронномуДокументообороту.Доступность =
		Пользователи.ЭтоПолноправныйПользователь() ИЛИ РольДоступна("ПравоНаЗащищенныйДокументооборотСКонтролирующимиОрганами");
	
	Элементы.ФормаРегистрацияОрганизации.Видимость = НЕ Параметры.Ключ.Пустая() И НачалоРаботы.ДоступностьРегистрацииВОрганизации();
	Элементы.ИНН.Доступность = УчетНДС.ДоступностьИННВОрганизации();
	
	МожноРедактироватьФайлы = ПравоДоступа("Редактирование", Метаданные.Справочники.ОрганизацииПрисоединенныеФайлы);
	
	МассивИменКартинок = Новый Массив;
	МассивИменКартинок.Добавить("Логотип");
	МассивИменКартинок.Добавить("Печать");
	МассивИменКартинок.Добавить("ПодписьРуководителя");
	МассивИменКартинок.Добавить("ПодписьГлавногоБухгалтера");
	МассивИменКартинок.Добавить("ФаксимильнаяПечать");
	
	МассивИменЭлементов = Новый Массив;
	МассивИменЭлементов.Добавить("ЗагрузитьОчистить");
	МассивИменЭлементов.Добавить("ЗагрузитьКартинку");
	МассивИменЭлементов.Добавить("ВыбратьИзПрисоединенныхФайлов");
	МассивИменЭлементов.Добавить("Очистить");
	
	Для Каждого ИмяКартинки Из МассивИменКартинок Цикл
		ИмяФайла          = "Файл" + ИмяКартинки;
		ИмяАдресаКартинки = "Адрес" + ИмяКартинки;
		
		ТекущийФайл = Объект[ИмяФайла];
		Если НЕ ТекущийФайл.Пустая() Тогда
			ЭтотОбъект[ИмяАдресаКартинки] = ПрисоединенныеФайлы.ПолучитьДанныеФайла(ТекущийФайл, УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
		Конецесли;
		Для Каждого ИмяЭлемента Из МассивИменЭлементов Цикл
			Элементы[ИмяЭлемента + ИмяКартинки].Доступность = МожноРедактироватьФайлы;
		КонецЦикла;
	КонецЦикла;
	
	УстановитьПредставлениеПлатежныхРеквизитов(Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган, Объект.КодНалоговогоОргана, 
				ПлатежныеРеквизитыФНСПредставление);
	
	УстановитьПредставлениеПлатежныхРеквизитов(Перечисления.ВидыГосударственныхОрганов.ОрганФСС, Объект.КодПодчиненностиФСС, 
				ПлатежныеРеквизитыФССПредставление);
	
	УстановитьПредставлениеПлатежныхРеквизитов(Перечисления.ВидыГосударственныхОрганов.ОрганПФР, Объект.КодОрганаПФР, 
				ПлатежныеРеквизитыПФРПредставление);
	
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Ссылка));
	
	ВидимостьЭлементовДиректБанк = ЭлектронныеДокументыБПВызовСервера.ВидимостьЭлементовДиректБанк(
		Объект.Ссылка, БанковскийСчет.Банк);
	ЦветГиперссылки = ЦветаСтиля.ЦветГиперссылки;
	
	УправлениеФормой(ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
	// ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	ОбработкаНовостейПереопределяемый.КонтекстныеНовости_ПриСозданииНаСервере(
		ЭтаФорма,
		"БП.Справочник.Организации",
		"ФормаОрганизации",
		НСтр("ru='Новости: Организация'"),
		ИдентификаторыСобытийПриОткрытии
	);
	// Конец ИнтернетПоддержкаПользователей.Новости.КонтекстныеНовости_ПриСозданииНаСервере

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Не ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
		ОрганизацияСсылка = Объект.Ссылка;
	КонецЕсли;
	
	ПрочитатьРегистрациюВНалоговомОргане();
	
	ПрочитатьРегистрацияВОрганеПФР();
	
	ПрочитатьОсновнойБанковскийСчет();
	
	НаименованиеТОГС = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.НаименованиеТОГС(Объект.КодОрганаФСГС);
	
	ПрочитатьКонтактнуюИнформацию(ТекущийОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда 
		ОповеститьВФорме("ОткрытиеФормыНовойОрганизации");
	КонецЕсли;
	
	ПроверитьИдентификационныеНомераНалогоплательщиков();
	
	ОформитьПредставлениеСистемыНалогообложения();
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
	ОбработкаНовостейКлиент.КонтекстныеНовости_ПриОткрытии(ЭтаФорма);
	// Конец ИнтернетПоддержкаПользователей.Новости.ПриОткрытии
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Игнорируем собственные оповещения, которые предназначены для других форм.
	Если Источник = ЭтотОбъект ИЛИ РассылкаОповещенияИзТекущейФормы Тогда
		Возврат;
	КонецЕсли;

	// Подсистема "Свойства"
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	
	Если ИмяСобытия = "ИзмененаРегистрацияВНалоговомОргане" Тогда
		
		Если НЕ ТолькоПросмотр Тогда
		
			Если РегистрацияВНалоговомОргане.Ссылка = Параметр.Ссылка Тогда
				
				ОбновитьРегистрациюПослеЗаписиВФормеРегистрации(РегистрацияВНалоговомОргане.Ссылка);
				
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ИзменениеОтветственныхЛиц" Тогда
		
		ОбновитьИнформациюОбответственныхЛицах();
	
	ИначеЕсли ИмяСобытия = "ЗагруженАдресныйКлассификатор" Тогда
		
		АдресныйКлассификаторПуст = АдресныйКлассификаторПуст();
		
		Элементы.ГруппаЗагрузкаАдресногоКлассификатора.Видимость = НЕ ИспользоватьРазделениеПоОбластямДанных И АдресныйКлассификаторПуст;
		
	ИначеЕсли ИмяСобытия = "ИзмененБанковскийСчет" И Параметр.Ссылка = Объект.ОсновнойБанковскийСчет Тогда
		
		ПрочитатьОсновнойБанковскийСчет();
		
	ИначеЕсли ИмяСобытия = "УстановкаОсновногоБанковскогоСчета" 
		  ИЛИ ИмяСобытия = "УстановкаОсновногоБанковскогоСчетаПриЗаписи" Тогда
		  
		Если НЕ ТолькоПросмотр Тогда
		  
			Если Объект.Ссылка = Параметр.КонтрагентОрганизация Тогда
				
				// Если основным назначен другой банковский счет, то разблокируем предыдущий основной
				Если Объект.ОсновнойБанковскийСчет <> Параметр.ОсновнойБанковскийСчет 
					И БанковскийСчетЗаблокирован Тогда
					РазблокироватьБанковскийСчетПриРедактированииНаСервере(Объект.ОсновнойБанковскийСчет, УникальныйИдентификатор);
					БанковскийСчетЗаблокирован = Ложь;
				КонецЕсли; 
				
				Объект.ОсновнойБанковскийСчет = Параметр.ОсновнойБанковскийСчет;
				
				ПрочитатьОсновнойБанковскийСчет();
				
				Если НЕ Модифицированность Тогда
					Записать();
				КонецЕсли;
				
				ОповеститьВФорме("УстановкаОсновногоБанковскогоСчетаВыполнена");
				
			КонецЕсли;
			
		КонецЕсли;
	
	ИначеЕсли ИмяСобытия = "ИзменениеУчетнойПолитики" Тогда
		
		Если Параметр = Объект.Ссылка
		 Или Параметр = ОбщегоНазначенияБПВызовСервераПовтИсп.ГоловнаяОрганизация(Объект.Ссылка) Тогда
	
			УплачиватьДобровольныеВзносыВФСС = УплачиватьДобровольныеВзносыВФСС(Объект.Ссылка);
			УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("Организация", Объект.Ссылка));
			СистемаНалогообложенияПредставление = ПредставлениеСистемыНалогообложения(Объект.Ссылка);
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "Запись_ПрисоединенныйФайл"
		И Параметр.ВладелецФайла = Объект.Ссылка Тогда
		
		Модифицированность = Истина;
		Если ЗначениеЗаполнено(ВыбираемаяКартинка) Тогда
			
			ФайлКартинки = ?(ТипЗнч(Источник) = Тип("Массив"), Источник[0], Источник);
			УстановитьКартинкуВЭлементе(ФайлКартинки, ВыбираемаяКартинка);
			
			ВыбираемаяКартинка = Неопределено;
			
		КонецЕсли;
		
	ИначеЕсли ИмяСобытия = "ОтредактированаИстория" Тогда
		Если Параметр.ИмяРегистра = "ИсторияРегистрацийВНалоговомОргане"
			И Параметр.ВедущийОбъект = Объект.Ссылка Тогда
			
			ИсторияРегистрацийВНалоговомОрганеНаборЗаписей.Очистить();
			Для Каждого ЗаписьНабора Из Параметр.НаборЗаписей Цикл
				ЗаписьИстории = ИсторияРегистрацийВНалоговомОрганеНаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(ЗаписьИстории, ЗаписьНабора);
			КонецЦикла;
			
			ПослеРедактированияИсторииРегистрацийВНалоговомОргане();
			
		ИначеЕсли Параметр.ИмяРегистра = "ИсторияРегистрацийВОрганеПФР" Тогда
			РедактированиеПериодическихСведенийКлиент.ОбработкаОповещения(ЭтотОбъект, ОрганизацияСсылка, ИмяСобытия, Параметр, Источник);
			Объект.РегистрационныйНомерПФР = ИсторияРегистрацийВОрганеПФР.РегистрационныйНомерПФР;
		КонецЕсли;
	КонецЕсли; 
	
	УправлениеФормой(ЭтотОбъект);
	
	// ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	// Конец ИнтернетПоддержкаПользователей.Новости.ОбработкаОповещения
	
	Если ИмяСобытия = "СозданаНастройкаОбменаСБанком" Тогда
		
		ВидимостьЭлементовДиректБанк = ЭлектронныеДокументыБПВызовСервера.ВидимостьЭлементовДиректБанк(
			Объект.Ссылка, БанковскийСчет.Банк);
			
		ПоказатьЭлементыДиректБанк(ЭтотОбъект);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ИмяОбработкиВводаКонтактнойИнформации = "Обработка.ВводКонтактнойИнформации";
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И Лев(ИсточникВыбора.ИмяФормы, СтрДлина(ИмяОбработкиВводаКонтактнойИнформации)) = ИмяОбработкиВводаКонтактнойИнформации Тогда
		
		Возврат;
		
	ИначеЕсли ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
			И ИсточникВыбора.ИмяФормы = "Справочник.РегистрацииВНалоговомОргане.Форма.ФормаПредставителя"
			И ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Модифицированность = Истина;
		ЗаполнитьЗначенияСвойств(РегистрацияВНалоговомОргане, ВыбранноеЗначение);
		
	ИначеЕсли ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма")
		И ВРег(ИсточникВыбора.ИмяФормы) = ВРег("Справочник.Организации.Форма.РедактированиеИсторииНаименований") Тогда
		
		УстановитьНаименованиеПослеРедактированияИстории(ВыбранноеЗначение.ИсторияНаименований);
		Если ВыбранноеЗначение.Свойство("Наименование") Тогда
			Объект.Наименование = ВыбранноеЗначение.Наименование;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Модифицированность	= Истина;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыбранноеЗначение);
		ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЭтоНовый = Ложь;
	
	Если Параметры.Ключ.Пустая() Тогда
		ЭтоНовый = Истина;
		ТекущийОбъект.УстановитьСсылкуНового(ОрганизацияСсылка);
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ЗаписьНового", Истина);
	ИначеЕсли ТекущийОбъект.ЮридическоеФизическоеЛицо <> Параметры.Ключ.ЮридическоеФизическоеЛицо Тогда
		ПараметрыЗаписи.Вставить("ИзменениеВидаОрганизации", Истина);
	КонецЕсли;
	
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект, Отказ);
	
	ТекущийОбъект.РегистрационныйНомерПФР = ИсторияРегистрацийВОрганеПФР.РегистрационныйНомерПФР;
	
	ТекущийОбъект.НаименованиеНалоговогоОргана = РегистрацияВНалоговомОргане.НаименованиеИФНС;
	
	Если ТекущийОбъект.РегистрацияВНалоговомОргане <> РегистрацияВНалоговомОргане.Ссылка
		ИЛИ НЕ ЗначениеЗаполнено(ТекущийОбъект.РегистрацияВНалоговомОргане) Тогда
		//Если основная регистрация заполнена, а данные для сохранения регистрации есть,
		//то нужно установить ссылку для поля РегистрацияВНалоговомОргане
		//В ПриЗаписи эта ссылка будет использована для сохранения регистрации в налоговом органе
		Если МожноСохранитьРегистрацию(ЭтотОбъект) Тогда
			
			Если ЗначениеЗаполнено(РегистрацияВНалоговомОргане.Ссылка) Тогда
				ТекущийОбъект.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОргане.Ссылка;
			Иначе
				ТекущийОбъект.РегистрацияВНалоговомОргане = Справочники.РегистрацииВНалоговомОргане.ПолучитьСсылку();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИзмененБанковскийСчет Тогда
		Если ЗначениеЗаполнено(БанковскийСчет.НомерСчета) И ЗначениеЗаполнено(БанковскийСчет.Банк)Тогда
			
			НайденныйБанковскийСчет = Справочники.БанковскиеСчета.БанковскийСчетПоРеквизитам(ТекущийОбъект.Ссылка, 
				БанковскийСчет.Банк, БанковскийСчет.НомерСчета);
				
			Если ЗначениеЗаполнено(ТекущийОбъект.ОсновнойБанковскийСчет) Тогда
				// Снимаем блокировку для прежнего банковского счета перед его заменой новым.
				РазблокироватьДанныеДляРедактирования(ТекущийОбъект.ОсновнойБанковскийСчет, УникальныйИдентификатор);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НайденныйБанковскийСчет) Тогда
				ТекущийОбъект.ОсновнойБанковскийСчет = НайденныйБанковскийСчет;
				ОсновнойБанковскийСчетОбъект = НайденныйБанковскийСчет.ПолучитьОбъект();
				ЗначениеВРеквизитФормы(ОсновнойБанковскийСчетОбъект, "БанковскийСчет");
				ИзмененБанковскийСчет = Ложь;
			Иначе
				ТекущийОбъект.ОсновнойБанковскийСчет = Справочники.БанковскиеСчета.ПолучитьСсылку();
				ОбъектРегистрации = Справочники.БанковскиеСчета.СоздатьЭлемент();
				ОбъектРегистрации.УстановитьСсылкуНового(ТекущийОбъект.ОсновнойБанковскийСчет);
				ОбъектРегистрации.Банк = БанковскийСчет.Банк;
				ОбъектРегистрации.НомерСчета = БанковскийСчет.НомерСчета;
				ОбъектРегистрации.ВалютаДенежныхСредств = БанковскийСчет.ВалютаДенежныхСредств;
				ЗначениеВРеквизитФормы(ОбъектРегистрации, "БанковскийСчет");
			КонецЕсли;
			
		Иначе
			ТекущийОбъект.ОсновнойБанковскийСчет = Справочники.БанковскиеСчета.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	// Обработчик подсистемы "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	ПараметрыЗаписи.Вставить("ОсновнаяОрганизацияПередЗаписью",
		БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
	
	ПараметрыЗаписи.Вставить("ИспользоватьНесколькоОрганизацийПередЗаписью", 
		Справочники.Организации.ИспользуетсяНесколькоОрганизаций());
	
	ПараметрыЗаписи.Вставить("ИспользуемыеСистемыНалогообложенияПередЗаписью", 
		РегистрыСведений.УчетнаяПолитикаОрганизаций.ПолучитьИспользуемыеСистемыНалогообложения());
		
	ПараметрыЗаписи.Вставить("ИспользуемыеВидыОрганизацийПередЗаписью", 
		Справочники.Организации.ИспользуемыеВидыОрганизаций());
		
	ПараметрыЗаписи.Вставить("ИспользуетсяПодсистемаУчетаЗарплатыИКадровПередЗаписью",
		УчетЗарплаты.ИспользуетсяПодсистемаУчетаЗарплатыИКадров());
		
	Если Объект.НекредитнаяФинансоваяОрганизация Тогда
		ПараметрыЗаписи.Вставить("ИспользоватьСтатьиДДСПередЗаписью",
			ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиДвиженияДенежныхСредств"));
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("ВедетсяУчетНФОПередЗаписью",
		ПолучитьФункциональнуюОпцию("ВедетсяУчетНФО"));

	ПараметрыЗаписи.Вставить("ЭтоНовый", ЭтоНовый);
		
	Если Справочники.Организации.КоличествоОрганизаций() = 0 Тогда
		// Это первая организация в базе, заполнение поставляемых видов налогов и платежей в бюджет 
		// надо выполнять после установки всех настроек в совокупности: 
		// параметров учета, свойства организации и учетной политики.
		ТекущийОбъект.ДополнительныеСвойства.Вставить("ТребуетсяСоздатьПоставляемыеВидыНалогов", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьДанныеРегистрацииВНалоговомОргане(ТекущийОбъект, Отказ);
	
	ЗаписатьОсновнойБанковскийСчет(ТекущийОбъект);
	
	РедактированиеПериодическихСведений.ЗаписатьЗаписьПослеРедактированияВФорме(ЭтотОбъект, "ИсторияРегистрацийВОрганеПФР", ОрганизацияСсылка);
	
	ТребуетсяСоздатьПоставляемыеВидыНалогов = Истина;
	Если ТекущийОбъект.ДополнительныеСвойства.Свойство("ТребуетсяСоздатьПоставляемыеВидыНалогов") Тогда
		ТребуетсяСоздатьПоставляемыеВидыНалогов = ТекущийОбъект.ДополнительныеСвойства.ТребуетсяСоздатьПоставляемыеВидыНалогов;
	КонецЕсли;
	
	Если НЕ ТекущийОбъект.ОбособленноеПодразделение Тогда
		СозданаУчетнаяПолитика = СоздатьУчетнуюПолитику(ТекущийОбъект.Ссылка, СтруктураУчетнойПолитики, ТребуетсяСоздатьПоставляемыеВидыНалогов);
		
		Если НЕ СозданаУчетнаяПолитика И ПараметрыЗаписи.Свойство("ИзменениеВидаОрганизации") Тогда
			СозданаУчетнаяПолитика = ПроверитьУчетнуюПолитику(ТекущийОбъект.Ссылка);
		КонецЕсли; 
	Иначе
		СозданаУчетнаяПолитика = Ложь;
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("СозданаУчетнаяПолитика", СозданаУчетнаяПолитика);

	Если ТребуетсяСоздатьПоставляемыеВидыНалогов Тогда
		// Поставляемые виды налогов создаются в событии ПриЗаписи() организации 
		// и подписки для регистра сведений учетной политики. 
	Иначе
		// При записи первой организации обновление поставляемых видов налогов и платежей в бюджет 
		// выполняем после установки всех влияющих настроек: параметров учета, свойств организации и ее учетной политики.
		Справочники.ВидыНалоговИПлатежейВБюджет.СоздатьПоставляемыеЭлементы();
	КонецЕсли;
		
	ОтветственныйПриЗаписиНаСервере(Отказ, ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Перем СозданаУчетнаяПолитика;
	
	Если Не ПараметрыЗаписи.Свойство("СозданаУчетнаяПолитика", СозданаУчетнаяПолитика) Тогда
		СозданаУчетнаяПолитика = Ложь;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ЭтоНовый") И ПараметрыЗаписи.ЭтоНовый Тогда
		// При записи новой организации необходимо обновить кэш повторно используемых значений,
		// т.к. ряд функций кэшируют в нем список организаций.
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("ОсновнаяОрганизацияПослеЗаписи",
		БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация"));
	
	ПараметрыЗаписи.Вставить("ИспользоватьНесколькоОрганизацийПослеЗаписи", 
		Справочники.Организации.ИспользуетсяНесколькоОрганизаций());
		
	Если СозданаУчетнаяПолитика Тогда
		ПараметрыЗаписи.Вставить("ИспользуемыеСистемыНалогообложенияПослеЗаписи", 
			РегистрыСведений.УчетнаяПолитикаОрганизаций.ПолучитьИспользуемыеСистемыНалогообложения());
	КонецЕсли;
	
	ПараметрыЗаписи.Вставить("ИспользуемыеВидыОрганизацийПослеЗаписи", 
		Справочники.Организации.ИспользуемыеВидыОрганизаций());
	
	Если Объект.НекредитнаяФинансоваяОрганизация Тогда
		ПараметрыЗаписи.Вставить("ИспользоватьСтатьиДДСПослеЗаписи",
			ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиДвиженияДенежныхСредств"));
	КонецЕсли;
		
	ПараметрыЗаписи.Вставить("ВедетсяУчетНФОПослеЗаписи",
		ПолучитьФункциональнуюОпцию("ВедетсяУчетНФО"));
	
	Если ЭтоФизЛицо Тогда
		ФизлицоПослеЗаписиНаСервере();
	КонецЕсли;
	
	ПрочитатьРегистрациюВНалоговомОргане();
	
	ПрочитатьРегистрацияВОрганеПФР();
	
	ПрочитатьОсновнойБанковскийСчет();
	
	РезультатВыполнения = КалендарьБухгалтера.ЗапуститьЗаполнениеВФоне(УникальныйИдентификатор, ТекущийОбъект.Ссылка, СозданаУчетнаяПолитика);
	ПараметрыЗаписи.Вставить("РезультатВыполненияЗаданияКалендаряБухгалтера", РезультатВыполнения);
	
	ПараметрыЗаписи.Вставить("ИспользуетсяПодсистемаУчетаЗарплатыИКадровПослеЗаписи",
		УчетЗарплаты.ИспользуетсяПодсистемаУчетаЗарплатыИКадров());
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Перем ИспользоватьНесколькоОрганизацийПередЗаписью, ИспользоватьНесколькоОрганизацийПослеЗаписи;
	Перем ИспользуемыеСистемыНалогообложенияПередЗаписью, ИспользуемыеСистемыНалогообложенияПослеЗаписи;
	Перем ИспользуемыеВидыОрганизацийПередЗаписью, ИспользуемыеВидыОрганизацийПослеЗаписи;
	Перем ИспользуетсяПодсистемаУчетаЗарплатыИКадровПередЗаписью, ИспользуетсяПодсистемаУчетаЗарплатыИКадровПослеЗаписи;
	Перем ИспользоватьСтатьиДДСПередЗаписью, ИспользоватьСтатьиДДСПослеЗаписи;
	Перем ОсновнаяОрганизацияПередЗаписью, ОсновнаяОрганизацияПослеЗаписи;
	Перем ВедетсяУчетНФОПередЗаписью, ВедетсяУчетНФОПослеЗаписи;
	
	ОформитьПредставлениеСистемыНалогообложения();
	
	ОбновитьИнтерфейс = Ложь;
	
	Если ПараметрыЗаписи.Свойство("ИспользоватьНесколькоОрганизацийПередЗаписью", ИспользоватьНесколькоОрганизацийПередЗаписью)
		И ПараметрыЗаписи.Свойство("ИспользоватьНесколькоОрганизацийПослеЗаписи", ИспользоватьНесколькоОрганизацийПослеЗаписи) Тогда
		
		Если ИспользоватьНесколькоОрганизацийПередЗаписью <> ИспользоватьНесколькоОрганизацийПослеЗаписи Тогда
			ОбновитьИнтерфейс = Истина;
		КонецЕслИ;
		
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ИспользуемыеСистемыНалогообложенияПередЗаписью", ИспользуемыеСистемыНалогообложенияПередЗаписью)
		И ПараметрыЗаписи.Свойство("ИспользуемыеСистемыНалогообложенияПослеЗаписи", ИспользуемыеСистемыНалогообложенияПослеЗаписи) Тогда
		
		Для Каждого КлючИЗначение Из ИспользуемыеСистемыНалогообложенияПередЗаписью Цикл
			СтароеЗначение = КлючИЗначение.Значение;
			НовоеЗначение = Неопределено;
			Если НЕ ИспользуемыеСистемыНалогообложенияПослеЗаписи.Свойство(КлючИЗначение.Ключ, НовоеЗначение)
				ИЛИ СтароеЗначение <> НовоеЗначение Тогда
				ОбновитьИнтерфейс = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ИспользуемыеВидыОрганизацийПередЗаписью", ИспользуемыеВидыОрганизацийПередЗаписью)
		И ПараметрыЗаписи.Свойство("ИспользуемыеВидыОрганизацийПослеЗаписи", ИспользуемыеВидыОрганизацийПослеЗаписи) Тогда
		
		Для Каждого КлючИЗначение Из ИспользуемыеВидыОрганизацийПередЗаписью Цикл
			СтароеЗначение = КлючИЗначение.Значение;
			НовоеЗначение = Неопределено;
			Если НЕ ИспользуемыеВидыОрганизацийПослеЗаписи.Свойство(КлючИЗначение.Ключ, НовоеЗначение)
				ИЛИ СтароеЗначение <> НовоеЗначение Тогда
				ОбновитьИнтерфейс = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ИспользуетсяПодсистемаУчетаЗарплатыИКадровПередЗаписью", ИспользуетсяПодсистемаУчетаЗарплатыИКадровПередЗаписью)
		И ПараметрыЗаписи.Свойство("ИспользуетсяПодсистемаУчетаЗарплатыИКадровПослеЗаписи", ИспользуетсяПодсистемаУчетаЗарплатыИКадровПослеЗаписи) Тогда
		
		Если ИспользуетсяПодсистемаУчетаЗарплатыИКадровПередЗаписью <> ИспользуетсяПодсистемаУчетаЗарплатыИКадровПослеЗаписи Тогда
			ОбновитьИнтерфейс = Истина;
		КонецЕслИ;
		
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ИспользоватьСтатьиДДСПередЗаписью", ИспользоватьСтатьиДДСПередЗаписью)
		И ПараметрыЗаписи.Свойство("ИспользоватьСтатьиДДСПослеЗаписи", ИспользоватьСтатьиДДСПослеЗаписи) Тогда
		
		Если ИспользоватьСтатьиДДСПередЗаписью <> ИспользоватьСтатьиДДСПослеЗаписи Тогда
			ОбновитьИнтерфейс = Истина;
		КонецЕслИ;
		
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ВедетсяУчетНФОПередЗаписью", ВедетсяУчетНФОПередЗаписью)
		И ПараметрыЗаписи.Свойство("ВедетсяУчетНФОПослеЗаписи", ВедетсяУчетНФОПослеЗаписи) Тогда
		
		Если ВедетсяУчетНФОПередЗаписью <> ВедетсяУчетНФОПослеЗаписи Тогда
			ОбновитьИнтерфейс = Истина;
		КонецЕслИ;
		
	КонецЕсли;
	
	Если ОбновитьИнтерфейс Тогда
		ОбновитьИнтерфейс();
	КонеЦесли;
	
	// Оповестим другие открытые формы о записанных изменениях в данных организации.
	ПараметрыЗаписиОрганизации = Новый Структура();
	Если ПараметрыЗаписи.Свойство("ЭтоНовый") Тогда
		ПараметрыЗаписиОрганизации.Вставить("ЭтоНовый", ПараметрыЗаписи.ЭтоНовый);
	КонецЕсли;
	ОповеститьВФорме("Запись_Организации", ПараметрыЗаписиОрганизации, Объект.Ссылка);
	
	ОповеститьОбИзменении(Тип("СправочникСсылка.ВидыНалоговИПлатежейВБюджет"));
	
	Если ЗначениеЗаполнено(Объект.РегистрацияВНалоговомОргане) Тогда
		ОповеститьВФорме("ИзмененаРегистрацияВНалоговомОргане", Новый Структура("Ссылка", Объект.РегистрацияВНалоговомОргане), ЭтотОбъект);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("РезультатВыполненияЗаданияКалендаряБухгалтера") Тогда
		КалендарьБухгалтераКлиент.ОжидатьЗавершениеЗаполненияВФоне(ПараметрыЗаписи.РезультатВыполненияЗаданияКалендаряБухгалтера);
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ОсновнаяОрганизацияПередЗаписью", ОсновнаяОрганизацияПередЗаписью)
		И ПараметрыЗаписи.Свойство("ОсновнаяОрганизацияПослеЗаписи", ОсновнаяОрганизацияПослеЗаписи) Тогда
		
		Если ОсновнаяОрганизацияПередЗаписью <> ОсновнаяОрганизацияПослеЗаписи Тогда
			ОповеститьВФорме("ИзменениеОсновнойОрганизации", ОсновнаяОрганизацияПослеЗаписи);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Объект.ВидОбменаСКонтролирующимиОрганами = ПредопределенноеЗначение("Перечисление.ВидыОбменаСКонтролирующимиОрганами.ОбменВУниверсальномФормате") Тогда
		ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ПроверитьПараметрыПодключенияК1СОтчетности(Объект.Ссылка, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени("СохранениеИзмененийВОрганизации");
	
	Если НЕ ЗначениеЗаполнено(ИсторияРегистрацийВОрганеПФР.Период) Тогда
		ИсторияРегистрацийВОрганеПФР.Период = Дата(1980,1,1);
	Иначе
		Если ИсторияРегистрацийВОрганеПФРПрежняя.РегистрационныйНомерПФР <> ИсторияРегистрацийВОрганеПФР.РегистрационныйНомерПФР Тогда
			Если ЗначениеЗаполнено(ИсторияРегистрацийВОрганеПФРПрежняя.РегистрационныйНомерПФР) Тогда
				ИсторияРегистрацийВОрганеПФР.Период = НачалоКвартала(ТекущаяДата());
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	БанковскиеСчетаФормыКлиент.ПередЗаписью(БанковскийСчет.НомерСчета, БИКБанка, Объект.Ссылка, Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	РедактированиеПериодическихСведений.ПроверитьЗаписьВФорме(ЭтотОбъект, "ИсторияРегистрацийВОрганеПФР", ОрганизацияСсылка, Отказ);
	
	Если НЕ ЭтоФизЛицо Тогда
		Если ЗначениеЗаполнено(Объект.КодНалоговогоОргана)
			И Не ЗначениеЗаполнено(Объект.КПП) Тогда
			ТекстСообщения = НСтр("ru = 'Поле ""КПП"" не заполнено'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Объект.КПП", , Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Если ОтчетностьПодписываетПредставитель = 1
		И НЕ ЗначениеЗаполнено(РегистрацияВНалоговомОргане.Представитель) Тогда
		
		ТекстСообщения = НСтр("ru = 'Заполните сведения о представителе'"); 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ПредставлениеПредставителя",, Отказ);
		
	КонецЕсли;
	
	Справочники.БанковскиеСчета.ОбработкаПроверкиЗаполнения(БанковскийСчет, БИКБанка, Истина, Отказ);
	
	// Удаляем из проверяемых реквизитов все, по которым автоматическая проверка не нужна:
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПолейФормы

&НаКлиенте
Процедура ПолеПоискаИННПриИзменении(Элемент)
	
	Если ЗаполнятьРеквизитыПоИНН 
		И ЗначениеЗаполнено(ПолеПоискаИНН)
		И НЕ ЗначениеЗаполнено(Объект.Наименование)
		И НЕ ЗначениеЗаполнено(Объект.НаименованиеПолное)
		И (НЕ ЗначениеЗаполнено(КонтактнаяИнформацияПолеЮрАдресОрганизации)
		ИЛИ КонтактнаяИнформацияПолеЮрАдресОрганизации = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки()) Тогда
		
		ЗаполнятьРеквизитыПоИНН = Ложь;
		
		ИННОбъекта = СокрП(ПолеПоискаИНН);
		
		ЗаполнитьРеквизитыПоДаннымЕГРНаКлиенте(ИННОбъекта, Ложь);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Не ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьСистемаНалогообложения", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", Истина);
	Если Объект.Ссылка.Пустая() Тогда
		
		ПараметрыФормы.Вставить("РежимПовторногоВыбораСистемыНалогообложения", Истина);
		ПараметрыФормы.Вставить("ВидОрганизации",                              ВидОрганизации);
		Если СтруктураУчетнойПолитики <> Неопределено Тогда // мы уже имеем ранее выбиравшиеся параметры
			
			ПараметрыФормы.Вставить("СистемаНалогообложения", СтруктураУчетнойПолитики.СистемаНалогообложения);
		
			ДополнительныеПараметрыУчетнойПолитики = Новый Массив;
			ДополнительныеПараметрыУчетнойПолитики.Добавить("ОбъектНалогообложенияУСН");
			ДополнительныеПараметрыУчетнойПолитики.Добавить("ПлательщикЕНВД");
			ДополнительныеПараметрыУчетнойПолитики.Добавить("ПрименяетсяУСНПатент");
		
			ЗначениеДополнительногоПараметра = Неопределено;
			Для каждого ПараметрУчетнойПолитики Из ДополнительныеПараметрыУчетнойПолитики Цикл
				Если Не СтруктураУчетнойПолитики.Свойство(ПараметрУчетнойПолитики, ЗначениеДополнительногоПараметра) Тогда
					Продолжить;
				КонецЕсли;
				ПараметрыФормы.Вставить(ПараметрУчетнойПолитики, ЗначениеДополнительногоПараметра);
			КонецЦикла; 
			
		КонецЕсли;
		
		ОткрытьФорму("Справочник.Организации.Форма.ФормаВыбораСистемыНалогообложения",
			ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе
		
		ПараметрыФормы.Вставить("Ключ", КлючЗаписиУчетнойПолитики(Объект.Ссылка));
		
		ОткрытьФорму("РегистрСведений.УчетнаяПолитикаОрганизаций.ФормаЗаписи",
			ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеИПНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьИсториюНаименований();
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеСокращенноеПриИзменении(Элемент)
	
	ПриИзмененииСокращенногоНаименования();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)
	
	ПослеИзмененияПолногоНаименования();
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияНаименованиеНажатие(Элемент)
	
	ОткрытьИсториюНаименований();
	
КонецПроцедуры

&НаКлиенте
Процедура ГоловнаяОрганизацияПриИзменении(Элемент)
	
	ГоловнаяОрганизацияПриИзмененииНаСервере();
	ОформитьПредставлениеСистемыНалогообложения();
	
КонецПроцедуры

&НаСервере
Процедура ГоловнаяОрганизацияПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.ГоловнаяОрганизация) Тогда
		Объект.ИНН = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ГоловнаяОрганизация, "ИНН");
	Иначе
		Объект.ИНН = "";
	КонецЕсли;
	
	УстановитьРегистрациюВНалоговомОргане();
	
	СистемаНалогообложенияПредставление = ПредставлениеСистемыНалогообложения(Объект.ГоловнаяОрганизация);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	
	Объект.ИНН = СокрП(Объект.ИНН);
	
	УстановитьСвойстваФизическогоЛицаПослеЗаполнения();
	
КонецПроцедуры

&НаКлиенте
Процедура КПППриИзменении(Элемент)
	
	ПриИзмененииКПП();
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПолеПочтовыйАдресОрганизацииПриИзменении(Элемент)
	
	Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПолеЮрАдресОрганизацииНажатие(Элемент, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентБП.НачалоВыбора(ЭтотОбъект, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЮрФактАдресаСовпадаютПриИзменении(Элемент)
	
	Если ЮрФактАдресаСовпадают Тогда
		СкопироватьПолеКонтактнойИнформации("КонтактнаяИнформацияПолеФактАдресОрганизации", "КонтактнаяИнформацияПолеЮрАдресОрганизации");
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПолеПочтовыйАдресОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПолеФактАдресОрганизацииНажатие(Элемент, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиентБП.НачалоВыбора(ЭтотОбъект, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПолеТелефонОрганизацииПриИзменении(Элемент)
	
	Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПолеТелефонОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПолеФаксОрганизацииПриИзменении(Элемент)
	
	Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПолеФаксОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПолеEmailОрганизацииПриИзменении(Элемент)
	
	Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПолеEmailОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПолеУчредительныйАдресИностраннойОрганизацииПриИзменении(Элемент)
	
	Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПолеУчредительныйАдресИностраннойОрганизацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЮрПочтовыйАдресаСовпадаютПриИзменении(Элемент)
	
	Если ЮрПочтовыйАдресаСовпадают Тогда
		СкопироватьПолеКонтактнойИнформации("КонтактнаяИнформацияПолеПочтовыйАдресОрганизации", "КонтактнаяИнформацияПолеЮрАдресОрганизации");
		
		Если КонтактнаяИнформацияПолеПочтовыйАдресОрганизации = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки() Тогда
			КонтактнаяИнформацияПолеПочтовыйАдресОрганизации = "";
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИПРегистрационныйНомерПФРПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.РегистрационныйНомерПФР) Тогда
		КодОрганаПФР = ПолучитьКодОрганаПФР(Объект.ИПРегистрационныйНомерПФР);
		Если НЕ ПустаяСтрока(КодОрганаПФР) Тогда
			Объект.КодОрганаПФР = КодОрганаПФР;
		КонецЕсли;
		КодОрганаПФРПриИзмененииНаСервере();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияВОрганеПФРПриИзменении(Элемент)
	
	Объект.РегистрационныйНомерПФР = ИсторияРегистрацийВОрганеПФР.РегистрационныйНомерПФР;
	РедактированиеПериодическихСведенийКлиентСервер.ОбновитьОтображениеПолейВвода(ЭтотОбъект, "ИсторияРегистрацийВОрганеПФР", ОрганизацияСсылка);
	КодОрганаПФР = ПолучитьКодОрганаПФР(Объект.РегистрационныйНомерПФР);
	Если НЕ ПустаяСтрока(КодОрганаПФР) Тогда
		Объект.КодОрганаПФР = КодОрганаПФР;
	КонецЕсли;
	КодОрганаПФРПриИзмененииНаСервере();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИПРегистрационныйНомерФССПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.РегистрационныйНомерФСС) Тогда
		КодПодчиненностиФСС = ПолучитьКодПодчиненностиФСС(Объект.ИПРегистрационныйНомерФСС);
		Если НЕ ПустаяСтрока(КодПодчиненностиФСС) Тогда
			Объект.КодПодчиненностиФСС = КодПодчиненностиФСС;
		КонецЕсли;
		КодОрганаФССПриИзмененииНаСервере();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрационныйНомерФССПриИзменении(Элемент)
	
	КодПодчиненностиФСС = ПолучитьКодПодчиненностиФСС(Объект.РегистрационныйНомерФСС);
	Если НЕ ПустаяСтрока(КодПодчиненностиФСС) Тогда
		Объект.КодПодчиненностиФСС = КодПодчиненностиФСС;
	КонецЕсли;
	КодОрганаФССПриИзмененииНаСервере();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КодОКОПФНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КомментарийВыбора = НСтр("ru='Внимание! С 2015 г.введен в действие новый классификатор ОКОПФ
	                             |(приказ Росстандарта 12.12.2014 № 2011-ст).'");
	
	ВыбратьКодИзКлассификатора("ОКОПФ", КомментарийВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура КодОКОПФПриИзменении(Элемент)
	
	Объект.НаименованиеОКОПФ = НаименованиеОКОПФ(Объект.КодОКОПФ);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КодОКФСПриИзменении(Элемент)
	
	Объект.НаименованиеОКФС = НаименованиеОКФС(Объект.КодОКФС);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КодОКФСНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	ВыбратьКодИзКлассификатора("ОКФС");
	
КонецПроцедуры

&НаКлиенте
Процедура КодОКВЭДПриИзменении(Элемент)
	
	// Исправление возможной опечатки в разделителе
	Объект.КодОКВЭД = СтрЗаменить(Объект.КодОКВЭД, ",", ".");
	
	Объект.НаименованиеОКВЭД = НаименованиеОКВЭД(Объект.КодОКВЭД);
	
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура КодОКВЭДНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыбратьКодИзКлассификатора("ОКВЭД");
	
КонецПроцедуры

&НаКлиенте
Процедура КодПоОКПОПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КодОрганаФСГСПолучателяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ОписаниеОповещения", Новый ОписаниеОповещения("ОбработкаВыбораКодОрганаФСГСПолучателя", ЭтотОбъект));
	
	Если ЗначениеЗаполнено(Объект.КодОрганаФСГС) Тогда
		ДополнительныеПараметры.Вставить("ТекущийКодТОГС", Объект.КодОрганаФСГС);
	Иначе
		Отбор = Новый Структура("ИмяРеквизита");
		Отбор.ИмяРеквизита = "КонтактнаяИнформацияПолеЮрАдресОрганизации";
		ДанныеИсточника = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
		Если ДанныеИсточника.Количество() > 0 Тогда
			ЗначенияПолей = ДанныеИсточника[0].ЗначенияПолей;
			КодРегиона = КодРегионаПоАдресу(ЗначенияПолей);
			Если ЗначениеЗаполнено(КодРегиона) Тогда
				ДополнительныеПараметры.Вставить("КодРегиона", Формат(КодРегиона, "ЧЦ=2; ЧН=; ЧВН="));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ВыбратьКодОрганаТОГС(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ИПИспользуетТрудНаемныхРаботниковПриИзменении(Элемент)
	
	Если НЕ Объект.ИПИспользуетТрудНаемныхРаботников Тогда
		Объект.РегистрационныйНомерПФР = "";
		ИсторияРегистрацийВОрганеПФР.РегистрационныйНомерПФР = "";
		Объект.РегистрационныйНомерТФОМС = "";
		Объект.РегистрационныйНомерФСС = "";
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКПП()
	ПроверитьСоответствиеТребованиямКПП();
	
	Если НЕ КППСоответствуетТребованиям Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрДлина(Объект.КПП) >= 4 
		И ПустаяСтрока(Объект.КодНалоговогоОргана) Тогда
		
		Объект.КодНалоговогоОргана = Лев(Объект.КПП, 4);
		КодНалоговогоОрганаПриИзмененииНаСервере();
	Иначе
		УстановитьРегистрациюВНалоговомОргане();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура КрупнейшийНалогоплательщикПриИзменении(Элемент)
	
	Элементы.КодНалоговогоОрганаПолучателя.Доступность = Объект.КрупнейшийНалогоплательщик;
	
	Если НЕ Объект.КрупнейшийНалогоплательщик Тогда
		Объект.КодНалоговогоОрганаПолучателя = "";
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ФамилияИППриИзменении(Элемент)
	
	ФИОПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяИППриИзменении(Элемент)
	
	ФИОПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчествоИППриИзменении(Элемент)
	
	ФИОПриИзменении();
	
КонецПроцедуры

&НаКлиенте
Процедура КодНалоговогоОрганаПриИзменении(Элемент)
	
	КодНалоговогоОрганаПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияВНалоговомОрганеКодПоОКАТОПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КодОрганаПФРПриИзменении(Элемент)
	
	КодОрганаПФРПриИзмененииНаСервере();
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КодПодчиненностиФССПриИзменении(Элемент)
	
	КодОрганаФССПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ИностраннаяОрганизацияПриИзменении(Элемент)
	
	Если НЕ Объект.ИностраннаяОрганизация Тогда
		Объект.НаименованиеИнострОрганизации    = "";
		Объект.СтранаРегистрации                = Неопределено;
		Объект.СтранаПостоянногоМестонахождения = Неопределено;
		Объект.КодВСтранеРегистрации            = "";
		КонтактнаяИнформацияПолеУчредительныйАдресИностраннойОрганизации = "";
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СтранаРегистрацииПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(Объект.СтранаПостоянногоМестонахождения) Тогда
		Объект.СтранаПостоянногоМестонахождения	= Объект.СтранаРегистрации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияВНалоговомОрганеНаименованиеИФНСПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетностьПодписываетПредставительПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
	Если ОтчетностьПодписываетПредставитель = 0 Тогда
		РегистрацияВНалоговомОргане.Представитель                   = Неопределено;
		РегистрацияВНалоговомОргане.УполномоченноеЛицоПредставителя = "";
		РегистрацияВНалоговомОргане.ДокументПредставителя           = "";
		РегистрацияВНалоговомОргане.Доверенность                    = "";
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеПредставителяНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура("Владелец,Представитель,УполномоченноеЛицоПредставителя,ДокументПредставителя,Доверенность");
	ЗаполнитьЗначенияСвойств(ЗначенияЗаполнения, РегистрацияВНалоговомОргане);
	
	ПараметрыФормы = Новый Структура("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.РегистрацииВНалоговомОргане.Форма.ФормаПредставителя", ПараметрыФормы, ЭтотОбъект, КлючУникальности);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияВНалоговомОрганеНаименованиеПриИзменении(Элемент)
	
	Модифицированность = Истина;
	НалоговыйОрганУстановитьЗаголовок(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияВНалоговомОрганеКодПоОКТМОПриИзменении(Элемент)
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеТерриториальногоОрганаПФРПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеТерриториальногоОрганаФССПриИзменении(Элемент)
	УправлениеФормой(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеИнострОрганизацииПриИзменении(Элемент)
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияРегистрацийВНалоговомОрганеНажатие(Элемент)
	
	Если НЕ ЗначениеЗаполнено(РегистрацияВНалоговомОргане.Ссылка) Тогда
		
		ЗаписатьРегистрациюВНалоговомОргане();
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("НаборЗаписей, ВедущийОбъект, ВладелецРегистрацииВНалоговомОргане, ТолькоПросмотр", 
				ИсторияРегистрацийВНалоговомОрганеНаборЗаписей, 
				Объект.Ссылка,
				ВладелецРегистрации(ЭтаФорма),
				ТолькоПросмотр);
	
	ОткрытьФорму("РегистрСведений.ИсторияРегистрацийВНалоговомОргане.Форма.РедактированиеИстории", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаПриИзменении(Элемент)
	
	Если НЕ ЗаблокироватьБанковскийСчетПриРедактировании() Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененБанковскийСчет = Истина;
	
	Элементы.ПодсказкаНомерСчета.Гиперссылка = Ложь;
	БанковскиеСчетаФормыКлиент.УстановитьВалютуПодсказкуСчета(
		БанковскийСчет, ЭтаФорма, БИКБанка, ЦветВыделенияНекорректногоЗначение, Истина);
	
	БанковскиеСчетаФормыКлиентСервер.УстановитьЗаголовокГруппыРеквизитовСчета(ЭтотОбъект, БанковскийСчет);
	
	ПоказатьЭлементыДиректБанк(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура НекредитнаяФинансоваяОрганизацияПриИзменении(Элемент)
	
	Если НЕ Объект.НекредитнаяФинансоваяОрганизация Тогда
		Объект.КодОсновногоВидаДеятельностиНФО          = "";
		Объект.НаименованиеОсновногоВидаДеятельностиНФО = "";
		Объект.КодИныхВидовДеятельностиНФО              = "";
		Объект.НаименованиеИныхВидовДеятельностиНФО     = "";
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура КодОсновногоВидаДеятельностиНФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьКодИзКлассификатора("ВидыДеятельностиНФО", , "КодОсновногоВидаДеятельностиНФО");
	
КонецПроцедуры

&НаКлиенте
Процедура КодОсновногоВидаДеятельностиНФОПриИзменении(Элемент)
	
	Объект.НаименованиеОсновногоВидаДеятельностиНФО = НаименованиеПоКлассификатору(
		"ВидыДеятельностиНФО", Объект.КодОсновногоВидаДеятельностиНФО);
	УправлениеФормой(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура КодИныхВидовДеятельностиНФОНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ИмяКлассификатора = "ВидыДеятельностиНФО";
	ИмяРеквизитаКод   = "КодИныхВидовДеятельностиНФО";
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипОбъекта",      "Справочник");
	ПараметрыФормы.Вставить("НазваниеОбъекта", "Организации");
	ПараметрыФормы.Вставить("НазваниеМакета",  ИмяКлассификатора);
	ПараметрыФормы.Вставить("ТекущийПериод",   ТекущаяДата());
	ТекущийСписок = СтрРазделить(Объект[ИмяРеквизитаКод], ", ", Ложь);
	ПараметрыФормы.Вставить("ТекущийСписок",   ТекущийСписок);
	ПараметрыФормы.Вставить("Комментарий",     "");
	ПараметрыФормы.Вставить("ВыборСпискаКодов", Истина);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяКлассификатора", ИмяКлассификатора);
	ДополнительныеПараметры.Вставить("ИмяРеквизитаКод",   ИмяРеквизитаКод);
	ДополнительныеПараметры.Вставить("ИмяРеквизитаНаименование", "Наименование" + Сред(ИмяРеквизитаКод, 4));
	                                                
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьКодИныхВидовДеятельностиНФОЗавершение", 
		ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораКода", ПараметрыФормы,,,,, ОповещениеОЗакрытии);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоказатьКонтекстныеНовости(Команда)

	ОбработкаНовостейКлиент.КонтекстныеНовости_ОбработкаКомандыНовости(
		ЭтаФорма,
		Команда
	);

КонецПроцедуры


&НаКлиенте
Процедура ЗагрузитьКартинкуЛоготип(Команда)
	
	ЗагрузитьКартинку("Логотип");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзПрисоединенныхФайловЛоготип(Команда)
	
	ВыбратьКартинкуИзПрисоединенныхФайлов("Логотип");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЛоготип(Команда)
	
	ОчиститьКартинку("Логотип");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуФаксимиле(Команда)
	
	ЗагрузитьКартинку("ФаксимильнаяПечать");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзПрисоединенныхФайловФаксимиле(Команда)
	
	ВыбратьКартинкуИзПрисоединенныхФайлов("ФаксимильнаяПечать");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьФаксимиле(Команда)
	
	ОчиститьКартинку("ФаксимильнаяПечать");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьАдресныйКлассификатор(Команда)
	
	АдресныйКлассификаторКлиент.ЗагрузитьАдресныйКлассификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеНаПодключениеОткрытьМастер(Команда)
	
	Если Объект.Ссылка.Пустая() ИЛИ Модифицированность Тогда
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
		
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьФормуМастераЗаявленияНаПодключение(Объект.Ссылка, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрацияВОрганеПФРИстория(Команда)
	РедактированиеПериодическихСведенийКлиент.ОткрытьИсторию("ИсторияРегистрацийВОрганеПФР", ОрганизацияСсылка, ЭтотОбъект, ТолькоПросмотр);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоИНН(Команда)
	
	Если НЕ ЗаполнятьРеквизитыПоИНН Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.ОбособленноеПодразделение Тогда
		ПоказатьПредупреждение(, НСтр("ru='Реквизиты обособленных подразделений заполняются вручную.'"));
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ИНН) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Поле ""ИНН"" не заполнено'"));
		ТекущийЭлемент = Элементы.ИНН;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыПоДаннымЕГРНаКлиенте(Объект.ИНН);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоДаннымЕГР(Команда)
	
	Если НЕ ЗаполнятьРеквизитыПоИНН Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПолеПоискаИНН) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Введите ИНН'"));
		ТекущийЭлемент = Элементы.ПолеПоискаИНН;
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыПоДаннымЕГРНаКлиенте(ПолеПоискаИНН);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыНалоговогоОрганаПоКоду(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.КодНалоговогоОргана) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Поле ""Код инспекции"" не заполнено'"));
		ТекущийЭлемент = Элементы.КодНалоговогоОргана;
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗаполнениеСведенийОНалоговойИнспекции();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыФССПоКоду(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.КодПодчиненностиФСС) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Поле ""Код подчиненности"" не заполнено'"));
		ТекущийЭлемент = Элементы.КодПодчиненностиФСС;
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗаполнениеСведенийОбОтделенииФСС();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПФРПоКоду(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.КодОрганаПФР) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Поле ""Код органа ПФР"" не заполнено'"));
		ТекущийЭлемент = Элементы.КодОрганаПФР;
		Возврат;
	КонецЕсли;
	
	ВыполнитьЗаполнениеСведенийОбОтделенииПФР();

КонецПроцедуры

&НаКлиенте
Процедура РегистрацияОрганизации(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОповещениеПослеПеререгистрации", "Подключаемый_ВыполненаРегистрацияОрганизации");
	ОткрытьФорму("Обработка.НачалоРаботы.Форма.СведенияОЛицензии", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// Процедура показывает новости, требующие прочтения (важные и очень важные)
//
// Параметры:
//  Нет
//
&НаКлиенте
Процедура Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии()

	// ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии
	ИдентификаторыСобытийПриОткрытии = "ПриОткрытии";
	// Конец ИнтернетПоддержкаПользователей.Новости.Подключаемый_ПоказатьНовостиТребующиеПрочтенияПриОткрытии

	ОбработкаНовостейКлиент.КонтекстныеНовости_ПоказатьНовостиТребующиеПрочтенияПриОткрытии(ЭтаФорма, ИдентификаторыСобытийПриОткрытии);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСистемаНалогообложения(ПараметрыУчетнойПолитики, ДополнительныеПараметры = Неопределено) Экспорт
		
	Если ПараметрыУчетнойПолитики <> Неопределено Тогда // организация ещё не записывалась в базу
		ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(СтруктураУчетнойПолитики, ПараметрыУчетнойПолитики, Истина);
		СистемаНалогообложенияПредставление = ПредставлениеСистемыНалогообложения(СтруктураУчетнойПолитики);
	ИначеЕсли Не Объект.Ссылка.Пустая() Тогда // изменяем текущую политику у ранее созданной организации
		СистемаНалогообложенияПредставление = ПредставлениеСистемыНалогообложения(ОрганизацияСсылка);
	КонецЕсли;
	ОформитьПредставлениеСистемыНалогообложения();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
// Формирует строковое представление системы налогообложения, используемой в организации.
//
// Параметры:
//  ИсточникУчетнойПолитики - Структура - набор параметров учетной политики. См. ФормаВыбораСистемыНалогообложения, процедура СоздатьОрганизацию().
//                          - СправочникСсылка.Организации - информация о системе налогообложения берется из информационной базы по данной организации.
//
Функция ПредставлениеСистемыНалогообложения(Знач ИсточникУчетнойПолитики)
	
	Если ТипЗнч(ИсточникУчетнойПолитики) = Тип("СправочникСсылка.Организации") Тогда
		// Преобразуем ссылку на организацию в структуру параметров учетной политики.
		ИсточникУчетнойПолитики = ПараметрыСистемыНалогообложенияПоОрганизации(ИсточникУчетнойПолитики);
	КонецЕсли;
	
	СистемаНалогообложенияОписание = "";
	Если Не ИсточникУчетнойПолитики.ПрименяетсяУСН И Не ИсточникУчетнойПолитики.ПлательщикНДС Тогда
		
		Если ИсточникУчетнойПолитики.ПрименяетсяУСНПатент Тогда
			
			СистемаНалогообложенияОписание = НСтр("ru = 'Патентная'");
			
			Если ИсточникУчетнойПолитики.ПлательщикЕНВД Тогда
				СистемаНалогообложенияОписание = СистемаНалогообложенияОписание + ", " + НСтр("ru = 'ЕНВД'");
			КонецЕсли;
			
		ИначеЕсли ИсточникУчетнойПолитики.ПлательщикЕНВД Тогда
			СистемаНалогообложенияОписание = НСтр("ru = 'ЕНВД'");
		КонецЕсли;
			
	Иначе
	
		Если ИсточникУчетнойПолитики.ПрименяетсяУСН Тогда
			ПредставлениеОбъектаНалогообложения = ?(ИсточникУчетнойПолитики.ПрименяетсяУСНДоходыМинусРасходы,
				НСтр("ru = 'доходы минус расходы'"), НСтр("ru = 'доходы'"));
			СистемаНалогообложенияОписание = НСтр("ru = 'Упрощенная'") + " (" + ПредставлениеОбъектаНалогообложения + ")";
		Иначе
			СистемаНалогообложенияОписание = НСтр("ru = 'Общая'");
		КонецЕсли;
		Если ИсточникУчетнойПолитики.ПрименяетсяУСНПатент Тогда
			СистемаНалогообложенияОписание = СистемаНалогообложенияОписание + ", " + НСтр("ru = 'Патент'");
		КонецЕсли;
		Если ИсточникУчетнойПолитики.ПлательщикЕНВД Тогда
			СистемаНалогообложенияОписание = СистемаНалогообложенияОписание + ", " + НСтр("ru = 'ЕНВД'");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СистемаНалогообложенияОписание;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПараметрыСистемыНалогообложенияПоОрганизации(Знач ОрганизацияСУчетнойПолитикой)
	
	ПараметрыУчетнойПолитики = Новый Структура;
	ПараметрыУчетнойПолитики.Вставить("ПрименяетсяУСН",                   Ложь);
	ПараметрыУчетнойПолитики.Вставить("ПрименяетсяУСНПатент",             Ложь);
	ПараметрыУчетнойПолитики.Вставить("ПрименяетсяУСНДоходыМинусРасходы", Ложь);
	ПараметрыУчетнойПолитики.Вставить("ПлательщикНДС",                    Ложь);
	ПараметрыУчетнойПолитики.Вставить("ПлательщикЕНВД",                   Ложь);
	
	ДатаПолученияИнформации = ТекущаяДатаСеанса();
	
	Если УчетнаяПолитика.ПрименяетсяУСН(ОрганизацияСУчетнойПолитикой, ДатаПолученияИнформации) Тогда
		
		ОбъектНалогообложения = УчетнаяПолитика.ОбъектНалогообложенияУСН(ОрганизацияСУчетнойПолитикой, ДатаПолученияИнформации);
		ПараметрыУчетнойПолитики.Вставить("ПрименяетсяУСНДоходыМинусРасходы",
			ОбъектНалогообложения = Перечисления.ОбъектыНалогообложенияПоУСН.ДоходыМинусРасходы);
		ПараметрыУчетнойПолитики.Вставить("ОбъектНалогообложенияУСН", ОбъектНалогообложения);
			
		ПараметрыУчетнойПолитики.Вставить("ПрименяетсяУСН", Истина);
		ПараметрыУчетнойПолитики.Вставить("СистемаНалогообложения", Перечисления.СистемыНалогообложения.Упрощенная);
			
	Иначе
		
		ПараметрыУчетнойПолитики.Вставить("ПлательщикНДС",
			Не УчетнаяПолитика.ТолькоОсобыйПорядокНалогообложения(ОрганизацияСУчетнойПолитикой, ДатаПолученияИнформации));
		ПараметрыУчетнойПолитики.Вставить("СистемаНалогообложения",
			?(ПараметрыУчетнойПолитики.ПлательщикНДС, Перечисления.СистемыНалогообложения.Общая, Перечисления.СистемыНалогообложения.ОсобыйПорядок));

	КонецЕсли;
	
	Если УчетнаяПолитика.ПрименяетсяУСНПатент(ОрганизацияСУчетнойПолитикой, ДатаПолученияИнформации) Тогда
		ПараметрыУчетнойПолитики.Вставить("ПрименяетсяУСНПатент", Истина);
	КонецЕсли;
	Если УчетнаяПолитика.ПлательщикЕНВД(ОрганизацияСУчетнойПолитикой, ДатаПолученияИнформации) Тогда
		ПараметрыУчетнойПолитики.Вставить("ПлательщикЕНВД", Истина);
	КонецЕсли;
	
	Возврат ПараметрыУчетнойПолитики;
	
КонецФункции

&НаКлиенте
Процедура ОформитьПредставлениеСистемыНалогообложения()
	
	Если ЗначениеЗаполнено(СистемаНалогообложенияПредставление) Тогда
		Если ВидОрганизации = "ОбособленноеПодразделение" И Параметры.Ключ.Пустая() Тогда
			// Система налогообложения обособленного подразделения не выбирается, т.к. не может отличаться от головной организации.
			Элементы.СистемаНалогообложенияПредставление.Гиперссылка = Ложь;
			Элементы.СистемаНалогообложенияПредставление.ЦветТекста = ЦветНезаполненныйРеквизит;
		Иначе
			Элементы.СистемаНалогообложенияПредставление.Гиперссылка = Истина;
			Элементы.СистемаНалогообложенияПредставление.ЦветТекста = ЦветГиперссылкаТабличнойЧасти;
		КонецЕсли;
	Иначе
		СистемаНалогообложенияПредставление = НСтр("ru='<Не указана система налогообложения>'");
		Элементы.СистемаНалогообложенияПредставление.Гиперссылка = Ложь;
		Элементы.СистемаНалогообложенияПредставление.ЦветТекста = ЦветНезаполненныйРеквизит;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлючЗаписиУчетнойПолитики(ОрганизацияСсылка)
	
	Если Не ЗначениеЗаполнено(ОрганизацияСсылка) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	// Определяем дату последней записи учетной политики.
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчетнаяПолитикаОрганизацийСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(&Сегодня, Организация = &Организация) КАК УчетнаяПолитикаОрганизацийСрезПоследних";
	Сегодня = ТекущаяДата();
	Запрос.УстановитьПараметр("Сегодня", Сегодня);
	Запрос.УстановитьПараметр("Организация", ОрганизацияСсылка);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ДатаУчетнойПолитики = НачалоГода(Сегодня);
	Иначе 
		ДатаУчетнойПолитики = Результат.Выгрузить().Получить(0).Период;
	КонецЕсли;
	
	ЗначенияКлюча = Новый Структура;
	ЗначенияКлюча.Вставить("Организация", ОрганизацияСсылка);
	ЗначенияКлюча.Вставить("Период",      ДатаУчетнойПолитики);
	Возврат РегистрыСведений.УчетнаяПолитикаОрганизаций.СоздатьКлючЗаписи(ЗначенияКлюча);
	
КонецФункции

&НаСервере
Процедура УстановитьНаименованиеИП()
	
	ФИОЗаполнено = ЗначениеЗаполнено(Объект.ФамилияИП) ИЛИ ЗначениеЗаполнено(Объект.ИмяИП)
		ИЛИ ЗначениеЗаполнено(Объект.ОтчествоИП);
	
	Если ЗначениеЗаполнено(Объект.НаименованиеСокращенное) И ФИОЗаполнено Тогда
		НаименованиеИП = СокрЛП(Объект.НаименованиеСокращенное);
		Элементы.НаименованиеИП.Гиперссылка = Истина;
		Элементы.НаименованиеИП.ЦветТекста = ЦветаСтиля["ГиперссылкаТабличнойЧасти"];
	Иначе
		НаименованиеИП = НСтр("ru='<Не заполнено ФИО>'");
		Элементы.НаименованиеИП.Гиперссылка = Ложь;
		Элементы.НаименованиеИП.ЦветТекста = ЦветаСтиля["НезаполненныйРеквизит"];
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "КПП");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ЭтоФизЛицо", ВидСравненияКомпоновкиДанных.Равно, Ложь);

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.КодНалоговогоОргана", ВидСравненияКомпоновкиДанных.Заполнено);

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.КПП", ВидСравненияКомпоновкиДанных.НеЗаполнено);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "НомерСчета");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"БанковскийСчет.Банк", ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Банк");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"БанковскийСчет.НомерСчета", ВидСравненияКомпоновкиДанных.НеЗаполнено);
		
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция УплачиватьДобровольныеВзносыВФСС(Организация)
	
	УплачиватьДобровольныеВзносыВФСС =  ПолучитьФункциональнуюОпцию("УплачиватьДобровольныеВзносыВФСС", Новый Структура("Организация", Организация));
	
	Возврат УплачиватьДобровольныеВзносыВФСС;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	ЭтоНовый = НЕ ЗначениеЗаполнено(Объект.Ссылка);
	
	// Наименование
	Элементы.ИсторияНаименований.Доступность = НЕ ЭтоНовый;
	
	// Группа Адрес и телефоны
	Если Форма.ЮрФактАдресаСовпадают Тогда
		Элементы.ГруппаФактАдресОрганизации.ТекущаяСтраница	= Элементы.СтраницаФактАдресОрганизацииСовпадает;
	Иначе
		Элементы.ГруппаФактАдресОрганизации.ТекущаяСтраница	= Элементы.СтраницаФактАдресОрганизации;
	КонецЕсли;
	
	Если Форма.ЮрПочтовыйАдресаСовпадают Тогда
		Элементы.ГруппаПочтовыйАдресОрганизации.ТекущаяСтраница	= Элементы.СтраницаПочтовыйАдресОрганизацииСовпадает;
	Иначе
		Элементы.ГруппаПочтовыйАдресОрганизации.ТекущаяСтраница	= Элементы.СтраницаПочтовыйАдресОрганизации;
	КонецЕсли;
	
	Если ПустаяСтрока(Форма.КонтактнаяИнформацияПолеФактАдресОрганизации)
		ИЛИ Форма.КонтактнаяИнформацияПолеФактАдресОрганизации = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки() Тогда
			Форма.ФактАдресОрганизацииСовпадает = НСтр("ru = '<не заполнен>'");
	Иначе
		Форма.ФактАдресОрганизацииСовпадает = Форма.КонтактнаяИнформацияПолеФактАдресОрганизации;
	КонецЕсли;
	
	Если ПустаяСтрока(Форма.КонтактнаяИнформацияПолеПочтовыйАдресОрганизации)
		ИЛИ Форма.КонтактнаяИнформацияПолеПочтовыйАдресОрганизации = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки() Тогда
			Форма.ПочтовыйАдресОрганизацииСовпадает = НСтр("ru = '<не заполнен>'");
	Иначе
		Форма.ПочтовыйАдресОрганизацииСовпадает = Форма.КонтактнаяИнформацияПолеПочтовыйАдресОрганизации;
	КонецЕсли;
	
	ДоступностьКонтактнойИнформации = НЕ Форма.ТолькоПросмотр;
	
	Элементы.КонтактнаяИнформацияПолеЮрАдресОрганизации.Доступность = ДоступностьКонтактнойИнформации;
	Элементы.КонтактнаяИнформацияПолеФактАдресОрганизации.Доступность = ДоступностьКонтактнойИнформации;
	Элементы.ФактАдресОрганизацииСовпадает.Доступность = ДоступностьКонтактнойИнформации;
	Элементы.ЮрФактАдресаСовпадают.Доступность = ДоступностьКонтактнойИнформации;
	Элементы.НадписьПочтовыйАдрес.Доступность = ДоступностьКонтактнойИнформации;
	Элементы.ЮрПочтовыйАдресаСовпадают.Доступность = ДоступностьКонтактнойИнформации;
	Элементы.ПочтовыйАдресОрганизацииСовпадает.Доступность = ДоступностьКонтактнойИнформации;
	Элементы.КонтактнаяИнформацияПолеПочтовыйАдресОрганизации.ТолькоПросмотр = Форма.ТолькоПросмотр;
	Элементы.КонтактнаяИнформацияПолеТелефонОрганизации.ТолькоПросмотр = Форма.ТолькоПросмотр;
	Элементы.КонтактнаяИнформацияПолеФаксОрганизации.ТолькоПросмотр = Форма.ТолькоПросмотр;
	Элементы.КонтактнаяИнформацияПолеEmailОрганизации.ТолькоПросмотр = Форма.ТолькоПросмотр;
	Элементы.КонтактнаяИнформацияПолеДругаяИнформацияОрганизации.ТолькоПросмотр = Форма.ТолькоПросмотр;
	
	АдресИТелефонУстановитьЗаголовок(Форма);
	
	// Группа Подписи
	ПодписиУстановитьЗаголовок(Форма);
	
	// Группа Логотип и подпись
	ИменаКартинок = Новый Структура;
	ИменаКартинок.Вставить("Логотип",                   НСтр("ru='логотип'"));
	ИменаКартинок.Вставить("Печать",                    НСтр("ru='печать'"));
	ИменаКартинок.Вставить("ПодписьРуководителя",       НСтр("ru='подпись'"));
	ИменаКартинок.Вставить("ПодписьГлавногоБухгалтера", НСтр("ru='подпись'"));
	ИменаКартинок.Вставить("ФаксимильнаяПечать",        НСтр("ru='факсимильную печать и подпись'"));
	Для Каждого КлючИЗначение Из ИменаКартинок Цикл
		ИмяФайла       = "Файл" + КлючИЗначение.Ключ;
		ЭлементФормы   = "ЗагрузитьОчистить" + КлючИЗначение.Ключ;
		ОбъектДействия = КлючИЗначение.Значение;
		Если Объект[ИмяФайла].Пустая() Тогда
			Форма[ЭлементФормы] = СтрШаблон(НСтр("ru='Загрузить %1'"), ОбъектДействия); // Например, "Загрузить логотип"
		Иначе
			Форма[ЭлементФормы] = СтрШаблон(НСтр("ru='Очистить %1'"),  ОбъектДействия); // Например, "Очистить логотип"
		Конецесли;
	КонецЦикла;
	
	Элементы.ДекорацияПредупреждениеФорматФаксимиле.Видимость = 
		ЗначениеЗаполнено(Объект.ФайлФаксимильнаяПечать)
		И НЕ (ЗначениеЗаполнено(Объект.ФайлПечать) 
		ИЛИ ЗначениеЗаполнено(Объект.ФайлПодписьРуководителя)
		ИЛИ ЗначениеЗаполнено(Объект.ФайлПодписьГлавногоБухгалтера));
	
	// Группа Налоговая инспекция
	КодНалоговогоОрганаУказан = ЗначениеЗаполнено(Объект.КодНалоговогоОргана);
	
	Элементы.РегистрацияВНалоговомОрганеНаименование.Доступность = КодНалоговогоОрганаУказан;
	Элементы.РегистрацияВНалоговомОрганеНаименованиеИФНС.Доступность = КодНалоговогоОрганаУказан;
	Элементы.ПлатежныеРеквизитыФНСПредставление.Доступность    = КодНалоговогоОрганаУказан И НЕ Форма.ТолькоПросмотр;
	Элементы.РегистрацияВНалоговомОрганеКодПоОКТМО.Доступность = КодНалоговогоОрганаУказан;
	Элементы.РегистрацияВНалоговомОрганеКодПоОКАТО.Доступность = КодНалоговогоОрганаУказан;
	Элементы.ГруппаПодписаниеОтчетности.Доступность            = КодНалоговогоОрганаУказан И НЕ Форма.ТолькоПросмотр;
	
	Элементы.РегистрацияВНалоговомОрганеНаименование.ТолькоПросмотр = Форма.ТолькоПросмотр;
	Элементы.РегистрацияВНалоговомОрганеНаименованиеИФНС.ТолькоПросмотр = Форма.ТолькоПросмотр;
	Элементы.РегистрацияВНалоговомОрганеКодПоОКТМО.ТолькоПросмотр = Форма.ТолькоПросмотр;
	Элементы.РегистрацияВНалоговомОрганеКодПоОКАТО.ТолькоПросмотр = Форма.ТолькоПросмотр;
	
	//Группа элементов представителя для предоставления отчетности
	Если Форма.ОтчетностьПодписываетПредставитель = 1 Тогда
		Элементы.ГруппаПредставлениеПредставителяСтраницы.ТекущаяСтраница = Элементы.ГруппаПредставительГиперссылка;
	Иначе
		Элементы.ГруппаПредставлениеПредставителяСтраницы.ТекущаяСтраница = Элементы.ГруппаПредставительНеВыбран;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Форма.РегистрацияВНалоговомОргане.Представитель) Тогда
		Форма.ПредставлениеПредставителя = НСтр("ru = 'Заполнить'");
	ИначеЕсли ТипЗнч(Форма.РегистрацияВНалоговомОргане.Представитель) = Тип("СправочникСсылка.ФизическиеЛица")
		ИЛИ НЕ ЗначениеЗаполнено(Форма.РегистрацияВНалоговомОргане.УполномоченноеЛицоПредставителя) Тогда
		Форма.ПредставлениеПредставителя = Форма.РегистрацияВНалоговомОргане.Представитель;
	ИначеЕсли ТипЗнч(Форма.РегистрацияВНалоговомОргане.Представитель) = Тип("СправочникСсылка.Контрагенты") Тогда
		Форма.ПредставлениеПредставителя = Форма.РегистрацияВНалоговомОргане.УполномоченноеЛицоПредставителя + " (" + Форма.РегистрацияВНалоговомОргане.Представитель + ")";
	КонецЕсли;
	
	НалоговыйОрганУстановитьЗаголовок(Форма);
	
	// Группа Пенсионный фонд
	КодОрганаПФРУказан = ЗначениеЗаполнено(Объект.КодОрганаПФР);
	Элементы.ПлатежныеРеквизитыПФРПредставление.Доступность = КодОрганаПФРУказан И НЕ Форма.ТолькоПросмотр;
	Элементы.НаименованиеТерриториальногоОрганаПФР.Доступность = КодОрганаПФРУказан;
	
	Элементы.НаименованиеТерриториальногоОрганаПФР.ТолькоПросмотр = Форма.ТолькоПросмотр;
	
	ПенсионныйФондУстановитьЗаголовок(Форма);
	
	// Группа Фонд социального страхования
	ГруппаФССВидимость = НЕ Форма.ЭтоФизЛицо ИЛИ (Форма.ЭтоФизЛицо И (Объект.ИПИспользуетТрудНаемныхРаботников ИЛИ Форма.УплачиватьДобровольныеВзносыВФСС));
	
	Элементы.ГруппаФСС.Видимость = ГруппаФССВидимость;
	КодПодчиненностиФССУказан = ЗначениеЗаполнено(Объект.КодПодчиненностиФСС);
	Элементы.ПлатежныеРеквизитыФССПредставление.Доступность = КодПодчиненностиФССУказан И НЕ Форма.ТолькоПросмотр;
	Элементы.НаименованиеТерриториальногоОрганаФСС.Доступность = КодПодчиненностиФССУказан;
	
	Элементы.НаименованиеТерриториальногоОрганаФСС.ТолькоПросмотр = Форма.ТолькоПросмотр;
	
	ФондСоциальногоСтрахованияУстановитьЗаголовок(Форма);
	
	// Рег номера за сотрудников
	ВидимостьФондов = НЕ Форма.ЭтоФизЛицо ИЛИ (Форма.ЭтоФизЛицо И Объект.ИПИспользуетТрудНаемныхРаботников);
	Элементы.РегистрационныйНомерПФР.Видимость				= ВидимостьФондов;
	Элементы.РегистрационныйНомерТФОМС.Видимость			= ВидимостьФондов;
	Элементы.РегистрационныйНомерФСС.Видимость				= ВидимостьФондов;
	Элементы.РегистрацияВОрганеПФРИстория.Видимость			= ВидимостьФондов;
	
	// Группа Коды статистики
	КодыУстановитьЗаголовок(Форма);
	
	// Группа Некредитная финансовая организация
	НекредитнаяФинансоваяОрганизацияУстановитьЗаголовок(Форма);
	Элементы.КодОсновногоВидаДеятельностиНФО.Доступность          = Объект.НекредитнаяФинансоваяОрганизация;
	Элементы.НаименованиеОсновногоВидаДеятельностиНФО.Доступность = Объект.НекредитнаяФинансоваяОрганизация;
	Элементы.КодИныхВидовДеятельностиНФО.Доступность              = Объект.НекредитнаяФинансоваяОрганизация;
	Элементы.НаименованиеИныхВидовДеятельностиНФО.Доступность     = Объект.НекредитнаяФинансоваяОрганизация;
	
	// Группа Крупнейший налогоплательщик
	КрупнейшийНалогоплательщикУстановитьЗаголовок(Форма);
	
	// Группа Иностранная организация
	Элементы.ГруппаИностраннаяОрганизация.Видимость			= НЕ Форма.ЭтоФизЛицо И Объект.ИностраннаяОрганизация;
	ИностраннаяОрганизацияУстановитьЗаголовок(Форма);
	
	ДоступностьИсторииРегистрацииВНалоговомОргане = МожноСохранитьРегистрацию(Форма) И ЗначениеЗаполнено(Объект.Ссылка);
	Элементы.ИсторияРегистрацийВНалоговомОрганеКПП.Доступность                  = ДоступностьИсторииРегистрацииВНалоговомОргане;
	Элементы.ИсторияРегистрацийВНалоговомОрганеКодНалоговогоОргана.Доступность = ДоступностьИсторииРегистрацииВНалоговомОргане;
	
	// Группа подписи
	Элементы.Руководитель.ТолькоПросмотр = Форма.ТолькоПросмотр;
	Элементы.РуководительДолжность.ТолькоПросмотр = Форма.ТолькоПросмотр;
	Элементы.ГлавныйБухгалтер.ТолькоПросмотр = Форма.ТолькоПросмотр;
	Элементы.ГлавныйБухгалтерДолжность.ТолькоПросмотр = Форма.ТолькоПросмотр;
	Элементы.Кассир.ТолькоПросмотр = Форма.ТолькоПросмотр;
	Элементы.КассирДолжность.ТолькоПросмотр = Форма.ТолькоПросмотр;

	БанковскиеСчетаФормыКлиентСервер.УстановитьЗаголовокГруппыРеквизитовСчета(Форма, Форма.БанковскийСчет);
	
	ПоказатьЭлементыДиректБанк(Форма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура АдресИТелефонУстановитьЗаголовок(Форма)
	
	АдресЗаголовок = НСтр("ru='Адрес и телефон'");
	Если ЗначениеЗаполнено(Форма.КонтактнаяИнформацияПолеЮрАдресОрганизации) И НЕ Форма.КонтактнаяИнформацияПолеЮрАдресОрганизации = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки() Тогда
		АдресЗаголовок = АдресЗаголовок + ": " + Форма.КонтактнаяИнформацияПолеЮрАдресОрганизации;
		Если ЗначениеЗаполнено(Форма.КонтактнаяИнформацияПолеТелефонОрганизации) Тогда
			АдресЗаголовок = АдресЗаголовок + НСтр("ru=', тел: '") + Форма.КонтактнаяИнформацияПолеТелефонОрганизации;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Форма.КонтактнаяИнформацияПолеТелефонОрганизации) Тогда
			АдресЗаголовок = АдресЗаголовок + НСтр("ru=': тел: '") + Форма.КонтактнаяИнформацияПолеТелефонОрганизации;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьЗаголовокГруппы(Форма, "ГруппаКонтактнаяИнформация", АдресЗаголовок);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПодписиУстановитьЗаголовок(Форма)
	
	ПодписиЗаголовок = НСтр("ru='Подписи'");
	Если НЕ Форма.ЭтоФизЛицо Тогда
		Если ЗначениеЗаполнено(Форма.Руководитель)
				ИЛИ ЗначениеЗаполнено(Форма.ГлавныйБухгалтер) Тогда
			ПодписиЗаголовок = ПодписиЗаголовок + ": ";
			Если ЗначениеЗаполнено(Форма.Руководитель) Тогда
				ПодписиЗаголовок = ПодписиЗаголовок + Форма.Руководитель;
			КонецЕсли;
			Если ЗначениеЗаполнено(Форма.ГлавныйБухгалтер) Тогда
				ПодписиЗаголовок = ПодписиЗаголовок + ", " + Форма.ГлавныйБухгалтер;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	УстановитьЗаголовокГруппы(Форма, "ГруппаПодписи", ПодписиЗаголовок);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НалоговыйОрганУстановитьЗаголовок(Форма)
	
	НалоговыйОрганЗаголовок = НСтр("ru='Налоговая инспекция'");
	Если ЗначениеЗаполнено(Форма.Объект.КодНалоговогоОргана) Тогда
		НалоговыйОрганЗаголовок = НалоговыйОрганЗаголовок + ": " + Форма.Объект.КодНалоговогоОргана + " " 
									+ Форма.РегистрацияВНалоговомОргане.Наименование;
	КонецЕсли;
	УстановитьЗаголовокГруппы(Форма, "ГруппаНалоговыйОрган", НалоговыйОрганЗаголовок);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ПенсионныйФондУстановитьЗаголовок(Форма)
	
	ПенсионныйФондЗаголовок = НСтр("ru='Пенсионный фонд'");
	Если Форма.ЭтоФизЛицо Тогда
		Если ЗначениеЗаполнено(Форма.Объект.ИПРегистрационныйНомерПФР) Тогда
			ПенсионныйФондЗаголовок = ПенсионныйФондЗаголовок + ": " + Форма.Объект.ИПРегистрационныйНомерПФР;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Форма.Объект.РегистрационныйНомерПФР) Тогда
			ПенсионныйФондЗаголовок = ПенсионныйФондЗаголовок + ": " + Форма.Объект.РегистрационныйНомерПФР;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.Объект.НаименованиеТерриториальногоОрганаПФР) Тогда
		ОрганПФРЗаголовок = Форма.Объект.НаименованиеТерриториальногоОрганаПФР;
		ОрганПФРЗаголовок = СтрЗаменить(ОрганПФРЗаголовок, НСтр("ru='Государственное учреждение - '"), "");
		ОрганПФРЗаголовок = СтрЗаменить(ОрганПФРЗаголовок, НСтр("ru='Государственное учреждение -'"), "");
		ОрганПФРЗаголовок = СтрЗаменить(ОрганПФРЗаголовок, НСтр("ru='Государственное учреждение- '"), "");
		ОрганПФРЗаголовок = СтрЗаменить(ОрганПФРЗаголовок, НСтр("ru='Государственное учреждение-'"), "");
		ОрганПФРЗаголовок = СтрЗаменить(ОрганПФРЗаголовок, НСтр("ru='Государственное учреждение'"), "");
		ПенсионныйФондЗаголовок = ПенсионныйФондЗаголовок + " " + ОрганПФРЗаголовок;
	КонецЕсли;
	УстановитьЗаголовокГруппы(Форма, "ГруппаПФР", ПенсионныйФондЗаголовок);	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ФондСоциальногоСтрахованияУстановитьЗаголовок(Форма)
	
	ФондСоциальногоСтрахованияЗаголовок = НСтр("ru='Фонд социального страхования'");
	Если Форма.ЭтоФизЛицо И Форма.УплачиватьДобровольныеВзносыВФСС Тогда
		Если ЗначениеЗаполнено(Форма.Объект.ИПРегистрационныйНомерФСС) Тогда
			ФондСоциальногоСтрахованияЗаголовок = ФондСоциальногоСтрахованияЗаголовок + ": " + Форма.Объект.ИПРегистрационныйНомерФСС;
		КонецЕсли;
	Иначе
		Если ЗначениеЗаполнено(Форма.Объект.РегистрационныйНомерФСС) Тогда
			ФондСоциальногоСтрахованияЗаголовок = ФондСоциальногоСтрахованияЗаголовок + ": " + Форма.Объект.РегистрационныйНомерФСС;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Форма.Объект.НаименованиеТерриториальногоОрганаФСС) Тогда
		ФондСоциальногоСтрахованияЗаголовок = ФондСоциальногоСтрахованияЗаголовок + " " + Форма.Объект.НаименованиеТерриториальногоОрганаФСС;
	КонецЕсли;
	УстановитьЗаголовокГруппы(Форма, "ГруппаФСС", ФондСоциальногоСтрахованияЗаголовок);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура КодыУстановитьЗаголовок(Форма)
	
	КодыЗаголовок = НСтр("ru='Коды статистики'");
	Если ЗначениеЗаполнено(Форма.Объект.КодОКОПФ) ИЛИ ЗначениеЗаполнено(Форма.Объект.КодОКФС)
			ИЛИ ЗначениеЗаполнено(Форма.Объект.КодОКВЭД) ИЛИ ЗначениеЗаполнено(Форма.Объект.КодПоОКПО) Тогда
		КодыЗаголовок = КодыЗаголовок + ": ";
		Если ЗначениеЗаполнено(Форма.Объект.КодОКОПФ) Тогда
			КодыЗаголовок = КодыЗаголовок + НСтр("ru='ОКОПФ '") + Форма.Объект.КодОКОПФ;
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Объект.КодОКФС) Тогда
			КодыЗаголовок = КодыЗаголовок + НСтр("ru=', ОКФС '")  + Форма.Объект.КодОКФС;
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Объект.КодОКВЭД) Тогда
			КодыЗаголовок = КодыЗаголовок + НСтр("ru=', ОКВЭД '") + Форма.Объект.КодОКВЭД;
		КонецЕсли;
		Если ЗначениеЗаполнено(Форма.Объект.КодПоОКПО) Тогда
			КодыЗаголовок = КодыЗаголовок + НСтр("ru=', ОКПО '")  + Форма.Объект.КодПоОКПО;
		КонецЕсли;
		КодыЗаголовок = СтрЗаменить(КодыЗаголовок, ": ,", ":");
	КонецЕсли;
	УстановитьЗаголовокГруппы(Форма, "ГруппаКоды", КодыЗаголовок);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НекредитнаяФинансоваяОрганизацияУстановитьЗаголовок(Форма)
	
	ЗаголовокГруппы = НСтр("ru='Некредитная финансовая организация'") + ": ";
	Если Форма.Объект.НекредитнаяФинансоваяОрганизация Тогда
		ЗаголовокГруппы = ЗаголовокГруппы + НСтр("ru='да'");
		Если ЗначениеЗаполнено(Форма.Объект.КодОсновногоВидаДеятельностиНФО)
			ИЛИ ЗначениеЗаполнено(Форма.Объект.НаименованиеОсновногоВидаДеятельностиНФО) Тогда
		
			ЗаголовокГруппы = ЗаголовокГруппы + ", ";
			Если ЗначениеЗаполнено(Форма.Объект.КодОсновногоВидаДеятельностиНФО) Тогда
				ЗаголовокГруппы = ЗаголовокГруппы + Форма.Объект.КодОсновногоВидаДеятельностиНФО;
				Если ЗначениеЗаполнено(Форма.Объект.НаименованиеОсновногоВидаДеятельностиНФО) Тогда
					ЗаголовокГруппы = ЗаголовокГруппы + " - ";
				КонецЕсли;
			КонецЕсли;
			Если ЗначениеЗаполнено(Форма.Объект.НаименованиеОсновногоВидаДеятельностиНФО) Тогда
				ЗаголовокГруппы = ЗаголовокГруппы + Форма.Объект.НаименованиеОсновногоВидаДеятельностиНФО;
			КонецЕсли;
		
		КонецЕсли;
	Иначе
		ЗаголовокГруппы = ЗаголовокГруппы + НСтр("ru='нет'");
	КонецЕсли;
	УстановитьЗаголовокГруппы(Форма, "ГруппаНекредитнаяФинансоваяОрганизация", ЗаголовокГруппы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура КрупнейшийНалогоплательщикУстановитьЗаголовок(Форма)
	
	Если НЕ Форма.ЭтоФизЛицо И НЕ Форма.Объект.ОбособленноеПодразделение Тогда
		Если Форма.Объект.КрупнейшийНалогоплательщик Тогда
			КрупнейшийНалогоплательщикЗаголовок = НСтр("ru='Крупнейший налогоплательщик: да'");
		Иначе
			КрупнейшийНалогоплательщикЗаголовок = НСтр("ru='Крупнейший налогоплательщик: нет'");
		КонецЕсли;
		УстановитьЗаголовокГруппы(Форма, "ГруппаКрупнейшийНалогоплательщик", КрупнейшийНалогоплательщикЗаголовок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИностраннаяОрганизацияУстановитьЗаголовок(Форма)
	
	Если НЕ Форма.ЭтоФизЛицо Тогда
		Если ЗначениеЗаполнено(Форма.Объект.НаименованиеИнострОрганизации) Тогда
			ИностраннаяОрганизацияЗаголовок = НСтр("ru='Иностранная организация: '") + Форма.Объект.НаименованиеИнострОрганизации;
		Иначе
			ИностраннаяОрганизацияЗаголовок = НСтр("ru='Иностранная организация'");
		КонецЕсли;
		УстановитьЗаголовокГруппы(Форма, "ГруппаИностраннаяОрганизация", ИностраннаяОрганизацияЗаголовок);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокГруппы(Форма, НазваниеГруппы, ЗаголовокТекст)
	
	Форма.Элементы[НазваниеГруппы].ЗаголовокСвернутогоОтображения = ЗаголовокТекст;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполненаРегистрацияОрганизации(Результат, ДополнительныеПараметры) Экспорт
	
	ЭтотОбъект.Прочитать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокГоловныхОрганизацийОбособленногоПодразделения()

	Запрос = Новый Запрос;
	Запрос.Текст	=
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка,
	|	Организации.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ГоловнаяОрганизация = Организации.Ссылка
	|	И Организации.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";
	
	СписокОрганизаций = Новый СписокЗначений;

	Результат	= Запрос.Выполнить();
	Выборка	= Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокОрганизаций.Добавить(Выборка.Ссылка, Выборка.Наименование);
	КонецЦикла;

	Возврат СписокОрганизаций;

КонецФункции

&НаСервере
Процедура РазместитьКонтактнуюИнформацию()
	
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтотОбъект, Объект, "ГруппаКонтактнаяИнформация", ПоложениеЗаголовкаЭлементаФормы.Лево,
			СтатическиеРеквизиты());
	
	УстановитьДополнительныеСвойстваКонтактнойИнформации();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьКонтактнуюИнформацию(ТекущийОбъект)
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПриЧтенииНаСервере(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	УстановитьДополнительныеСвойстваКонтактнойИнформации();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьДополнительныеСвойстваКонтактнойИнформации()
	
	Если ЭтоФизЛицо Тогда
		ЮрФактАдресаСовпадают     = Истина;
		ЮрПочтовыйАдресаСовпадают = Истина;
	Иначе
		ЮрФактАдресаСовпадают        = СокрЛП(КонтактнаяИнформацияПолеЮрАдресОрганизации) = СокрЛП(КонтактнаяИнформацияПолеФактАдресОрганизации);
		ЮрПочтовыйАдресаСовпадают    = СокрЛП(КонтактнаяИнформацияПолеЮрАдресОрганизации) = СокрЛП(КонтактнаяИнформацияПолеПочтовыйАдресОрганизации)
			ИЛИ СокрЛП(?(КонтактнаяИнформацияПолеЮрАдресОрганизации = УправлениеКонтактнойИнформациейКлиентСервер.ТекстПустогоАдресаВВидеГиперссылки(),
			"", КонтактнаяИнформацияПолеЮрАдресОрганизации)) = СокрЛП(КонтактнаяИнформацияПолеПочтовыйАдресОрганизации);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеИзмененияСокращенногоНаименования()
	
	СформироватьОКОПФ();
	СформироватьОКФС();
	
	Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		УстановитьНаименованиеИП();
	КонецЕсли;
	
	УстановитьСписокВыбораВариантаНаименованияДляПечатныхФорм(ЭтотОбъект);
	
	Справочники.Организации.УстановитьАктуальноеЗначениеИсторииНаименований(Объект.НаименованиеСокращенное, Объект.НаименованиеПолное, Объект.ИсторияНаименований);
	
	НаименованиеСокращенноеДоИзменения = Объект.НаименованиеСокращенное;
	
КонецПроцедуры

&НаСервере
Процедура ПослеИзмененияПолногоНаименования()
	
	УстановитьСписокВыбораВариантаНаименованияДляПечатныхФорм(ЭтотОбъект);
	
	Справочники.Организации.УстановитьАктуальноеЗначениеИсторииНаименований(Объект.НаименованиеСокращенное, Объект.НаименованиеПолное, Объект.ИсторияНаименований);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОКОПФ()
	
	Если Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо
		И НЕ Объект.ОбособленноеПодразделение Тогда
	
		Если СтрНайти(Объект.НаименованиеСокращенное, "ООО") Тогда
			Объект.КодОКОПФ	= "12300";
		ИначеЕсли СтрНайти(Объект.НаименованиеСокращенное, "ОАО") Тогда
			Объект.КодОКОПФ	= "12247";
		ИначеЕсли СтрНайти(Объект.НаименованиеСокращенное, "ПАО") Тогда
			Объект.КодОКОПФ	= "12247";
		ИначеЕсли СтрНайти(Объект.НаименованиеСокращенное, "ЗАО") Тогда
			Объект.КодОКОПФ	= "12267";
		ИначеЕсли СтрНайти(Объект.НаименованиеСокращенное, "АО") Тогда
			Объект.КодОКОПФ	= "12267";
		КонецЕсли;
		
		Объект.НаименованиеОКОПФ	= НаименованиеОКОПФ(Объект.КодОКОПФ);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОКФС()
	
	Объект.КодОКФС	= "16";
	Объект.НаименованиеОКФС	= НаименованиеОКФС(Объект.КодОКФС);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьСписокВыбораВариантаНаименованияДляПечатныхФорм(Форма)
	
	Форма.Элементы.ВариантНаименованияДляПечатныхФорм.СписокВыбора.НайтиПоЗначению(
		ПредопределенноеЗначение("Перечисление.ВариантыНаименованияДляПечатныхФорм.СокращенноеНаименование")).Представление = 
		Форма.Объект.НаименованиеСокращенное;
		
	Форма.Элементы.ВариантНаименованияДляПечатныхФорм.СписокВыбора.НайтиПоЗначению(
		ПредопределенноеЗначение("Перечисление.ВариантыНаименованияДляПечатныхФорм.ПолноеНаименование")).Представление = 
		Форма.Объект.НаименованиеПолное;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИнформациюОбОтветственныхЛицах()
	
	РуководительКлючЗаписи		= РегистрыСведений.ОтветственныеЛицаОрганизаций.ПустойКлюч();
	ГлавныйБухгалтерКлючЗаписи	= РегистрыСведений.ОтветственныеЛицаОрганизаций.ПустойКлюч();
	КассирКлючЗаписи			= РегистрыСведений.ОтветственныеЛицаОрганизаций.ПустойКлюч();
	
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос	= Новый Запрос;
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница",	Объект.Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.Период КАК Период,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	ПРЕДСТАВЛЕНИЕ(ОтветственныеЛицаОрганизацийСрезПоследних.Должность) КАК ПРЕДСТАВЛЕНИЕДолжность,
	|	ПРЕДСТАВЛЕНИЕ(ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо) КАК ПРЕДСТАВЛЕНИЕФизическоеЛицо,
	|	(ОтветственныеЛицаОрганизацийСрезПоследних.Должность) КАК Должность,
	|	(ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо) КАК ФизическоеЛицо,
	|	ВЫБОР
	|		КОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
	|			ТОГДА ""Руководитель""
	|		КОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
	|			ТОГДА ""ГлавныйБухгалтер""
	|		КОГДА ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Кассир)
	|			ТОГДА ""Кассир""
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПредставлениеОтветственногоЛица
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних КАК ОтветственныеЛицаОрганизацийСрезПоследних
	|ГДЕ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И (ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Руководитель)
	|			ИЛИ ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер)
	|			ИЛИ ОтветственныеЛицаОрганизацийСрезПоследних.ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.Кассир))";
	
	
	Отбор	= Новый Структура("Период, СтруктурнаяЕдиница, ОтветственноеЛицо");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ПустаяСтрока(Выборка.ПредставлениеОтветственногоЛица) Тогда
			Продолжить;
		КонецЕсли;
		
		ЭлементФормы	= ЭтотОбъект.Элементы.Найти(Выборка.ПредставлениеОтветственногоЛица);
		Если ЭлементФормы = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		
		ЭтотОбъект[Выборка.ПредставлениеОтветственногоЛица] = НаименованиеОтветственногоЛица(Выборка.ПРЕДСТАВЛЕНИЕФизическоеЛицо, Выборка.ПРЕДСТАВЛЕНИЕДолжность);
		ЭтотОбъект[Выборка.ПредставлениеОтветственногоЛица+"Должность"] = Выборка.Должность;
		ЭтотОбъект[Выборка.ПредставлениеОтветственногоЛица+"ФизЛицо"] = Выборка.ФизическоеЛицо;
		
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);
		ЭтотОбъект[Выборка.ПредставлениеОтветственногоЛица + "КлючЗаписи"]	= РегистрыСведений.ОтветственныеЛицаОрганизаций.СоздатьКлючЗаписи(Отбор);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКодИзКлассификатора(ИмяКлассификатора, Комментарий = "", Знач ИмяРеквизитаКод = "")
 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипОбъекта",      "Справочник");
	ПараметрыФормы.Вставить("НазваниеОбъекта", "Организации");
	ПараметрыФормы.Вставить("НазваниеМакета",  ИмяКлассификатора);
	ПараметрыФормы.Вставить("ТекущийПериод",   ТекущаяДата());
	ИмяРеквизитаКод = ?(НЕ ЗначениеЗаполнено(ИмяРеквизитаКод), "Код" + ИмяКлассификатора, ИмяРеквизитаКод);
	ПараметрыФормы.Вставить("ТекущийКод",      Объект[ИмяРеквизитаКод]);
	ПараметрыФормы.Вставить("Комментарий",     Комментарий);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяКлассификатора", ИмяКлассификатора);
	ДополнительныеПараметры.Вставить("ИмяРеквизитаКод",   ИмяРеквизитаКод);
	ДополнительныеПараметры.Вставить("ИмяРеквизитаНаименование", "Наименование" + Сред(ИмяРеквизитаКод, 4));
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ВыбратьКодИзКлассификатораЗавершение", 
		ЭтотОбъект, ДополнительныеПараметры);
	ОткрытьФорму("ОбщаяФорма.ФормаВыбораКода", ПараметрыФормы,,,,, ОповещениеОЗакрытии);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКодИзКлассификатораЗавершение(РезультатЗакрытия, ДопПараметры) Экспорт
	
	ВыбранныйКод = РезультатЗакрытия;	
	
	Если ВыбранныйКод <> Неопределено Тогда
		
		Модифицированность = Истина;
		
		Объект[ДопПараметры.ИмяРеквизитаКод] = ВыбранныйКод;
		
		Объект[ДопПараметры.ИмяРеквизитаНаименование] = НаименованиеПоКлассификатору(
			ДопПараметры.ИмяКлассификатора, ВыбранныйКод);
		
		УправлениеФормой(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКодИныхВидовДеятельностиНФОЗавершение(РезультатЗакрытия, ДопПараметры) Экспорт
	
	ВыбранныеКоды = РезультатЗакрытия;
	
	Если ВыбранныеКоды <> Неопределено Тогда
		
		Модифицированность = Истина;
		
		Объект[ДопПараметры.ИмяРеквизитаКод] = СтрСоединить(ВыбранныеКоды, ", ");
		
		ВыбранныеНаименования = Новый Массив;
		Для каждого ВыбранныйКод Из ВыбранныеКоды Цикл
			ВыбранныеНаименования.Добавить(НаименованиеПоКлассификатору(ДопПараметры.ИмяКлассификатора, ВыбранныйКод));
		КонецЦикла;
		
		Объект[ДопПараметры.ИмяРеквизитаНаименование] = СтрСоединить(ВыбранныеНаименования, ", ");
		
		УправлениеФормой(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыНалоговойИнспекцииПоКодуЗавершение(РезультатыЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатыЗакрытия = КодВозвратаДиалога.Да Тогда
		Объект.КодНалоговогоОргана = ДополнительныеПараметры.КодНалоговогоОргана;
		УстановитьРегистрациюВНалоговомОргане();
		ЗаполнитьСведенияОНалоговойИнспекцииПоКоду();
		РегистрацияВНалоговомОргане.КодПоОКАТО = ДополнительныеПараметры.КодПоОКАТО;
		РегистрацияВНалоговомОргане.КодПоОКТМО = ДополнительныеПараметры.КодПоОКТМО;
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЮрАдресаОрганизации()

	Если ЮрФактАдресаСовпадают ИЛИ ПустаяСтрока(КонтактнаяИнформацияПолеФактАдресОрганизации) Тогда
		СкопироватьПолеКонтактнойИнформации("КонтактнаяИнформацияПолеФактАдресОрганизации", "КонтактнаяИнформацияПолеЮрАдресОрганизации");
	КонецЕсли;
	
	Если ЮрПочтовыйАдресаСовпадают ИЛИ ПустаяСтрока(КонтактнаяИнформацияПолеПочтовыйАдресОрганизации) Тогда
		СкопироватьПолеКонтактнойИнформации("КонтактнаяИнформацияПолеПочтовыйАдресОрганизации", "КонтактнаяИнформацияПолеЮрАдресОрганизации");
	КонецЕсли;
	
	Отбор = Новый Структура("ИмяРеквизита");
	Отбор.ИмяРеквизита = "КонтактнаяИнформацияПолеЮрАдресОрганизации";
	ДанныеИсточника = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
	Если ДанныеИсточника.Количество() > 0 Тогда
		ЗначенияПолей = ДанныеИсточника[0].ЗначенияПолей;
		
		УстановитьКодРосстатаПоАдресу(ЗначенияПолей);
		
		СведенияОНалоговомОргане = СведенияОНалоговомОрганеПоАдресу(ЗначенияПолей);
		
		Если СведенияОНалоговомОргане <> Неопределено Тогда
			
			Если ЗначениеЗаполнено(СведенияОНалоговомОргане.КодНалоговогоОргана) Тогда
				
				Если НЕ ЗначениеЗаполнено(Объект.КодНалоговогоОргана) Тогда
					
					ЗаполнитьРеквизитыНалоговойИнспекцииПоКодуЗавершение(КодВозвратаДиалога.Да, СведенияОНалоговомОргане);
					
				ИначеЕсли СведенияОНалоговомОргане.КодНалоговогоОргана = Объект.КодНалоговогоОргана Тогда
					
					//Налоговая инспекция не изменилась
					Если НЕ ЗначениеЗаполнено(РегистрацияВНалоговомОргане.КодПоОКАТО) Тогда
						РегистрацияВНалоговомОргане.КодПоОКАТО = СведенияОНалоговомОргане.КодПоОКАТО;
					КонецЕсли;
					
					Если НЕ ЗначениеЗаполнено(РегистрацияВНалоговомОргане.КодПоОКТМО) Тогда
						РегистрацияВНалоговомОргане.КодПоОКТМО = СведенияОНалоговомОргане.КодПоОКТМО;
					КонецЕсли;
					
				Иначе
					
					ТекстВопроса = НСтр("ru = 'Выбранный адрес обслуживается налоговой инспекцией с кодом %1.
												|Заменить налоговую инспекцию?'");
					ТекстВопроса = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстВопроса, СведенияОНалоговомОргане.КодНалоговогоОргана);
					ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьРеквизитыНалоговойИнспекцииПоКодуЗавершение", ЭтотОбъект, СведенияОНалоговомОргане);
					ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииФактАдресаОрганизации()
	
	ЮрФактАдресаСовпадают = СокрЛП(КонтактнаяИнформацияПолеЮрАдресОрганизации) = СокрЛП(КонтактнаяИнформацияПолеФактАдресОрганизации);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьПолеКонтактнойИнформации(ИмяПриемника, ИмяИсточника)

	Модифицированность		= Истина;
	ЭтотОбъект[ИмяПриемника]	= ЭтотОбъект[ИмяИсточника];
	
	ИмяОписания	= "КонтактнаяИнформацияОписаниеДополнительныхРеквизитов";
	
	Отбор = Новый Структура("ИмяРеквизита");
	
	Отбор.ИмяРеквизита	= ИмяИсточника;
	ДанныеИсточника	= ЭтотОбъект[ИмяОписания].НайтиСтроки(Отбор);
	Если ДанныеИсточника.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Отбор.ИмяРеквизита	= ИмяПриемника;
	ДанныеПриемника	= ЭтотОбъект[ИмяОписания].НайтиСтроки(Отбор);
	Если ДанныеПриемника.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ДанныеИсточника[0].Тип = ДанныеПриемника[0].Тип Тогда
		Возврат
	КонецЕсли;
	
	ЗначенияПолейИсточника = ДанныеИсточника[0].ЗначенияПолей;
	Если ТипЗнч(ЗначенияПолейИсточника)=Тип("Строка") Тогда
		ДанныеПриемника[0].ЗначенияПолей = ЗначенияПолейИсточника;
	Иначе
		ДанныеПриемника[0].ЗначенияПолей = ЗначенияПолейИсточника.Скопировать();
	КонецЕсли;
	ДанныеПриемника[0].Представление = ДанныеИсточника[0].Представление;
	ДанныеПриемника[0].Комментарий = ДанныеИсточника[0].Комментарий;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоздатьУчетнуюПолитику(Ссылка, Знач ДанныеЗаполнения, ТребуетсяСоздатьПоставляемыеВидыНалогов)
	
	Если НЕ ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("Организация", Ссылка);
	
	НаборЗаписей = РегистрыСведений.УчетнаяПолитикаОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	СтрокаНабораЗаписей = НаборЗаписей.Добавить();
	СтрокаНабораЗаписей.Активность = Истина;
	
	РегистрыСведений.УчетнаяПолитикаОрганизаций.УстановкаПараметровУчетнойПолитикиПоУмолчанию(СтрокаНабораЗаписей, ДанныеЗаполнения);
	РегистрыСведений.УчетнаяПолитикаОрганизаций.УстановкаПараметровУчетнойПолитикиПоУмолчаниюНаПериод(СтрокаНабораЗаписей);
	
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ТребуетсяСоздатьПоставляемыеВидыНалогов", ТребуетсяСоздатьПоставляемыеВидыНалогов);
	НаборЗаписей.Записать();
	
	// Часть учетной политики - список прямых расходов для целей исчисления налога на прибыль
	Если СтрокаНабораЗаписей.ПлательщикНалогаНаПрибыль Тогда
		РегистрыСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.Настроить(
			Ссылка,
			НачалоГода(СтрокаНабораЗаписей.Период),
			Ложь, // Не копировать записи предыдущего периода
			Ложь);// Не перезаписывать записи, если они уже есть
		КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПроверитьУчетнуюПолитику(Ссылка)
	
	ДанныеЗаполнения = Новый Структура;

	НаборЗаписей = РегистрыСведений.УчетнаяПолитикаОрганизаций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Ссылка);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДанныеЗаполнения.Вставить("Организация", Ссылка);
	ДанныеЗаполнения.Вставить("СистемаНалогообложения", Перечисления.СистемыНалогообложения.Общая);
	ДанныеЗаполнения.Вставить("ПлательщикНДС", Истина);
	ДанныеЗаполнения.Вставить("ПлательщикНалогаНаПрибыль", Истина);
	
	ЗаписиИзменены = Ложь;
	
	Для каждого СтрокаНабораЗаписей Из НаборЗаписей Цикл
	
		Если СтрокаНабораЗаписей.СистемаНалогообложения = Перечисления.СистемыНалогообложения.ОсобыйПорядок 
				И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ЮридическоеФизическоеЛицо") = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
			
			РегистрыСведений.УчетнаяПолитикаОрганизаций.УстановкаПараметровУчетнойПолитикиПоУмолчанию(СтрокаНабораЗаписей, ДанныеЗаполнения);
			
			ЗаписиИзменены = Истина;
			
		КонецЕсли;
	
	КонецЦикла; 

	Если ЗаписиИзменены Тогда
	
		НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения", Истина);
		НаборЗаписей.Записать();
	
	КонецЕсли; 
	
	Возврат ЗаписиИзменены;
	
КонецФункции

&НаСервереБезКонтекста
Функция АдресныйКлассификаторПуст()

	Возврат НЕ АдресныйКлассификатор.КлассификаторЗагружен();

КонецФункции

&НаКлиенте
Процедура ПослеИзмененияКонтактнойИнформации(Результат) Экспорт
	
	Если Результат.ИмяРеквизита = "КонтактнаяИнформацияПолеЮрАдресОрганизации" Тогда
		
		ПриИзмененииЮрАдресаОрганизации();
		УправлениеФормой(ЭтотОбъект);
		
	ИначеЕсли Результат.ИмяРеквизита = "КонтактнаяИнформацияПолеФактАдресОрганизации" Тогда
		
		ПриИзмененииФактАдресаОрганизации();
		УправлениеФормой(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСокращенногоНаименования()
	
	Если ПустаяСтрока(Объект.НаименованиеПолное)
		ИЛИ ОрганизацииФормыКлиентСервер.ПолноеНаименованиеСоответствуетСокращенномуНаименованию(НаименованиеСокращенноеДоИзменения, Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = ОрганизацииФормыКлиентСервер.ПолноеНаименованиеПоСокращенномуНаименованию(Объект.НаименованиеСокращенное);
	КонецЕсли;
	
	Если ПустаяСтрока(Объект.Наименование) 
		ИЛИ Объект.Наименование = НаименованиеПоУмолчанию
		ИЛИ ОрганизацииФормыКлиентСервер.НаименованиеСоответствуетСокращенномуНаименованию(НаименованиеСокращенноеДоИзменения, Объект.Наименование) Тогда
		Объект.Наименование = ОрганизацииФормыКлиентСервер.НаименованиеПоСокращенномуНаименованию(Объект.НаименованиеСокращенное);
	КонецЕсли;
	
	ПослеИзмененияСокращенногоНаименования();
	
КонецПроцедуры

&НаКлиенте
Процедура ФИОПриИзменении()
	
	Если ЗначениеЗаполнено(Объект.ФамилияИП)
		ИЛИ ЗначениеЗаполнено(Объект.ИмяИП)
		ИЛИ ЗначениеЗаполнено(Объект.ОтчествоИП) Тогда
		
		Объект.НаименованиеСокращенное = ОрганизацииФормыКлиентСервер.СокращенноеНаименованиеИндивидульногоПредпринимателя(
											Объект.ФамилияИП, Объект.ИмяИП, Объект.ОтчествоИП);
		
		Объект.НаименованиеПолное = ОрганизацииФормыКлиентСервер.ПолноеНаименованиеИндивидульногоПредпринимателя(
											Объект.ФамилияИП, Объект.ИмяИП, Объект.ОтчествоИП);
		
		Объект.Наименование = ОрганизацииФормыКлиентСервер.НаименованиеИндивидульногоПредпринимателя(
											Объект.ФамилияИП, Объект.ИмяИП, Объект.ОтчествоИП);
		
		ПослеИзмененияСокращенногоНаименования();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ФизлицоПриСозданииНаСервере()
	
	Если Объект.ИндивидуальныйПредприниматель.Пустая() Тогда
		
		УстановитьКодыСтатистикиДляИП();
		
	КонецЕсли;
	
	УстановитьНаименованиеИП();
	
КонецПроцедуры

&НаСервере
Процедура ФизлицоПослеЗаписиНаСервере()
	
	ЗадатьШиринуПоляНаименование();
	
КонецПроцедуры

&НаСервере
Процедура ЗадатьШиринуПоляНаименование(СтандартнаяШирина = Истина)
	
	Элементы.НаименованиеИП.Ширина = ?(СтандартнаяШирина, 38, 39);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьФорму()

	ЭтоФизЛицо = (Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо);
	ЭтоОбособленноеПодразделение	= (Объект.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
		И Объект.ОбособленноеПодразделение;
	
	Если ЭтоФизЛицо Тогда
		ФизлицоПриСозданииНаСервере();
	КонецЕсли;
	
	Элементы.ГруппаГоловнаяОрганизация.Видимость                  = ЭтоОбособленноеПодразделение;
	Элементы.ФамилияИП.Видимость                                  = ЭтоФизЛицо;
	Элементы.ИмяИП.Видимость                                      = ЭтоФизЛицо;
	Элементы.ОтчествоИП.Видимость                                 = ЭтоФизЛицо;
	Элементы.Наименование.Видимость                               = НЕ ЭтоФизЛицо;
	Элементы.ГруппаНаименование.Видимость                         = НЕ ЭтоФизЛицо;
	Элементы.ГруппаНаименованиеИПрефиксИП.Видимость               = ЭтоФизЛицо;
	Элементы.ИНН.Видимость                                        = НЕ ЭтоОбособленноеПодразделение;
	Элементы.НадписьПоясненияНекорректногоИНН.Видимость           = НЕ ЭтоОбособленноеПодразделение;
	Элементы.ГруппаКПП.Видимость                                  = НЕ ЭтоФизЛицо;
	Элементы.ГруппаСвидетельствоОРегистрацииИП.Видимость          = ЭтоФизЛицо;
	Элементы.ГруппаФактАдресОрганизации.Видимость                 = НЕ ЭтоФизЛицо;
	Элементы.ГруппаЮрФактАдресаСовпадают.Видимость                = НЕ ЭтоФизЛицо;
	Элементы.ГруппаПочтовыйАдрес.Видимость                        = НЕ ЭтоФизЛицо;
	Элементы.ГруппаЮрПочтовыйАдресаСовпадают.Видимость            = НЕ ЭтоФизЛицо;
	Элементы.ГруппаПодписиЮрЛицо.Видимость                        = НЕ ЭтоФизЛицо;
	Элементы.ДекорацияОтветственныеОтчеты.Видимость               = НЕ ЭтоФизЛицо;
	Элементы.ДополнительныйКодФСС.Видимость                       = ЭтоОбособленноеПодразделение;
	Элементы.ИПРегистрационныйНомерТФОМС.Видимость                = ЭтоФизЛицо;
	Элементы.ИПИспользуетТрудНаемныхРаботников.Видимость          = ЭтоФизЛицо;
	Элементы.ГруппаИностраннаяОрганизацияФлаг.Видимость           = НЕ ЭтоФизЛицо;
	Элементы.ИПРегистрационныйНомерПФР.Видимость                  = ЭтоФизЛицо;
	Элементы.ИПРегистрационныйНомерФСС.Видимость                  = ЭтоФизЛицо;
	Элементы.ГруппаИностраннаяОрганизация.Видимость               = НЕ ЭтоФизЛицо И Объект.ИностраннаяОрганизация;
	Элементы.ЗаполнитьРеквизитыПоИНН.Видимость                    = НЕ ОтобразитьЗаполнениеПоДаннымЕГР;
	Элементы.ГруппаЗаполнениеПоДаннымЕГР.Видимость                = ОтобразитьЗаполнениеПоДаннымЕГР;
	Элементы.ВидеоурокЗаполнениеРеквизитов.Видимость              = ОтобразитьЗаполнениеПоДаннымЕГР;
	Элементы.ГруппаПодписьГлавногоБухгалтера.Видимость            = НЕ ЭтоФизЛицо;
	
	ВестиУчетПоОрганизациям = ПолучитьФункциональнуюОпцию("ВестиУчетПоОрганизациям")
		ИЛИ ПолучитьФункциональнуюОпцию("ВестиУчетПоОрганизациям82");
	НеВестиУчетПоОрганизациям = ПолучитьФункциональнуюОпцию("НеВестиУчетПоОрганизациям")
		ИЛИ ПолучитьФункциональнуюОпцию("НеВестиУчетПоОрганизациям82");
	
	Элементы.Префикс.Видимость = ВестиУчетПоОрганизациям И НЕ ЭтоФизЛицо;
	Элементы.ПрефиксОднойОрганизации.Видимость = НеВестиУчетПоОрганизациям И НЕ ЭтоФизЛицо;
		
	Элементы.ПрефиксИП.Видимость = ВестиУчетПоОрганизациям И ЭтоФизЛицо;
	Элементы.ПрефиксИПОднойОрганизации.Видимость = НеВестиУчетПоОрганизациям И ЭтоФизЛицо;
	
	Элементы.ЦифровойИндексОбособленногоПодразделения.Видимость	= ЭтоОбособленноеПодразделение;
	
	Если ЭтоФизЛицо Тогда
		Элементы.КодПоОКПО.ОграничениеТипа = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(10));
	ИначеЕсли НЕ ЭтоОбособленноеПодразделение Тогда
		Элементы.КодПоОКПО.ОграничениеТипа = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(8));
	КонецЕсли;
	
	Если ЭтоОбособленноеПодразделение Тогда
		
		ВидОрганизации = "ОбособленноеПодразделение";
		ВидОрганизацииПредставление	= НСтр("ru = 'Обособленное подразделение'");
		
		Элементы.НаименованиеСокращенное.Подсказка = "";
		Элементы.НаименованиеПолное.Подсказка      = "";
		Элементы.Наименование.Подсказка            = "";
		
		Элементы.ЗаполнитьРеквизитыПоИНН.Видимость = Ложь;
		Элементы.ГруппаЗаполнениеПоДаннымЕГР.Видимость = Ложь;
		
	ИначеЕсли ЭтоФизЛицо Тогда
		
		ВидОрганизации = "ИндивидуальныйПредприниматель";
		ВидОрганизацииПредставление	= НСтр("ru = 'Индивидуальный предприниматель'");
		
		Если ОтобразитьЗаполнениеПоДаннымЕГР Тогда
			Элементы.ДекорацияОтступСлева.Видимость = Ложь;
			Элементы.ДекорацияСтрелка.Ширина = 13;
		КонецЕсли;
		
		ЗадатьШиринуПоляНаименование(Не Параметры.Ключ.Пустая());
		Элементы.АдресПодписьРуководителя.Заголовок = НСтр("ru='
			|Подпись'"); 
		Элементы.АдресПодписьРуководителя.ТекстНевыбраннойКартинки = НСтр("ru='Загрузить подпись'"); 
		Элементы.ИНН.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Идентификационный номер налогоплательщика (ИНН) из ""Свидетельства о постановке на учет физического лица в налоговом органе"".
			|Состоит из 12 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entinn"));
		
		Элементы.ОГРН.Заголовок	= НСтр("ru = 'ОГРНИП'");
		Элементы.ОГРН.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Основной государственный регистрационный номер (ОГРНИП) присваивается при государственной регистрации и указывается в ""Свидетельстве о государственной регистрации индивидуального предпринимателя"".
			|Состоит из 15 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entogrn"));
		
		Элементы.ДатаРегистрации.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Дата государственной регистрации, указывается в ""Свидетельстве о государственной регистрации индивидуального предпринимателя"".
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entregdate"));
			
		Элементы.СистемаНалогообложенияПредставление.ВысотаЗаголовка = 2;
			
		Элементы.КонтактнаяИнформацияПолеЮрАдресОрганизации.Заголовок = НСтр("ru = 'Адрес места жительства'");
		Элементы.КонтактнаяИнформацияПолеЮрАдресОрганизации.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Адрес индивидуального предпринимателя по месту постоянной регистрации.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entadress"));
			
		Элементы.КонтактнаяИнформацияПолеТелефонОрганизации.Заголовок			= НСтр("ru = 'Телефон (служебный)'");
		Элементы.ДекорацияОтступСлева.Ширина = 1;
		
		Элементы.ВариантНаименованияДляПечатныхФорм.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Наименование (полное или сокращенное), которое выводится в первичных документах и отчетах.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entprintname"));
						
		Элементы.РегистрацияВНалоговомОрганеКодПоОКТМО.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код по Общероссийскому классификатору территорий муниципальных образований (ОКТМО) используется с 2014 года в регламентированной отчетности и платежах в бюджет.
			|Определяется по адресу регистрации. Может быть уточнен в налоговой инспекции.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entoktmo"));
			
		Элементы.РегистрацияВНалоговомОрганеКодПоОКАТО.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код по Общероссийскому классификатору административно-территориального деления объектов (ОКАТО) использовался до 2014 года в отчетности в контролирующие органы и платежах в бюджет.
			|Определяется по адресу регистрации. Может быть уточнен в налоговой инспеции.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entokato"));
			
		Элементы.РегистрационныйНомерПФР.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Регистрационный номер из ""Уведомления о регистрации в территориальном органе Пенсионного фонда Российской Федерации страхователя, производящего выплаты физическим лицам"".
			|Состоит из 12 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entpfrnum"));
			
		Элементы.КодОрганаПФР.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код территориального органа ПФР, как правило, совпадает с первыми цифрами Регистрационного номера. Может быть уточнен в ПФР.
			|Состоит из 6 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entpfrdep"));
			
		Элементы.РегистрационныйНомерФСС.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Регистрационный номер страхователя из ""Извещения о регистрации в качестве страхователя""
			|Состоит из 10 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entfssnum"));
			
		Элементы.КодПодчиненностиФСС.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код подчиненности из ""Извещения о регистрации в качестве страхователя"".
			|Состоит из 5 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entpfrdep"));
			
		Элементы.КодОКОПФ.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код по Общероссийскому классификатору организационно-правовых форм (ОКОПФ) из ""Информационного письма об учете в Статрегистре Росстата"".
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entokopf"));
			
		Элементы.КодОКФС.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код по Общероссийскому классификатору форм собственности (ОКФС) из ""Информационного письма об учете в Статрегистре Росстата"".
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entokfs"));
			
		Элементы.КодОКВЭД.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код по Общероссийскому классификатору видов экономической деятельности (ОКВЭД) - первый код из раздела ""Сведения о видах экономической деятельности"" в выписке из ЕГРИП.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entokved"));
			
		Элементы.КодПоОКПО.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код по Общероссийскому классификатору предприятий и организаций (ОКПО) из ""Информационного письма об учете в Статрегистре Росстата"".
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entokpo"));
			
		Элементы.КодОрганаФСГСПолучателя.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код органа Росстата, которому подотчетен индивидуальный предприниматель. Требуется для сдачи отчетности в электронном виде. Определяется автоматически, в зависимости от адреса регистрации. Может быть уточнен в территориальном органе Росстата.
			|Состоит из 4 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingentrepreneur#entstatdep"));
			
	Иначе
		
		ВидОрганизации = "ЮридическоеЛицо";
		ВидОрганизацииПредставление = НСтр("ru='Юридическое лицо'");
		Элементы.ОГРН.Маска = "9999999999999";
		Элементы.РегистрационныйНомерПФР.Заголовок		= НСтр("ru='Регистрационный номер'");
		Элементы.РегистрационныйНомерФСС.Заголовок		= НСтр("ru='Регистрационный номер'");
		Элементы.РегистрационныйНомерТФОМС.Заголовок	= НСтр("ru='Регистрационный номер'");
		Элементы.АдресПодписьРуководителя.Заголовок = НСтр("ru='Подпись
			|руководителя'");
		Элементы.АдресПодписьРуководителя.ТекстНевыбраннойКартинки = НСтр("ru='Загрузить 
			|подпись руководителя'"); 
		Элементы.ИНН.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Идентификационный номер налогоплательщика (ИНН) из ""Свидетельства о постановке на учет российской организации в налоговом органе по месту ее нахождения"".
			|Состоит из 10 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orginn"));
			
		Элементы.ОГРН.Заголовок	= НСтр("ru = 'ОГРН'");
		Элементы.ОГРН.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Основной государственный регистрационный номер (ОГРН) присваивается при государственной регистрации и указывается в ""Свидетельстве о государственной регистрации юридического лица"".
			|Состоит из 13 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgogrn"));
		
		Элементы.ДатаРегистрации.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Дата государственной регистрации, указывается в ""Свидетельстве о государственной регистрации юридического лица"".
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgregdate"));
			
		Элементы.СистемаНалогообложенияПредставление.ВысотаЗаголовка = 0;
			
		Элементы.КонтактнаяИнформацияПолеЮрАдресОрганизации.Заголовок = НСтр("ru = 'Юридический адрес'");
		Элементы.КонтактнаяИнформацияПолеЮрАдресОрганизации.РасширеннаяПодсказка.Заголовок = "";
			
		Элементы.КонтактнаяИнформацияПолеТелефонОрганизации.Заголовок = НСтр("ru = 'Контактный телефон'");
		Элементы.ДекорацияОтступСлева.Ширина = 2;
		
		Элементы.ВариантНаименованияДляПечатныхФорм.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Наименование (полное или сокращенное), которое выводится в первичных документах и отчетах.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgprinname"));
			
		Элементы.РегистрацияВНалоговомОрганеКодПоОКТМО.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код по Общероссийскому классификатору территорий муниципальных образований (ОКТМО) используется с 2014 года в регламентированной отчетности и платежах в бюджет.
			|Определяется по адресу регистрации. Может быть уточнен в налоговой инспекции.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgoktmo"));
			
		Элементы.РегистрацияВНалоговомОрганеКодПоОКАТО.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код по Общероссийскому классификатору административно-территориального деления объектов (ОКАТО) использовался до 2014 года в отчетности в контролирующие органы и платежах в бюджет.
			|Определяется по адресу регистрации. Может быть уточнен в налоговой инспеции.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgokato"));
			
		Элементы.РегистрационныйНомерПФР.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Регистрационный номер из ""Уведомления о регистрации юридического лица в территориальном органе Пенсионного фонда Российской Федерации по месту нахождения на территории Российской Федерации"".
			|Состоит из 12 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgpfrnum"));
			
		Элементы.КодОрганаПФР.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код территориального органа ПФР, как правило, совпадает с первыми цифрами Регистрационного номера. Может быть уточнен в ПФР.
			|Состоит из 6 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgpfrdep"));
			
		Элементы.РегистрационныйНомерФСС.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Регистрационный номер страхователя из ""Извещения о регистрации в качестве страхователя""
			|Состоит из 10 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgfssnum"));
			
		Элементы.КодПодчиненностиФСС.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код подчиненности из ""Извещения о регистрации в качестве страхователя"".
			|Состоит из 5 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgfssdep"));
			
		Элементы.КодОКОПФ.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код по Общероссийскому классификатору организационно-правовых форм (ОКОПФ) из ""Информационного письма об учете в Статрегистре Росстата"".
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgokopf"));
			
		Элементы.КодОКФС.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код по Общероссийскому классификатору форм собственности (ОКФС) из ""Информационного письма об учете в Статрегистре Росстата"".
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgokfs"));
			
		Элементы.КодОКВЭД.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код по Общероссийскому классификатору видов экономической деятельности (ОКВЭД) - первый код из раздела ""Сведения о видах экономической деятельности"" в выписке из ЕГРЮЛ.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgokved"));
			
		Элементы.КодПоОКПО.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код по Общероссийскому классификатору предприятий и организаций (ОКПО) из ""Информационного письма об учете в Статрегистре Росстата"".
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgokpo"));
			
		Элементы.КодОрганаФСГСПолучателя.РасширеннаяПодсказка.Заголовок = Новый ФорматированнаяСтрока(
			Новый ФорматированнаяСтрока(НСтр("ru='Код органа Росстата, которому подотчетна организация. Требуется для сдачи отчетности в электронном виде. Определяется автоматически, в зависимости от адреса регистрации. Может быть уточнен в территориальном органе Росстата.
			|Состоит из 4 цифр.
			|'")),
			Новый ФорматированнаяСтрока(НСтр("ru='Подробнее'"),,,, "http://its.1c.ru/bmk/bp30/fillingorganisation#orgstatdep"));
		
		Элементы.КонтактнаяИнформацияПолеЮрАдресОрганизации.Заголовок = НСтр("ru = 'Юридический адрес'");
		Элементы.КонтактнаяИнформацияПолеЮрАдресОрганизации.РасширеннаяПодсказка.Заголовок = "";
		Элементы.КонтактнаяИнформацияПолеТелефонОрганизации.Заголовок = НСтр("ru = 'Контактный телефон'");
		
	КонецЕсли;
	
	Если ЭтоФизЛицо ИЛИ ЭтоОбособленноеПодразделение Тогда
		Элементы.КрупнейшийНалогоплательщик.Видимость = Ложь;
		Элементы.КодНалоговогоОрганаПолучателя.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.ОтчетностьПодписываетПредставитель.СписокВыбора[0].Представление = ?(ЭтоФизЛицо,
		НСтр("ru='Индивидуальный предприниматель'"),
		НСтр("ru='Руководитель'"));
	
	ОбновитьИнформациюОбОтветственныхЛицах();
	
	ПодсказкаБанк = БанковскиеСчетаФормыКлиентСервер.ПодсказкаПоляБанка(ДеятельностьБанкаПрекращена);
	ПодсказкаНомерСчета = БанковскиеСчетаФормыКлиентСервер.ПодсказкаПоляНомерСчета(
		БанковскийСчет.НомерСчета, БИКБанка, Истина, ЦветВыделенияНекорректногоЗначение);
		
	БанковскиеСчетаФормыКлиентСервер.ИзменитьДлинуНомераСчета(ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИсторияРуководительНажатие(Элемент)
	
	ПоказатьИсториюОтветственныхЛицНажатие("Руководитель");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОтветственныеОтчетыНажатие(Элемент)
	Перем ОтветственноеЛицо;
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОтветственноеЛицо	= ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций.Руководитель");
	
	Отбор	= Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо",
		Объект.Ссылка,
		ОтветственноеЛицо);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ДекорацияИсторияПодписиНажатиеЗавершение", ЭтотОбъект);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор",	Отбор);
	ПараметрыФормы.Вставить("ТолькоПросмотр",	ТолькоПросмотр);
		
	ОткрытьФорму("РегистрСведений.ОтветственныеЛицаОрганизаций.Форма.ФормаПрочегоСпискаОтветственных", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИсторияГлавныйБухгалтерНажатие(Элемент)
	
	ПоказатьИсториюОтветственныхЛицНажатие("ГлавныйБухгалтер");
	
КонецПроцедуры

&НаКлиенте
Процедура РуководительФИОПриИзменении(Элемент)
	
	ИзмененРуководитель = Истина;
	
	ЭтотОбъект.Модифицированность = Истина;
	
	Если ЗначениеЗаполнено(РуководительФизЛицо) тогда
		
		РуководительДолжность= ПолучитьДолжностьНасервере(Объект.Ссылка,РуководительФизЛицо,"Руководитель");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РуководительДолжностьПриИзменении(Элемент)
	
	ИзмененРуководитель = Истина;
	
	ЭтотОбъект.Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ГлавныйБухгалтерФИОПриИзменении(Элемент)
		
	ИзмененГлавныйБухгалтер = Истина;
	
	ЭтотОбъект.Модифицированность = Истина;
	
	Если ЗначениеЗаполнено(ГлавныйБухгалтерФизЛицо) тогда
		
		ГлавныйБухгалтерДолжность= ПолучитьДолжностьНасервере(Объект.Ссылка,ГлавныйБухгалтерФизЛицо,"ГлавныйБухгалтер");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ГлавныйБухгалтерДолжностьПриИзменении(Элемент)
	
	ИзмененГлавныйБухгалтер = Истина;
	
	ЭтотОбъект.Модифицированность = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура КассирФИОПриИзменении(Элемент)
	
	ИзмененКассир = истина;
	
	ЭтотОбъект.Модифицированность = Истина;
	
	Если ЗначениеЗаполнено(КассирФизЛицо) тогда
		
		КассирДолжность= ПолучитьДолжностьНасервере(Объект.Ссылка,КассирФизЛицо,"Кассир");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КассирДолжностьПриИзменении(Элемент)
	
	ИзмененКассир = истина;
	
	ЭтотОбъект.Модифицированность = Истина;
		
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияКассирИсторияНажатие(Элемент)
	
	ПоказатьИсториюОтветственныхЛицНажатие("Кассир");
	
КонецПроцедуры

#Область ЛоготипИФаксимиле

&НаКлиенте
// Процедура отвечает за обработку нажатия на картинки формы (логотип/факсим. печать)
//
Процедура ОбработатьНажатиеКартинки(СтандартнаяОбработка, ИмяЭлементаСКартинкой)
	
	СтандартнаяОбработка = Ложь;
	
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект["Файл"+ИмяЭлементаСКартинкой]) Тогда
		
		ДанныеФайла = ПолучитьДанныеФайла(Объект["Файл"+ИмяЭлементаСКартинкой], УникальныйИдентификатор);
		ПрисоединенныеФайлыКлиент.ОткрытьФайл(ДанныеФайла);
		
	ИначеЕсли МожноРедактироватьФайлы Тогда
		
		ЗагрузитьКартинку(ИмяЭлементаСКартинкой);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор)
	
	Возврат ПрисоединенныеФайлы.ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор);
	
КонецФункции

&НаСервереБезКонтекста
// Функция возвращает навигационую ссылку файла
//
Функция ПолучитьКартинку(ФайлКартинки, УникальныйИдентификатор)
	
	Возврат ПрисоединенныеФайлы.ПолучитьДанныеФайла(ФайлКартинки, УникальныйИдентификатор).СсылкаНаДвоичныеДанныеФайла;
	
КонецФункции // ПолучитьТекущуюВерсиюКАртинки()

&НаКлиенте
// Процедура отвечает за отображение/обновление соответствующей картинки
//
Процедура УстановитьКартинкуНаФорме(АктивныйАдрес, РеквизитОбъекта)
	
	Если ЗначениеЗаполнено(РеквизитОбъекта) Тогда
		АктивныйАдрес = ПолучитьКартинку(РеквизитОбъекта, УникальныйИдентификатор);
	Иначе
		АктивныйАдрес = "";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлФаксимильнаяПечатьПриИзменении(Элемент)
	
	УстановитьКартинкуНаФорме(АдресФаксимильнаяПечать, Объект.ФайлФаксимильнаяПечать);
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ФайлЛоготипПриИзменении(Элемент)
	
	УстановитьКартинкуНаФорме(АдресЛоготип, Объект.ФайлЛоготип);
	
	УправлениеФормой(ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОчиститьЛоготипНажатие(Элемент, СтандартнаяОбработка)
	
	ЗагрузитьОчиститьКартинку("Логотип", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОчиститьФаксимилеНажатие(Элемент, СтандартнаяОбработка)
	
	ЗагрузитьОчиститьКартинку("ФаксимильнаяПечать", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКартинкуВЭлементе(ФайлКартинки, ИмяЭлементаСКартинкой)
	
	Модифицированность = Истина;
	ИмяФайла = "Файл" + ИмяЭлементаСКартинкой;
	ИмяАдресаКартинки = "Адрес" + ИмяЭлементаСКартинкой;
	Объект[ИмяФайла] = ФайлКартинки;
	УстановитьКартинкуНаФорме(ЭтотОбъект[ИмяАдресаКартинки], ФайлКартинки);
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКартинкуИзПрисоединенныхФайлов(ИмяЭлементаСКартинкой)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ВладелецФайла", Объект.Ссылка);
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
		
		ДополнительныеПараметры = Новый Структура("ИмяЭлементаСКартинкой", ИмяЭлементаСКартинкой);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьКартинкуИзПрисоединенныхФайловЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		
		ОткрытьФорму("ОбщаяФорма.ПрисоединенныеФайлы", ПараметрыФормы, Элементы["Адрес"+ИмяЭлементаСКартинкой], , , , ОписаниеОповещения);
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Элемент справочника еще не записан.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьКартинкуИзПрисоединенныхФайловЗавершение(ВыбраннаяКартинка, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(ВыбраннаяКартинка) Тогда
		
		УстановитьКартинкуВЭлементе(ВыбраннаяКартинка, ДополнительныеПараметры.ИмяЭлементаСКартинкой);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КонтактнаяИнформация

&НаСервере
Функция Подключаемый_ОбновитьКонтактнуюИнформацию(Результат) Экспорт
	
	РезультатОбновления = УправлениеКонтактнойИнформацией.ОбновитьКонтактнуюИнформацию(ЭтотОбъект, Объект, Результат);
	
	УправлениеФормой(ЭтотОбъект);
	
	Возврат РезультатОбновления;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриИзменении(Элемент)
	
	УправлениеКонтактнойИнформациейКлиент.ПриИзменении(ЭтотОбъект, Элемент);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияВыполнитьКоманду(Команда)
	
	УправлениеКонтактнойИнформациейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры

&НаСервере
Функция СтатическиеРеквизиты()
	
	СтатическиеРеквизиты = Новый Массив();
	
	СтатическиеРеквизиты.Добавить(Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации);
	СтатическиеРеквизиты.Добавить(Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации);
	СтатическиеРеквизиты.Добавить(Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресОрганизации);
	СтатическиеРеквизиты.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации);
	СтатическиеРеквизиты.Добавить(Справочники.ВидыКонтактнойИнформации.ФаксОрганизации);
	СтатическиеРеквизиты.Добавить(Справочники.ВидыКонтактнойИнформации.EmailОрганизации);
	СтатическиеРеквизиты.Добавить(Справочники.ВидыКонтактнойИнформации.ДругаяИнформацияОрганизации);
	СтатическиеРеквизиты.Добавить(Справочники.ВидыКонтактнойИнформации.УчредительныйАдресИностраннойОрганизации);
	
	Возврат СтатическиеРеквизиты;

КонецФункции

#КонецОбласти

#Область ДополнительныеРеквизиты

&НаКлиенте
Процедура Подключаемый_РедактироватьСоставСвойств()
	
	УправлениеСвойствамиКлиент.РедактироватьСоставСвойств(ЭтотОбъект, Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект, РеквизитФормыВЗначение("Объект"));

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБСП

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтотОбъект, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтотОбъект, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтотОбъект, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНаборЗаписейПериодическихСведений(ИмяРегистра, ВедущийОбъект) Экспорт
	
	РедактированиеПериодическихСведений.ПрочитатьНаборЗаписей(ЭтотОбъект, ИмяРегистра, ВедущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьРегистрацияВОрганеПФР()
	
	РедактированиеПериодическихСведений.ПрочитатьЗаписьДляРедактированияВФорме(ЭтотОбъект, "ИсторияРегистрацийВОрганеПФР", ОрганизацияСсылка);
	
КонецПроцедуры

&НаСервере
Процедура КодНалоговогоОрганаПриИзмененииНаСервере()
	
	УстановитьРегистрациюВНалоговомОргане();
	
	Если ЗначениеЗаполнено(Объект.КодНалоговогоОргана) Тогда
		Ошибка = "";
		ЗаполнитьСведенияОНалоговойИнспекцииПоКоду(Ошибка);
		Если ЗначениеЗаполнено(Ошибка) Тогда
			// Определить реквизиты налогового органа по данным веб-сервиса не удалось
			// Нужно определить платежные реквизиты по данным информационной базы
			УстановитьПредставлениеПлатежныхРеквизитов(Перечисления.ВидыГосударственныхОрганов.НалоговыйОрган, Объект.КодНалоговогоОргана, 
					ПлатежныеРеквизитыФНСПредставление);
		КонецЕсли;
	Иначе
		ПлатежныеРеквизитыФНСПредставление  = ДанныеГосударственныхОрганов.ПредставлениеПлатежныхРеквизитовГосударственногоОргана(Неопределено);
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура КодОрганаПФРПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.КодОрганаПФР) Тогда
		ОписаниеОшибки = "";
		ЗаполнитьСведенияОбОтделенииПФР(ОписаниеОшибки);
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			УстановитьПредставлениеПлатежныхРеквизитов(Перечисления.ВидыГосударственныхОрганов.ОрганПФР, Объект.КодОрганаПФР, 
						ПлатежныеРеквизитыПФРПредставление);
		КонецЕсли;
	Иначе
		Объект.НаименованиеТерриториальногоОрганаПФР = "";
		ПлатежныеРеквизитыПФРПредставление = ДанныеГосударственныхОрганов.ПредставлениеПлатежныхРеквизитовГосударственногоОргана(Неопределено);
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура КодОрганаФССПриИзмененииНаСервере()
	
	Если ЗначениеЗаполнено(Объект.КодПодчиненностиФСС) Тогда
		ОписаниеОшибки = "";
		ЗаполнитьСведенияОбОтделенииФСС(ОписаниеОшибки);
		Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
			УстановитьПредставлениеПлатежныхРеквизитов(Перечисления.ВидыГосударственныхОрганов.ОрганФСС, Объект.КодПодчиненностиФСС, 
						ПлатежныеРеквизитыФССПредставление);
		КонецЕсли;
	Иначе
		Объект.НаименованиеТерриториальногоОрганаФСС = "";
		ПлатежныеРеквизитыФССПредставление = ДанныеГосударственныхОрганов.ПредставлениеПлатежныхРеквизитовГосударственногоОргана(Неопределено);
	КонецЕсли;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаОповещений

&НаКлиенте
// При вызове стандартного метода Оповестить() платформы оповещение
// приходит и в текущую форму в том числе, т.е. вызывается ее ОбработкаОповещения().
// При этом собственное оповещение обработатывать не надо, т.к. в форме и так все данные
// актуальные, можно не тратить время на их обновление.
// Но в ОбработкаОповещения() не всегда можно идентифицировать собственное оповещение,
// т.к. в ряде случае Параметр и Источник заполняются согласно формату оповещений 
// БЗКБ и по ним нельзя понять, что это оповещение самой текущей формы. 
// Поэтому перед отсылкой оповещения устанавливаем переменную РассылкаОповещенияИзТекущейФормы,
// которая проверяется в ОбработкаОповещения(), а после окончания оповещения сбрасываем ее.
//
Процедура ОповеститьВФорме(ИмяСобытия, Параметр = Неопределено, Источник = Неопределено)

	РассылкаОповещенияИзТекущейФормы = Истина;
	Оповестить(ИмяСобытия, Параметр, Источник);
	РассылкаОповещенияИзТекущейФормы = Ложь;

КонецПроцедуры

#КонецОбласти

#Область РегистрацияВНалоговомОргане

&НаКлиентеНаСервереБезКонтекста
Функция ВладелецРегистрации(Форма)
	
	Объект            = Форма.Объект;
	ОрганизацияСсылка = Форма.ОрганизацияСсылка;
	Возврат ?(Объект.ОбособленноеПодразделение, Объект.ГоловнаяОрганизация, ОрганизацияСсылка);
	
КонецФункции

&НаСервере
Процедура УстановитьРегистрациюВНалоговомОргане()
	
	ВладелецРегистрации = ВладелецРегистрации(ЭтаФорма);
	
	Если Объект.КПП = РегистрацияВНалоговомОргане.КПП
		И Объект.КодНалоговогоОргана = РегистрацияВНалоговомОргане.Код Тогда
		//регистрация в налоговом органе подходит, не нужно ничего изменять
		Возврат;
	КонецЕсли;
	
	СуществующаяРегистрация = Справочники.РегистрацииВНалоговомОргане.РегистрацияВНалоговомОргане(ВладелецРегистрации, Объект.КПП, Объект.КодНалоговогоОргана);
	
	Если ЗначениеЗаполнено(СуществующаяРегистрация) Тогда
		РегистрацииВНалоговомОрганеФорма.ОбновитьРегистрациюВНалоговомОргане(ЭтотОбъект, Объект.КПП, Объект.КодНалоговогоОргана, СуществующаяРегистрация);
	Иначе
		РегистрацииВНалоговомОрганеФорма.УстановитьНовуюРегистрацию(ЭтотОбъект, ВладелецРегистрации, Объект.КПП, Объект.КодНалоговогоОргана);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеРегистрацииВНалоговомОргане(ТекущийОбъект, Отказ = Ложь)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.РегистрацияВНалоговомОргане) Тогда
		
		Если МожноСохранитьРегистрацию(ЭтотОбъект) Тогда
			
			РегистрацииВНалоговомОрганеФорма.ЗаписатьРегистрациюВНалоговомОргане(ЭтотОбъект, ТекущийОбъект, ВладелецРегистрации(ЭтаФорма));
			
			ЗаписьНового = ТекущийОбъект.ДополнительныеСвойства.Свойство("ЗаписьНового");
			
			РегистрацииВНалоговомОрганеФорма.ЗаписатьНаборЗаписейИсторииРегистрацийВНалоговомОргане(ЭтотОбъект, ОрганизацияСсылка, ЗаписьНового);
			
			ПодчиненныеСтруктурныеЕдиницы = Справочники.ПодразделенияОрганизаций.ПодчиненныеСтруктурныеЕдиницы(ТекущийОбъект.Ссылка);
			РегистрыСведений.ИсторияРегистрацийВНалоговомОргане.ОбновитьПодчиненныеСтруктурныеЕдиницы(ПодчиненныеСтруктурныеЕдиницы);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьРегистрациюВНалоговомОргане()
	
	РегистрацииВНалоговомОрганеФорма.ПрочитатьНаборЗаписейИсторииРегистрацийВНалоговомОргане(ЭтотОбъект, Объект.Ссылка);
	
	Если ЗначениеЗаполнено(Объект.РегистрацияВНалоговомОргане)
		И ОбщегоНазначения.СсылкаСуществует(Объект.РегистрацияВНалоговомОргане) Тогда
		
		РегистрацияВНалоговомОрганеОбъект = Объект.РегистрацияВНалоговомОргане.ПолучитьОбъект();
		ЗначениеВРеквизитФормы(РегистрацияВНалоговомОрганеОбъект, "РегистрацияВНалоговомОргане");
		ОтчетностьПодписываетПредставитель = ?(ЗначениеЗаполнено(РегистрацияВНалоговомОргане.Представитель), 1, 0);
		
	ИначеЕсли ЗначениеЗаполнено(Объект.КодНалоговогоОргана)
		ИЛИ ЗначениеЗаполнено(Объект.КПП) Тогда
		
		УстановитьРегистрациюВНалоговомОргане();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьРегистрациюВНалоговомОргане()
	
	Если МожноСохранитьРегистрацию(ЭтотОбъект) Тогда
		
		РегистрацииВНалоговомОрганеФорма.ЗаписатьРегистрациюВНалоговомОргане(ЭтотОбъект, Объект, ВладелецРегистрации(ЭтаФорма));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция МожноСохранитьРегистрацию(Форма)
	
	Возврат ЗначениеЗаполнено(Форма.РегистрацияВНалоговомОргане.Код)
			И (Форма.ЭтоФизЛицо ИЛИ ЗначениеЗаполнено(Форма.РегистрацияВНалоговомОргане.КПП));
	
КонецФункции

&НаСервере
Процедура ОбновитьРегистрациюПослеЗаписиВФормеРегистрации(НоваяРегистрация)
	
	РеквизитыРегистрации = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяРегистрация, "КПП, Код");
	Если Объект.КПП <> РеквизитыРегистрации.КПП
		ИЛИ Объект.КодНалоговогоОргана <> РеквизитыРегистрации.Код Тогда
		
		// Была изменена регистрация в налоговом органе, при этом у нее изменились ключевые реквизиты
		// При записи регистрации в налоговом органе был перезаписан и элемент справочника организации.
		// Необходимо его перечитать для обновления данных
		
		Прочитать();
		
	Иначе
		
		РегистрацииВНалоговомОрганеФорма.ОбновитьРегистрациюВНалоговомОргане(ЭтотОбъект, Объект.КПП, Объект.КодНалоговогоОргана, НоваяРегистрация);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеРедактированияИсторииРегистрацийВНалоговомОргане()
	
	Если ИсторияРегистрацийВНалоговомОрганеНаборЗаписей.Количество() > 0 Тогда
		
		АктуальнаяЗапись = РегистрацииВНалоговомОрганеФорма.АктуальнаяЗаписьИстории(ЭтотОбъект);
		РегистрацииВНалоговомОрганеФорма.ОбновитьРегистрациюВНалоговомОргане(ЭтотОбъект, Объект.КПП, Объект.КодНалоговогоОргана, АктуальнаяЗапись.РегистрацияВНалоговомОргане);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ИсторияНаименований

&НаКлиенте
Процедура ОткрытьИсториюНаименований()
	
	Если Не ТолькоПросмотр Тогда
		ЗаблокироватьДанныеФормыДляРедактирования();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекущееНаименованиеСокращенное", Объект.НаименованиеСокращенное);
	ПараметрыФормы.Вставить("ТекущееНаименованиеПолное",      Объект.НаименованиеПолное);
	ПараметрыФормы.Вставить("ТекущаяФамилияИП",               Объект.ФамилияИП);
	ПараметрыФормы.Вставить("ТекущееИмяИП",                   Объект.ИмяИП);
	ПараметрыФормы.Вставить("ТекущееОтчествоИП",              Объект.ОтчествоИП);
	ПараметрыФормы.Вставить("ИсторияНаименований",            Объект.ИсторияНаименований);
	ПараметрыФормы.Вставить("ТолькоПросмотр",                 ТолькоПросмотр);
	ПараметрыФормы.Вставить("Наименование",                   Объект.Наименование);
	ПараметрыФормы.Вставить("ЮридическоеФизическоеЛицо",      Объект.ЮридическоеФизическоеЛицо);
	
	ОткрытьФорму("Справочник.Организации.Форма.РедактированиеИсторииНаименований", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаименованиеПослеРедактированияИстории(НаборЗаписей)
	
	Модифицированность = Истина;
	
	НаборЗаписей.Сортировать("Период");
	
	Объект.ИсторияНаименований.Очистить();
	Если НаборЗаписей.Количество() > 1 Тогда
		Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
			ЗаписьИстории = Объект.ИсторияНаименований.Добавить();
			ЗаполнитьЗначенияСвойств(ЗаписьИстории, ЗаписьНабора);
		КонецЦикла;
	КонецЕсли;
	
	АктуальнаяЗапись = НаборЗаписей[НаборЗаписей.Количество()-1];
	Объект.НаименованиеСокращенное = АктуальнаяЗапись.НаименованиеСокращенное;
	Объект.НаименованиеПолное      = АктуальнаяЗапись.НаименованиеПолное;
	Объект.ФамилияИП               = АктуальнаяЗапись.ФамилияИП;
	Объект.ИмяИП                   = АктуальнаяЗапись.ИмяИП;
	Объект.ОтчествоИП              = АктуальнаяЗапись.ОтчествоИП;
	
	Если ПустаяСтрока(Объект.Наименование)
		ИЛИ ОрганизацииФормыКлиентСервер.НаименованиеСоответствуетСокращенномуНаименованию(НаименованиеСокращенноеДоИзменения, Объект.Наименование) Тогда
		Объект.Наименование = ОрганизацииФормыКлиентСервер.НаименованиеПоСокращенномуНаименованию(Объект.НаименованиеСокращенное);
	КонецЕсли;
	
	ПослеИзмененияСокращенногоНаименования();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеСведенийОНалоговойИнспекции()
	
	ОписаниеОшибки = "";
	ПерезаполнятьСведения = Истина;
	ЗаполнитьСведенияОНалоговойИнспекцииПоКоду(ОписаниеОшибки, ПерезаполнятьСведения);
	
	// Обработка ошибок
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Если ОписаниеОшибки = "НеУказаныПараметрыАутентификации" Тогда
			
			ТекстВопроса = НСтр("ru='Для автоматического заполнения реквизитов контрагентов
				|необходимо подключиться к Интернет-поддержке пользователей.
				|Подключиться сейчас?'");
				
			ПараметрыВопроса = Новый Структура("ВызовПослеПодключения", "ЗаполнитьСведенияОНалоговойИнспекцииПоКоду");
			ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержку", ЭтотОбъект, ПараметрыВопроса);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		ИначеЕсли ОписаниеОшибки = "Сервис1СКонтрагентНеПодключен" Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИдентификаторМестаВызова", "organizaciya");
			ОткрытьФорму("ОбщаяФорма.Сервис1СКонтрагентНеПодключен", ПараметрыФормы, ЭтотОбъект);
			
		Иначе
			ПоказатьПредупреждение(, ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеСведенийОбОтделенииФСС()
	
	ОписаниеОшибки = "";
	ПерезаполнятьСведения = Истина;
	ЗаполнитьСведенияОбОтделенииФСС(ОписаниеОшибки, ПерезаполнятьСведения);
	
	// Обработка ошибок
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Если ОписаниеОшибки = "НеУказаныПараметрыАутентификации" Тогда
			
			ТекстВопроса = НСтр("ru='Для автоматического заполнения реквизитов контрагентов
				|необходимо подключиться к Интернет-поддержке пользователей.
				|Подключиться сейчас?'");
			
			ПараметрыВопроса = Новый Структура("ВызовПослеПодключения", "ЗаполнитьСведенияОбОтделенииФСС");
			ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержку", ЭтотОбъект, ПараметрыВопроса);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		ИначеЕсли ОписаниеОшибки = "Сервис1СКонтрагентНеПодключен" Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИдентификаторМестаВызова", "organizaciya");
			ОткрытьФорму("ОбщаяФорма.Сервис1СКонтрагентНеПодключен", ПараметрыФормы, ЭтотОбъект);
			
		Иначе
			ПоказатьПредупреждение(, ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗаполнениеСведенийОбОтделенииПФР()
	
	ОписаниеОшибки = "";
	ПерезаполнятьСведения = Истина;
	ЗаполнитьСведенияОбОтделенииПФР(ОписаниеОшибки, ПерезаполнятьСведения);
	
	// Обработка ошибок
	Если ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Если ОписаниеОшибки = "НеУказаныПараметрыАутентификации" Тогда
			
			ТекстВопроса = НСтр("ru='Для автоматического заполнения реквизитов контрагентов
				|необходимо подключиться к Интернет-поддержке пользователей.
				|Подключиться сейчас?'");
				
			ПараметрыВопроса = Новый Структура("ВызовПослеПодключения", "ЗаполнитьСведенияОбОтделенииПФР");
			ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержку", ЭтотОбъект, ПараметрыВопроса);
			ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			
		ИначеЕсли ОписаниеОшибки = "Сервис1СКонтрагентНеПодключен" Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИдентификаторМестаВызова", "organizaciya");
			ОткрытьФорму("ОбщаяФорма.Сервис1СКонтрагентНеПодключен", ПараметрыФормы, ЭтотОбъект);
			
		Иначе
			ПоказатьПредупреждение(, ОписаниеОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРеквизитыПоДаннымЕГРНаКлиенте(ИННОбъекта, ПроверитьПодключение = Истина)

	ДанныеЗаполнения = ДанныеЕдиныхГосРеестровПоИНН(ИННОбъекта, НЕ ЭтоФизЛицо, Объект.Ссылка);
	
	// Обработка ошибок
	Если НЕ ПустаяСтрока(ДанныеЗаполнения.ОписаниеОшибки) Тогда
		Если ДанныеЗаполнения.ОписаниеОшибки = "НеУказаныПараметрыАутентификации" Тогда
			Если ПроверитьПодключение Тогда
				ТекстВопроса = НСтр("ru='Для автоматического заполнения реквизитов
					|необходимо подключиться к Интернет-поддержке пользователей.
					|Подключиться сейчас?'");
				ПараметрыВопроса = Новый Структура("ВызовПослеПодключения, ИННОбъекта", "ЗаполнитьРеквизитыПоДаннымЕГРНаКлиенте", ИННОбъекта);
				ОписаниеОповещения = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержку", ЭтотОбъект, ПараметрыВопроса);
				ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
			Иначе
				ЗаполнятьРеквизитыПоИНН = Истина;
			КонецЕсли;
		ИначеЕсли ДанныеЗаполнения.ОписаниеОшибки = "Сервис1СКонтрагентНеПодключен" Тогда
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ИдентификаторМестаВызова", "organizaciya");
			ОткрытьФорму("ОбщаяФорма.Сервис1СКонтрагентНеПодключен", ПараметрыФормы, ЭтотОбъект);
			
		Иначе
			ПоказатьПредупреждение(, ДанныеЗаполнения.ОписаниеОшибки);
		КонецЕсли;
	ИначеЕсли Параметры.Ключ.Пустая() Тогда
		ПерезаполнитьРеквизитыНаСервере(ДанныеЗаполнения.АдресРеквизитовОрганизации);
		УстановитьСвойстваФизическогоЛицаПослеЗаполнения();
	Иначе
		ПерезаполнитьРеквизитыНаКлиенте(ДанныеЗаполнения);
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_РазрешитьЗаполнениеРеквизитовПоИНН", 0.2, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФизЛицоДолжностьРуководителя(РеквизитыФизЛица);
	
	РуководительФизЛицо = ОтветственныеЛицаБП.ПолучитьСоздатьФизЛицо(РеквизитыФизЛица);
	Если ЗначениеЗаполнено(РуководительФизЛицо) Тогда
		РуководительДолжность = ОтветственныеЛицаБП.ПолучитьСоздатьДолжность(РеквизитыФизЛица.Должность);
		ИзмененРуководитель = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОНалоговойИнспекцииПоАдресу(ЗначенияПолейАдреса, ОписаниеОшибки = "")
	
	Если НЕ ЗначениеЗаполнено(ЗначенияПолейАдреса) Тогда
		Возврат;
	КонецЕсли;
	
	СведенияОНалоговомОрганеПоАдресу = ДанныеАдресногоКлассификатора.НалоговыйОрганПоАдресу(ЗначенияПолейАдреса);
	Если ЗначениеЗаполнено(СведенияОНалоговомОрганеПоАдресу.ОписаниеОшибки) Тогда
		ОписаниеОшибки = СведенияОНалоговомОрганеПоАдресу.ОписаниеОшибки;
		Возврат;
	КонецЕсли;
	
	Объект.КодНалоговогоОргана = ?(ЭтоФизЛицо, 
		СведенияОНалоговомОрганеПоАдресу.КодНалоговойДляФизическихЛиц,
		СведенияОНалоговомОрганеПоАдресу.КодНалоговойДляЮридическихЛиц);
	
	УстановитьРегистрациюВНалоговомОргане();
	
	ЗаполнитьСведенияОНалоговойИнспекцииПоКоду();
	
	РегистрацияВНалоговомОргане.КодПоОКАТО = СведенияОНалоговомОрганеПоАдресу.КодПоОКАТО;
	РегистрацияВНалоговомОргане.КодПоОКТМО = СведенияОНалоговомОрганеПоАдресу.КодПоОКТМО;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОНалоговойИнспекцииПоКоду(ОписаниеОшибки = "", ПерезаполнятьСведения = Ложь)
	
	Если НЕ ЗначениеЗаполнено(Объект.КодНалоговогоОргана) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыНалоговогоОргана = ДанныеГосударственныхОрганов.РеквизитыНалоговогоОрганаПоКоду(Объект.КодНалоговогоОргана);
	
	Если ЗначениеЗаполнено(РеквизитыНалоговогоОргана.ОписаниеОшибки) Тогда
		ОписаниеОшибки = РеквизитыНалоговогоОргана.ОписаниеОшибки;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РеквизитыНалоговогоОргана.Ссылка)
		ИЛИ ПерезаполнятьСведения Тогда
		ДанныеГосударственныхОрганов.ОбновитьДанныеГосударственногоОргана(РеквизитыНалоговогоОргана);
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ПлатежныеРеквизитыФНСПредставление = ДанныеГосударственныхОрганов.ПредставлениеПлатежныхРеквизитовГосударственногоОргана(РеквизитыНалоговогоОргана);
	
	РегистрацияВНалоговомОргане.Наименование     = РеквизитыНалоговогоОргана.Наименование;
	РегистрацияВНалоговомОргане.НаименованиеИФНС = РеквизитыНалоговогоОргана.ПолноеНаименование;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОтделенииФСС(ОписаниеОшибки = "", ПерезаполнятьСведения = Ложь)
	
	Если НЕ ЗначениеЗаполнено(Объект.КодПодчиненностиФСС) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОтделенияФСС = ДанныеГосударственныхОрганов.РеквизитыОтделенияФССПоКоду(Объект.КодПодчиненностиФСС);
	
	Если ЗначениеЗаполнено(РеквизитыОтделенияФСС.ОписаниеОшибки) Тогда
		ОписаниеОшибки = РеквизитыОтделенияФСС.ОписаниеОшибки;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РеквизитыОтделенияФСС.Ссылка)
		ИЛИ ПерезаполнятьСведения Тогда
		ДанныеГосударственныхОрганов.ОбновитьДанныеГосударственногоОргана(РеквизитыОтделенияФСС);
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ПлатежныеРеквизитыФССПредставление = ДанныеГосударственныхОрганов.ПредставлениеПлатежныхРеквизитовГосударственногоОргана(РеквизитыОтделенияФСС);
	
	Объект.НаименованиеТерриториальногоОрганаФСС = РеквизитыОтделенияФСС.Наименование;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСведенияОбОтделенииПФР(ОписаниеОшибки = "", ПерезаполнятьСведения = Ложь)
	
	Если НЕ ЗначениеЗаполнено(Объект.КодОрганаПФР) Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыОтделенияПФР = ДанныеГосударственныхОрганов.РеквизитыОтделенияПФРПоКоду(Лев(Объект.КодОрганаПФР, 3));
	
	Если ЗначениеЗаполнено(РеквизитыОтделенияПФР.ОписаниеОшибки) Тогда
		ОписаниеОшибки = РеквизитыОтделенияПФР.ОписаниеОшибки;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(РеквизитыОтделенияПФР.Ссылка)
		ИЛИ ПерезаполнятьСведения Тогда
		ДанныеГосударственныхОрганов.ОбновитьДанныеГосударственногоОргана(РеквизитыОтделенияПФР);
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ПлатежныеРеквизитыПФРПредставление = ДанныеГосударственныхОрганов.ПредставлениеПлатежныхРеквизитовГосударственногоОргана(РеквизитыОтделенияПФР);
	
КонецПроцедуры

&НаСервере
Функция СведенияОНалоговомОрганеПоАдресу(ЗначенияПолейАдреса)
	
	Если НЕ ЗначениеЗаполнено(ЗначенияПолейАдреса) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СведенияОНалоговомОрганеПоАдресу = ДанныеАдресногоКлассификатора.НалоговыйОрганПоАдресу(ЗначенияПолейАдреса);
	Если ЗначениеЗаполнено(СведенияОНалоговомОрганеПоАдресу.ОписаниеОшибки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СведенияОНалоговомОрганеПоАдресу.Вставить("КодНалоговогоОргана",
		?(ЭтоФизЛицо, 
			СведенияОНалоговомОрганеПоАдресу.КодНалоговойДляФизическихЛиц,
			СведенияОНалоговомОрганеПоАдресу.КодНалоговойДляЮридическихЛиц));
	
	Возврат СведенияОНалоговомОрганеПоАдресу;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьЭлементКонтактнойИнформации(ИмяРеквизита, Представление, ЗначенияПолей)
	
	Отбор  = Новый Структура("ИмяРеквизита", ИмяРеквизита);
	Строки = ЭтотОбъект.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Отбор);
	ДанныеСтроки = ?(Строки.Количество() = 0, Неопределено, Строки[0]);
	
	Если ДанныеСтроки <> Неопределено Тогда
		
		ДанныеСтроки.Представление = Представление;
		ДанныеСтроки.ЗначенияПолей = ЗначенияПолей;
		ЭтотОбъект[ИмяРеквизита]   = Представление;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НаименованиеОтветственногоЛица(ФамилияИмяОтчество, Должность)
	
	Возврат СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 (%2)'"), ФамилияИмяОтчество, Должность);
	
КонецФункции

&НаКлиенте
Процедура ПодключитьИнтернетПоддержку(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПодключитьИнтернетПоддержкуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ИнтернетПоддержкаПользователейКлиент.ПодключитьИнтернетПоддержкуПользователей(Оповещение);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьИнтернетПоддержкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		
		Если ДополнительныеПараметры.Свойство("ВызовПослеПодключения") Тогда
			
			Если ДополнительныеПараметры.ВызовПослеПодключения = "ЗаполнитьРеквизитыПоДаннымЕГРНаКлиенте" Тогда
				
				ЗаполнитьРеквизитыПоДаннымЕГРНаКлиенте(ДополнительныеПараметры.ИННОбъекта, Ложь);
				
			ИначеЕсли ДополнительныеПараметры.ВызовПослеПодключения = "ЗаполнитьСведенияОНалоговойИнспекцииПоКоду" Тогда
				
				ЗаполнитьСведенияОНалоговойИнспекцииПоКоду( , Истина);
				
			ИначеЕсли ДополнительныеПараметры.ВызовПослеПодключения = "ЗаполнитьСведенияОбОтделенииФСС" Тогда
				
				ЗаполнитьСведенияОбОтделенииФСС( , Истина);
				
			ИначеЕсли ДополнительныеПараметры.ВызовПослеПодключения = "ЗаполнитьСведенияОбОтделенииПФР" Тогда
				
				ЗаполнитьСведенияОбОтделенииПФР( , Истина);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеРеквизитыФНСПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидГосударственногоОргана", ПредопределенноеЗначение("Перечисление.ВидыГосударственныхОрганов.НалоговыйОрган"));
	ПараметрыФормы.Вставить("КодГосударственногоОргана", Объект.КодНалоговогоОргана);
	ПараметрыФормы.Вставить("НаименованиеГосударственногоОргана", РегистрацияВНалоговомОргане.НаименованиеИФНС);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзменениеПлатежныхРеквизитовФНС", ЭтотОбъект, ПараметрыФормы);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ПлатежныеРеквизитыГосударственныхОрганов", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеРеквизитыФССПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидГосударственногоОргана", ПредопределенноеЗначение("Перечисление.ВидыГосударственныхОрганов.ОрганФСС"));
	ПараметрыФормы.Вставить("КодГосударственногоОргана", Объект.КодПодчиненностиФСС);
	ПараметрыФормы.Вставить("НаименованиеГосударственногоОргана", Объект.НаименованиеТерриториальногоОрганаФСС);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзменениеПлатежныхРеквизитовФСС", ЭтотОбъект, ПараметрыФормы);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ПлатежныеРеквизитыГосударственныхОрганов", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеРеквизитыПФРПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидГосударственногоОргана", ПредопределенноеЗначение("Перечисление.ВидыГосударственныхОрганов.ОрганПФР"));
	ПараметрыФормы.Вставить("КодГосударственногоОргана", Объект.КодОрганаПФР);
	ПараметрыФормы.Вставить("НаименованиеГосударственногоОргана", Объект.НаименованиеТерриториальногоОрганаПФР);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработатьИзменениеПлатежныхРеквизитовПФР", ЭтотОбъект, ПараметрыФормы);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ПлатежныеРеквизитыГосударственныхОрганов", ПараметрыФормы, ЭтотОбъект, ЭтотОбъект, , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеПлатежныхРеквизитовФНС(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = Истина Тогда
		
		УстановитьПредставлениеПлатежныхРеквизитов(
			ДопПараметры.ВидГосударственногоОргана,
			ДопПараметры.КодГосударственногоОргана,
			ПлатежныеРеквизитыФНСПредставление);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеПлатежныхРеквизитовФСС(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = Истина Тогда
		
		УстановитьПредставлениеПлатежныхРеквизитов(
			ДопПараметры.ВидГосударственногоОргана,
			ДопПараметры.КодГосударственногоОргана,
			ПлатежныеРеквизитыФССПредставление);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеПлатежныхРеквизитовПФР(Ответ, ДопПараметры) Экспорт
	
	Если Ответ = Истина Тогда
		
		УстановитьПредставлениеПлатежныхРеквизитов(
			ДопПараметры.ВидГосударственногоОргана,
			ДопПараметры.КодГосударственногоОргана,
			ПлатежныеРеквизитыПФРПредставление);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПредставлениеПлатежныхРеквизитов(Вид, Код, ПлатежныеРеквизитыПредставление)
	
	Если ЗначениеЗаполнено(Код) Тогда
		ГосударственныйОрган = ДанныеГосударственныхОрганов.ГосударственныйОрган(Вид, Код);
	Иначе
		ГосударственныйОрган = Неопределено;
	КонецЕсли;
	
	ПлатежныеРеквизитыПредставление = ДанныеГосударственныхОрганов.ПредставлениеПлатежныхРеквизитовГосударственногоОргана(ГосударственныйОрган);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РазрешитьЗаполнениеРеквизитовПоИНН()

	ЗаполнятьРеквизитыПоИНН = Истина;

КонецПроцедуры 

&НаКлиенте
Процедура УстановитьСвойстваФизическогоЛицаПослеЗаполнения()
	
	ПроверитьСоответствиеТребованиямИНН();
	
	Если ЭтоФизЛицо Тогда
		Объект.КПП = "";
		ФИОПриИзменении();
	ИначеЕсли ИННСоответствуетТребованиям И ПустаяСтрока(Объект.КПП) Тогда
		Объект.КПП = Лев(Объект.ИНН, 4) + "01001";
		ПриИзмененииКПП();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКодОрганаПФР(РегНомерПФР)
	
	Результат = Лев(СокрЛ(РегНомерПФР), 7);	
	
	Если СтрДлина(СокрЛП(Результат)) < 7 Тогда
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьКодПодчиненностиФСС(РегНомерФСС)
	
	КодПричиныРегистрации = "1"; // Юридическое лицо.
	
	Если КодПричиныРегистрации = "ОбособленноеПодразделение" Тогда
		Результат = "2";
	ИначеЕсли КодПричиныРегистрации = "ИндивидуальныйПредприниматель" Тогда
		Результат = "3";
	КонецЕсли;
	
	Результат = Лев(СокрЛ(РегНомерФСС), 4) + КодПричиныРегистрации;
	
	Если СтрДлина(СокрЛП(Результат)) < 4 Тогда
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#Область ОсновнойБанковскийСчет

&НаКлиенте
Функция ЗаблокироватьБанковскийСчетПриРедактировании()
	
	Если НЕ БанковскийСчет.Ссылка.Пустая() И НЕ БанковскийСчетЗаблокирован Тогда
		Если НЕ ЗаблокироватьБанковскийСчетПриРедактированииНаСервере(БанковскийСчет.Ссылка, БанковскийСчет.ВерсияДанных, УникальныйИдентификатор) Тогда
			ПоказатьПредупреждение(, НСтр("ru='Не удается внести изменения в реквизиты основного банковского счета. Возможно данные редактируются другим пользователем.'"));
			ПрочитатьОсновнойБанковскийСчет();
			Возврат Ложь;
		Иначе
			БанковскийСчетЗаблокирован = Истина;
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
Функция ЗаблокироватьБанковскийСчетПриРедактированииНаСервере(Ссылка, ВерсияДанных, УникальныйИдентификатор)
	
	Попытка
		ЗаблокироватьДанныеДляРедактирования(Ссылка, ВерсияДанных, УникальныйИдентификатор);
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

&НаСервереБезКонтекста
Функция РазблокироватьБанковскийСчетПриРедактированииНаСервере(Ссылка, ИдентификаторФормы)

	РазблокироватьДанныеДляРедактирования(Ссылка, ИдентификаторФормы);

КонецФункции

&НаСервере
Процедура ПрочитатьОсновнойБанковскийСчет()

	Если ЗначениеЗаполнено(Объект.ОсновнойБанковскийСчет) Тогда
		ОсновнойБанковскийСчетОбъект = Объект.ОсновнойБанковскийСчет.ПолучитьОбъект();
	ИначеЕсли ПравоДоступа("Добавление", Метаданные.Справочники.БанковскиеСчета) Тогда
		ОсновнойБанковскийСчетОбъект = Справочники.БанковскиеСчета.СоздатьЭлемент();
	Иначе
		ОсновнойБанковскийСчетОбъект = Неопределено;
	КонецЕсли;
	
	Если ОсновнойБанковскийСчетОбъект<> Неопределено Тогда
		ЗначениеВРеквизитФормы(ОсновнойБанковскийСчетОбъект, "БанковскийСчет");
		ИзмененБанковскийСчет = Ложь;
		РеквизитыБанка = БанковскиеСчетаВызовСервера.ПолучитьРеквизитыБанкаИзСправочника(БанковскийСчет.Банк);
		БИКБанка = РеквизитыБанка.Код;
		НаименованиеБанка = РеквизитыБанка.Наименование;
		ДеятельностьБанкаПрекращена = РеквизитыБанка.ДеятельностьПрекращена;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьОсновнойБанковскийСчет(ТекущийОбъект)

	Если ЗначениеЗаполнено(ТекущийОбъект.ОсновнойБанковскийСчет) И ИзмененБанковскийСчет Тогда
		
		ОбъектРегистрации = РеквизитФормыВЗначение("БанковскийСчет");
		
		Если НЕ ЗначениеЗаполнено(ОбъектРегистрации.Ссылка) Тогда
			ОбъектРегистрации.УстановитьСсылкуНового(ТекущийОбъект.ОсновнойБанковскийСчет);
			ОбъектРегистрации.Заполнить(Новый Структура("Владелец", ТекущийОбъект.Ссылка));
		КонецЕсли;
		
		ОбъектРегистрации.Валютный = (ОбъектРегистрации.ВалютаденежныхСредств <> ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
		ОбъектРегистрации.Наименование = БанковскиеСчетаФормыКлиентСервер.НаименованиеБанковскогоСчета(ОбъектРегистрации, НаименованиеБанка);
		ОбъектРегистрации.Записать();
		
		ЗначениеВРеквизитФормы(ОбъектРегистрации, "БанковскийСчет");
		
		ИзмененБанковскийСчет = Ложь;
		
		Если БанковскийСчетЗаблокирован Тогда
			РазблокироватьДанныеДляРедактирования(ТекущийОбъект.ОсновнойБанковскийСчет, УникальныйИдентификатор);
			БанковскийСчетЗаблокирован = Ложь;
		КонецЕсли; 
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#Область Классификаторы

&НаСервере
Процедура УстановитьКодыСтатистикиДляИП()
	
	Объект.КодОКОПФ          = "50102";
	Объект.НаименованиеОКОПФ = НаименованиеОКОПФ(Объект.КодОКОПФ);
	
	Объект.КодОКФС           = "16";
	Объект.НаименованиеОКФС  = НаименованиеОКФС(Объект.КодОКФС);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НаименованиеОКВЭД(Знач КодОКВЭД)

	ОКВЭД = ОбщегоНазначенияБПВызовСервера.ПолучитьКлассификатор("ОКВЭД");
	
	Возврат ОКВЭД.Получить(КодОКВЭД);

КонецФункции

&НаСервереБезКонтекста
Функция НаименованиеОКФС(Знач КодОКФС)

	ОКФС = ОбщегоНазначенияБПВызовСервера.ПолучитьКлассификатор("ОКФС");

	Возврат ОКФС.Получить(КодОКФС);

КонецФункции

&НаСервереБезКонтекста
Функция НаименованиеОКОПФ(Знач КодОКОПФ)

	ОКОПФ = ОбщегоНазначенияБПВызовСервера.ПолучитьКлассификатор("ОКОПФ");

	Возврат ОКОПФ.Получить(КодОКОПФ);

КонецФункции

&НаСервереБезКонтекста
Функция НаименованиеПоКлассификатору(Знач ИмяКлассификатора, Знач КодПоКлассификатору)

	Классификатор = ОбщегоНазначенияБПВызовСервера.ПолучитьКлассификатор(ИмяКлассификатора);
	
	Возврат Классификатор.Получить(КодПоКлассификатору);

КонецФункции

&НаСервере
Процедура УстановитьКодРосстатаПоАдресу(Адрес)
	
	Если НЕ ЗначениеЗаполнено(Объект.КодОрганаФСГС) Тогда
		
		КодРегиона = КодРегионаПоАдресу(Адрес);
		
		Если ЗначениеЗаполнено(КодРегиона) Тогда
			СписокОтделений = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.ОтделенияРосстатаРегиона(Формат(КодРегиона, "ЧЦ=2; ЧН=; ЧВН="));
			Если СписокОтделений.Количество()=1 Тогда
				Объект.КодОрганаФСГС = СписокОтделений[0].КодТОГС;
				НаименованиеТОГС     = СписокОтделений[0].НаименованиеТОГС;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция КодРегионаПоАдресу(Адрес)
	
	Возврат УправлениеКонтактнойИнформациейБП.КодРегионаПоАдресу(Адрес);
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеСведенийОбОтветственныхЛицах

&НаКлиенте
Процедура ПоказатьИсториюОтветственныхЛицНажатие(Роль)
	
	Перем ОтветственноеЛицо;
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОтветственноеЛицо	= ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций."+Роль);
	
	Отбор	= Новый Структура("СтруктурнаяЕдиница,ОтветственноеЛицо",
		Объект.Ссылка,
		ОтветственноеЛицо);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ДекорацияИсторияПодписиНажатиеЗавершение", ЭтотОбъект);
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор",	Отбор);
	ПараметрыФормы.Вставить("ТолькоПросмотр",	ТолькоПросмотр);
		
	ОткрытьФорму("РегистрСведений.ОтветственныеЛицаОрганизаций.Форма.ФормаИстории", ПараметрыФормы, ЭтотОбъект,,,, ОписаниеОповещения);
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияИсторияПодписиНажатиеЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
		ОбновитьИнформациюОбОтветственныхЛицах();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДолжностьНасервере(Организация, ФизическоеЛицо,Роль)
	
	ДанныеОтветственногоЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Организация, ФизическоеЛицо, ТекущаяДатаСеанса());
	Должность = ДанныеОтветственногоЛица.Должность;
	
	Если ЗначениеЗаполнено(ДанныеОтветственногоЛица.Должность) Тогда
		Возврат ДанныеОтветственногоЛица.Должность;
	КонецЕсли;
	
	ОтветственноеЛицо =  ПредопределенноеЗначение("Перечисление.ОтветственныеЛицаОрганизаций."+Роль);
	
	Возврат ОтветственныеЛицаБП.ПодобратьВероятнуюДолжностьОтветственногоЛица(ОтветственноеЛицо);
	
КонецФункции

&НаСервере
Процедура ОтветственныйПриЗаписиНаСервере(Отказ, ТекущийОбъект)
	
	МассивИзмененныхРеквизитов = Новый Массив;
		
	Если ИзмененРуководитель Тогда
		
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("ОтветственноеЛицо",	Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
		СтруктураРеквизитов.Вставить("ФизическоеЛицо",	РуководительФизЛицо);
		СтруктураРеквизитов.Вставить("Должность",РуководительДолжность);
		СтруктураРеквизитов.Вставить("Период",	РуководительКлючЗаписи.Период);
		
		МассивИзмененныхРеквизитов.Добавить(СтруктураРеквизитов);
	    		
	КонецЕсли;
	
	Если ИзмененГлавныйБухгалтер Тогда
		
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("ОтветственноеЛицо",	Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
		СтруктураРеквизитов.Вставить("ФизическоеЛицо",	ГлавныйБухгалтерФизЛицо);
		СтруктураРеквизитов.Вставить("Должность",ГлавныйБухгалтерДолжность);
		СтруктураРеквизитов.Вставить("Период",	ГлавныйБухгалтерКлючЗаписи.Период);
		
		МассивИзмененныхРеквизитов.Добавить(СтруктураРеквизитов);
		
	КонецЕсли;
	
	Если ИзмененКассир Тогда
		
		СтруктураРеквизитов = Новый Структура;
		СтруктураРеквизитов.Вставить("ОтветственноеЛицо",	Перечисления.ОтветственныеЛицаОрганизаций.Кассир);
		СтруктураРеквизитов.Вставить("ФизическоеЛицо",	КассирФизЛицо);
		СтруктураРеквизитов.Вставить("Должность",КассирДолжность);
		СтруктураРеквизитов.Вставить("Период",	КассирКлючЗаписи.Период);
		
		МассивИзмененныхРеквизитов.Добавить(СтруктураРеквизитов);
						
	КонецЕсли;
	
	Для Каждого РеквизитыПодписи из МассивИзмененныхРеквизитов Цикл
		
		РегистрыСведений.ОтветственныеЛицаОрганизаций.ЗаписатьНаборЗаписейИсторииОтветственныеЛицаОрганизаций(ТекущийОбъект.Ссылка, РеквизитыПодписи);
		
	КонецЦикла;
	
	ИзмененКассир = Ложь;
	ИзмененГлавныйБухгалтер = Ложь;
	ИзмененРуководитель = Ложь;
	
КонецПроцедуры
#КонецОбласти

#Область ПроверкаИННКПП

&НаКлиенте
Процедура ПроверитьСоответствиеТребованиямИНН()
	РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(Объект.ИНН, НЕ ЭтоФизЛицо);
	
	ИННСоответствуетТребованиям = РезультатПроверки.СоответствуетТребованиям;
	
	Если ЗначениеЗаполнено(РезультатПроверки.ОписаниеОшибки) Тогда
		ЦветВыделенияНекорректногоЗначения = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветВыделенияКонтрагентаСОшибкой");
		НадписьПоясненияНекорректногоИНН   = Новый ФорматированнаяСтрока(РезультатПроверки.ОписаниеОшибки, , ЦветВыделенияНекорректногоЗначения);
	Иначе
		НадписьПоясненияНекорректногоИНН  = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоответствиеТребованиямКПП()
	
	РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямКПП(
		Объект.КПП, 
		НЕ ЭтоФизЛицо, 
		Объект.ОбособленноеПодразделение,
		Ложь);
	
	КППСоответствуетТребованиям = РезультатПроверки.СоответствуетТребованиям;
	
	Если ЗначениеЗаполнено(РезультатПроверки.ОписаниеОшибки) Тогда
		ЦветВыделенияНекорректногоЗначения = ОбщегоНазначенияКлиент.ЦветСтиля("ЦветВыделенияКонтрагентаСОшибкой");
		НадписьПоясненияНекорректногоКПП = Новый ФорматированнаяСтрока(РезультатПроверки.ОписаниеОшибки, , ЦветВыделенияНекорректногоЗначения);
	Иначе
		НадписьПоясненияНекорректногоКПП = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИдентификационныеНомераНалогоплательщиков()

	ПроверитьСоответствиеТребованиямИНН();
	ПроверитьСоответствиеТребованиямКПП();

КонецПроцедуры
 

#КонецОбласти 

#Область ЗаполнениеСведенийОбОрганизации

&НаКлиенте
Процедура ПерезаполнитьРеквизитыНаКлиенте(ДанныеЗаполнения)
	
	ТекстВопроса = СтрШаблон(
		НСтр("ru='Заполнить по ИНН %1 %2?'"), 
		?(ДанныеЗаполнения.ЮридическоеФизическоеЛицо = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо"), НСтр("ru='юридического лица'"), НСтр("ru='предпринимателя'")),
		ДанныеЗаполнения.НаименованиеОрганизации);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПерезаполнитьРеквизитыЗавершение", ЭтотОбъект, ДанныеЗаполнения.АдресРеквизитовОрганизации);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьДокументыПоОрганизации(Организация)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Хозрасчетный.Регистратор
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Организация = &Организация";
	
	Возврат НЕ Запрос.Выполнить().Пустой();

КонецФункции

&НаКлиенте
Процедура ПерезаполнитьРеквизитыЗавершение(Ответ, АдресРеквизитовОрганизации) Экспорт

	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПерезаполнитьРеквизитыНаСервере(АдресРеквизитовОрганизации);
		УстановитьСвойстваФизическогоЛицаПослеЗаполнения();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриИзмененииВидаОрганизации()

	// Очистим реквизиты которых у ИП быть не может
	Если Объект.ЮридическоеФизическоеЛицо =Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо Тогда
		
		Объект.КПП = "";
		
		Объект.ИндивидуальныйПредприниматель = Справочники.ФизическиеЛица.ПустаяСсылка();
		
		УстановитьКодыСтатистикиДляИП();
		
		УстановитьНаименованиеИП();
		
	Иначе
		
		Объект.ИндивидуальныйПредприниматель = Справочники.ФизическиеЛица.ПустаяСсылка();
		Объект.ФамилияИП  = "";
		Объект.ИмяИП      = "";
		Объект.ОтчествоИП = "";
		ИсторияНаименований = Объект.ИсторияНаименований.Выгрузить();
		ИсторияНаименований.ЗаполнитьЗначения("", "ФамилияИП, ИмяИП, ОтчествоИП");
		Объект.ИсторияНаименований.Загрузить(ИсторияНаименований);
		// Для несовместимой для ЮрЛица учетной политики "Патентная" изменим учетную политику на "УСН Доходы"
			
		Если СтруктураУчетнойПолитики = Неопределено Тогда
			СтруктураУчетнойПолитики = ПараметрыСистемыНалогообложенияПоОрганизации(ОрганизацияСсылка);
		КонецЕсли;
		
		Если СтруктураУчетнойПолитики.СистемаНалогообложения = Перечисления.СистемыНалогообложения.ОсобыйПорядок 
			И СтруктураУчетнойПолитики.ПрименяетсяУСНПатент = Истина Тогда
			
			СтруктураУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаОрганизаций.ПолучитьСтруктуруУчетнойПолитики(ВидОрганизации, "УпрощеннаяДоходы", Ложь);
			
			СистемаНалогообложенияПредставление = ПредставлениеСистемыНалогообложения(СтруктураУчетнойПолитики);
			
		КонецЕслИ;
	КонецЕсли;
	
	Объект.КонтактнаяИнформация.Очистить();
	
	ИнициализироватьФорму();
	
	ПрочитатьКонтактнуюИнформацию(Объект);
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьРеквизитыНаСервере(АдресРеквизитовОрганизации)
	
	Реквизиты = ПолучитьИзВременногоХранилища(АдресРеквизитовОрганизации);
	ЗаполнитьПоРеквизитамНаСервере(Реквизиты);
	УдалитьИзВременногоХранилища(АдресРеквизитовОрганизации);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеЕдиныхГосРеестровПоИНН(Знач ИННОбъекта, Знач ЭтоЮрЛицо, Знач Ссылка)
	
	ДанныеЗаполнения = Новый Структура("ОписаниеОшибки", "");
	
	ИННОбъекта = СокрП(ИННОбъекта);
	
	РезультатПроверки = ИдентификационныеНомераНалогоплательщиков.ПроверитьСоответствиеТребованиямИНН(ИННОбъекта, ЭтоЮрЛицо);
	
	Если РезультатПроверки.СоответствуетТребованиям Тогда
		
		Если РезультатПроверки.ЭтоЮрЛицо Тогда
			РеквизитыОрганизации = ДанныеЕдиныхГосРеестров.РеквизитыЮридическогоЛицаПоИНН(ИННОбъекта);
		Иначе
			РеквизитыОрганизации = ДанныеЕдиныхГосРеестров.РеквизитыПредпринимателяПоИНН(ИННОбъекта);
		КонецЕсли;
		
		РеквизитыОрганизации.Вставить("ЮридическоеФизическоеЛицо", 
			?(РезультатПроверки.ЭтоЮрЛицо, Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо, Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо));
		
		Если ЗначениеЗаполнено(РеквизитыОрганизации.ОписаниеОшибки) Тогда
			
			ДанныеЗаполнения.ОписаниеОшибки = РеквизитыОрганизации.ОписаниеОшибки;
			
		ИначеЕсли РезультатПроверки.ЭтоЮрЛицо <> ЭтоЮрЛицо И ЕстьДокументыПоОрганизации(Ссылка) Тогда
			
			ДанныеЗаполнения.ОписаниеОшибки = НСтр("ru = 'Невозможно заполнить по ИНН. Существуют документы по организации.'");
			
		Иначе
			
			ДанныеЗаполнения.Вставить("НаименованиеОрганизации", РеквизитыОрганизации.Наименование);
			ДанныеЗаполнения.Вставить("ЮридическоеФизическоеЛицо", РеквизитыОрганизации.ЮридическоеФизическоеЛицо);
			ДанныеЗаполнения.Вставить("АдресРеквизитовОрганизации", ПоместитьВоВременноеХранилище(РеквизитыОрганизации, Новый УникальныйИдентификатор));
			
		КонецЕсли;
		
	Иначе
		
		ДанныеЗаполнения.ОписаниеОшибки = РезультатПроверки.ОписаниеОшибки;
		
	КонецЕсли;
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоРеквизитамНаСервере(Реквизиты)
	
	Если НЕ Объект.ЮридическоеФизическоеЛицо = Реквизиты.ЮридическоеФизическоеЛицо Тогда
		Объект.ЮридическоеФизическоеЛицо = Реквизиты.ЮридическоеФизическоеЛицо;
		ПриИзмененииВидаОрганизации();
	КонецЕсли;
	
	Объект.ИНН = Реквизиты.ИНН;
	
	Реквизиты.Свойство("КПП", Объект.КПП);
	
	Объект.Наименование            = Реквизиты.Наименование;
	Объект.НаименованиеПолное      = Реквизиты.НаименованиеПолное;
	Объект.НаименованиеСокращенное = Реквизиты.НаименованиеСокращенное;
	
	ПослеИзмененияСокращенногоНаименования();
	
	СвязанныеДанные = Новый Структура();
	
	Объект.ОГРН            = Реквизиты.РегистрационныйНомер;
	Объект.ДатаРегистрации = Реквизиты.ДатаРегистрации;
	
	Если Реквизиты.Свойство("КодОКВЭД")
		И ЗначениеЗаполнено(Реквизиты.КодОКВЭД) Тогда
		
		Объект.КодОКВЭД          = Реквизиты.КодОКВЭД;
		Объект.НаименованиеОКВЭД = НаименованиеОКВЭД(Объект.КодОКВЭД);
		
	КонецЕсли;
	
	Если Реквизиты.Свойство("ПравоваяФорма")
		И ЗначениеЗаполнено(Реквизиты.ПравоваяФорма) Тогда
		
		// ищем по предварительно заданным значениям подстановки
		ТаблицаПодстановки = Справочники.Организации.ТаблицаВыбораРеквизитовДляПодстановки();
		СтрокаПодстановки = ТаблицаПодстановки.Найти(ВРЕГ(Реквизиты.ПравоваяФорма), "ПравоваяФорма");
		Если СтрокаПодстановки <> Неопределено Тогда
			Объект.КодОКОПФ = СтрокаПодстановки.КодОКОПФ;
			Объект.НаименованиеОКОПФ = НаименованиеОКОПФ(Объект.КодОКОПФ);
			Объект.КодОКФС  = СтрокаПодстановки.КодОКФС;
			Объект.НаименованиеОКФС = НаименованиеОКФС(Объект.КодОКФС);
		Иначе
			ПараметрыОКОПФ = Справочники.Организации.ПолучитьПараметрыФормыВыбораДляКода("ОКОПФ", ТекущаяДатаСеанса());
			ЗначениеОКОПФ = ПараметрыОКОПФ.СписокКодов.Найти(Реквизиты.ПравоваяФорма, "Наименование");
			Если ЗначениеОКОПФ <> Неопределено Тогда
				Объект.КодОКОПФ          = ЗначениеОКОПФ.Код;
				Объект.НаименованиеОКОПФ = ЗначениеОКОПФ.Наименование;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	// Контактная информация
	
	Если Реквизиты.Свойство("ЮридическийАдрес")
		И ЗначениеЗаполнено(Реквизиты.ЮридическийАдрес) Тогда
		
		ПредставлениеАдреса = Реквизиты.ЮридическийАдрес.Представление;
		ЗначенияПолейАдреса = Реквизиты.ЮридическийАдрес.КонтактнаяИнформация;
		
		ЗаполнитьЭлементКонтактнойИнформации("КонтактнаяИнформацияПолеЮрАдресОрганизации", ПредставлениеАдреса, ЗначенияПолейАдреса);
		ЗаполнитьЭлементКонтактнойИнформации("КонтактнаяИнформацияПолеФактАдресОрганизации", ПредставлениеАдреса, ЗначенияПолейАдреса);
		ЗаполнитьЭлементКонтактнойИнформации("КонтактнаяИнформацияПолеПочтовыйАдресОрганизации", ПредставлениеАдреса, ЗначенияПолейАдреса);
		
		УстановитьКодРосстатаПоАдресу(ЗначенияПолейАдреса);
		
	КонецЕсли;
	
	Если Реквизиты.Свойство("Телефон")
		И ЗначениеЗаполнено(Реквизиты.Телефон) Тогда
		
		ПредставлениеТелефона = Реквизиты.Телефон.Представление;
		ЗначенияПолейТелефона = Реквизиты.Телефон.КонтактнаяИнформация;
		
		ЗаполнитьЭлементКонтактнойИнформации("КонтактнаяИнформацияПолеТелефонОрганизации", ПредставлениеТелефона, ЗначенияПолейТелефона);
		
	КонецЕсли;
	
	Если Реквизиты.Свойство("Руководитель")
		И ЗначениеЗаполнено(Реквизиты.Руководитель) Тогда
		
		ФамилияИмяОтчество = СтрШаблон(НСтр("ru = '%1 %2 %3'"),

				Реквизиты.Руководитель.Фамилия, Реквизиты.Руководитель.Имя, Реквизиты.Руководитель.Отчество);
		Руководитель = НаименованиеОтветственногоЛица(ФамилияИмяОтчество, Реквизиты.Руководитель.Должность);
		ЗаполнитьФизЛицоДолжностьРуководителя(Реквизиты.Руководитель);
		
	КонецЕсли;
	
	//Устанавливаем сведения о налоговой инспекции
	//В том случае, если указан юридический адрес, получаем код налоговой инспекции по адресу
	//и заполняем реквизиты инспеции по коду
	//В том случае, если юридического адреса нет - заполняем данные о налоговой инспекции
	//из кода в ЕГРЮЛ/ЕГРИП
	Если Реквизиты.Свойство("ЮридическийАдрес")
		И ЗначениеЗаполнено(Реквизиты.ЮридическийАдрес) Тогда
		ОписаниеОшибкиАдрес = "";
		ЗаполнитьСведенияОНалоговойИнспекцииПоАдресу(Реквизиты.ЮридическийАдрес.КонтактнаяИнформация, ОписаниеОшибкиАдрес);
		Если ЗначениеЗаполнено(ОписаниеОшибкиАдрес)
			И ЗначениеЗаполнено(Реквизиты.РегистрацияВНалоговомОргане)
			И ЗначениеЗаполнено(Реквизиты.РегистрацияВНалоговомОргане.Код) Тогда
			
			Объект.КодНалоговогоОргана = Реквизиты.РегистрацияВНалоговомОргане.Код;
			УстановитьРегистрациюВНалоговомОргане();
			ЗаполнитьСведенияОНалоговойИнспекцииПоКоду();
			
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Реквизиты.РегистрацияВНалоговомОргане) Тогда
		
		Объект.КодНалоговогоОргана = Реквизиты.РегистрацияВНалоговомОргане.Код;
		
		УстановитьРегистрациюВНалоговомОргане();
		
		ЗаполнитьСведенияОНалоговойИнспекцииПоКоду();
		
	КонецЕсли;
	
	Если Реквизиты.Свойство("РегистрацияВПенсионномФонде")
		И ЗначениеЗаполнено(Реквизиты.РегистрацияВПенсионномФонде) Тогда
		Объект.КодОрганаПФР = Реквизиты.РегистрацияВПенсионномФонде.КодОрганаПФР;
		Объект.НаименованиеТерриториальногоОрганаПФР = Реквизиты.РегистрацияВПенсионномФонде.НаименованиеОрганаПФР;
		Если ЭтоФизЛицо Тогда
			Объект.ИПРегистрационныйНомерПФР = Реквизиты.РегистрацияВПенсионномФонде.РегистрационныйНомерПФР;	
		Иначе
			Объект.РегистрационныйНомерПФР = Реквизиты.РегистрацияВПенсионномФонде.РегистрационныйНомерПФР;
			ИсторияРегистрацийВОрганеПФР.РегистрационныйНомерПФР = Объект.РегистрационныйНомерПФР;
		КонецЕсли;
		
		ЗаполнитьСведенияОбОтделенииПФР();
		
	КонецЕсли;
	
	Если Реквизиты.Свойство("РегистрацияВФСС")
		И ЗначениеЗаполнено(Реквизиты.РегистрацияВФСС) Тогда
		
		Если НЕ ЗначениеЗаполнено(Реквизиты.РегистрацияВФСС.КодПодчиненности) Тогда
			СимволПричиныРегистрации = ?(Объект.ОбособленноеПодразделение, "2", ?(ЭтоФизЛицо, "3", "1"));
			Объект.КодПодчиненностиФСС = Реквизиты.РегистрацияВФСС.КодОрганаФСС + СимволПричиныРегистрации;
		Иначе
			Объект.КодПодчиненностиФСС = Реквизиты.РегистрацияВФСС.КодПодчиненности;
		КонецЕсли;
		Объект.НаименованиеТерриториальногоОрганаФСС = Реквизиты.РегистрацияВФСС.НаименованиеОрганаФСС;
		Если ЭтоФизЛицо Тогда
			Объект.ИПРегистрационныйНомерФСС = Реквизиты.РегистрацияВФСС.РегистрационныйНомерФСС;
		Иначе
			Объект.РегистрационныйНомерФСС = Реквизиты.РегистрацияВФСС.РегистрационныйНомерФСС;
		КонецЕсли;
		
		ЗаполнитьСведенияОбОтделенииФСС();
		
	КонецЕсли;
	
	Если ЭтоФизЛицо Тогда
		
		Объект.ФамилияИП  = Реквизиты.Фамилия;
		Объект.ИмяИП      = Реквизиты.Имя;
		Объект.ОтчествоИП = Реквизиты.Отчество;
		
		Если Реквизиты.Свойство("СвидетельствоОРегистрации")
			И ЗначениеЗаполнено(Реквизиты.СвидетельствоОРегистрации) Тогда
			
			Объект.СвидетельствоСерияНомер = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '%1 №%2'"), 
									Реквизиты.СвидетельствоОРегистрации.Серия, Реквизиты.СвидетельствоОРегистрации.Номер);
			Объект.СвидетельствоДатаВыдачи = Реквизиты.СвидетельствоОРегистрации.Дата;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерСчетаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ТекущийТекстНомераСчета = Текст;
	ПодключитьОбработчикОжидания("Подключаемый_УстановитьПодсказкуНомераСчета", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура БанкОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если НЕ ЗаблокироватьБанковскийСчетПриРедактировании() Тогда
		Возврат;
	КонецЕсли;
	
	РеквизитыБанка = БанковскиеСчетаФормыКлиент.ПолучитьДанныеБанка(ВыбранноеЗначение);
	ВыбранноеЗначение = РеквизитыБанка.Ссылка;
	
	ОбновитьРеквизитыБанкаНаФорме(ЭтотОбъект, РеквизитыБанка);

КонецПроцедуры

&НаКлиенте
Процедура БанкПриИзменении(Элемент)
	
	ИзмененБанковскийСчет = Истина;
	
	Если Не ЗначениеЗаполнено(БанковскийСчет.Банк) Тогда
		БИКБанка = "";
		НаименованиеБанка = "";
		ДеятельностьБанкаПрекращена = Ложь;
	КонецЕсли;
	
	БанковскиеСчетаФормыКлиентСервер.УстановитьЗаголовокГруппыРеквизитовСчета(ЭтотОбъект, БанковскийСчет);
	
	ПодсказкаБанк = БанковскиеСчетаФормыКлиентСервер.ПодсказкаПоляБанка(ДеятельностьБанкаПрекращена);
	
	Если ЗначениеЗаполнено(БанковскийСчет.НомерСчета) Тогда
		Элементы.ПодсказкаНомерСчета.Гиперссылка = Ложь;
		БанковскиеСчетаФормыКлиент.УстановитьВалютуПодсказкуСчета(
			БанковскийСчет, ЭтаФорма, БИКБанка, ЦветВыделенияНекорректногоЗначение, Истина);
	КонецЕсли;
	
	ВидимостьЭлементовДиректБанк = ЭлектронныеДокументыБПВызовСервера.ВидимостьЭлементовДиректБанк(
		Объект.Ссылка, БанковскийСчет.Банк);
		
	ПоказатьЭлементыДиректБанк(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БанкАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	БанковскиеСчетаФормыКлиент.БанкАвтоПодбор(Текст, ДанныеВыбора, СтандартнаяОбработка, ПараметрыПолученияДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УстановитьПодсказкуНомераСчета()
	
	Элементы.ПодсказкаНомерСчета.Гиперссылка = Ложь;
	Если Не БанковскиеПравила.ПроверитьДлинуНомераСчета(ТекущийТекстНомераСчета) Тогда
		ПодсказкаНомерСчета = БанковскиеСчетаФормыКлиент.ПодсказкаВводаПоляНомерСчета(ТекущийТекстНомераСчета, БИКБанка);
	Иначе
		ПодсказкаНомерСчета = БанковскиеСчетаФормыКлиентСервер.ПодсказкаПоляНомерСчета(
			ТекущийТекстНомераСчета, БИКБанка, Истина, ЦветВыделенияНекорректногоЗначение);
	КонецЕсли;
	ПоказатьЭлементыДиректБанк(ЭтотОбъект, Ложь);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииБЗКБ

&НаКлиенте
Процедура ВидеоурокЗаполнениеРеквизитов(Команда)
	
	НачалоРаботыКлиент.ВидеоурокЗаполнениеРеквизитов();
	
КонецПроцедуры

&НаКлиенте
Процедура КодОрганаФСГСПолучателяПриИзменении(Элемент)
	
	НаименованиеТОГС = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервера.НаименованиеТОГС(Объект.КодОрганаФСГС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораКодОрганаФСГСПолучателя(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	Если ВыбранноеЗначение <> Неопределено Тогда
		Объект.КодОрганаФСГС = ВыбранноеЗначение.КодТОГС;
		НаименованиеТОГС     = ВыбранноеЗначение.НаименованиеТОГС;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьРеквизитыБанкаНаФорме(Форма, РеквизитыБанка)
	
	Если ЗначениеЗаполнено(РеквизитыБанка.Ссылка) Тогда
		
		Форма.БИКБанка = РеквизитыБанка.Код;
		Форма.НаименованиеБанка = РеквизитыБанка.Наименование;
		Форма.ДеятельностьБанкаПрекращена = РеквизитыБанка.ДеятельностьПрекращена;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзПрисоединенныхФайловПечать(Команда)
	
	ВыбратьКартинкуИзПрисоединенныхФайлов("Печать");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуПечать(Команда)
	
	ЗагрузитьКартинку("Печать");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПечать(Команда)
	
	ОчиститьКартинку("Печать");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзПрисоединенныхФайловПодписьРуководителя(Команда)
	
	ВыбратьКартинкуИзПрисоединенныхФайлов("ПодписьРуководителя");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуПодписьРуководителя(Команда)
	
	ЗагрузитьКартинку("ПодписьРуководителя");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПодписьРуководителя(Команда)
	
	ОчиститьКартинку("ПодписьРуководителя");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьИзПрисоединенныхФайловПодписьГлавногоБухгалтера(Команда)
	
	ВыбратьКартинкуИзПрисоединенныхФайлов("ПодписьГлавногоБухгалтера");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинкуПодписьГлавногоБухгалтера(Команда)
	
	ЗагрузитьКартинку("ПодписьГлавногоБухгалтера");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьПодписьГлавногоБухгалтера(Команда)
	
	ОчиститьКартинку("ПодписьГлавногоБухгалтера");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОчиститьКартинку(ИмяКартинки, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если Объект["Файл" + ИмяКартинки].Пустая() Тогда
		ЗагрузитьКартинку(ИмяКартинки);
	Иначе
		ОчиститьКартинку(ИмяКартинки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКартинку(ИмяЭлементаСКартинкой)
	
	Если Объект.Ссылка.Пустая() Тогда
		Если НЕ Записать() Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ВыбираемаяКартинка = ИмяЭлементаСКартинкой;
	
	Фильтр = НСтр("ru = 'Все картинки (*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf)|*.bmp;*.gif;*.png;*.jpeg;*.dib;*.rle;*.tif;*.jpg;*.ico;*.wmf;*.emf"
		+ "|Все файлы(*.*)|*.*"
		+ "|Формат bmp(*.bmp*;*.dib;*.rle)|*.bmp;*.dib;*.rle"
		+ "|Формат GIF(*.gif*)|*.gif"
		+ "|Формат JPEG(*.jpeg;*.jpg)|*.jpeg;*.jpg"
		+ "|Формат PNG(*.png*)|*.png"
		+ "|Формат TIFF(*.tif)|*.tif"
		+ "|Формат icon(*.ico)|*.ico"
		+ "|Формат метафайл(*.wmf;*.emf)|*.wmf;*.emf'");
	
	ПрисоединенныеФайлыКлиент.ДобавитьФайлы(Объект.Ссылка, УникальныйИдентификатор, Фильтр);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлПечатьПриИзменении(Элемент)
	
	УстановитьКартинкуНаФорме(АдресПечать, Объект.ФайлПечать);
	
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ФайлПодписьРуководителяПриИзменении(Элемент)
	
	УстановитьКартинкуНаФорме(АдресПодписьРуководителя, Объект.ФайлПодписьРуководителя);
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ФайлПодписьГлавногоБухгалтераПриИзменении(Элемент)
	
	УстановитьКартинкуНаФорме(АдресПодписьГлавногоБухгалтера, Объект.ФайлПодписьГлавногоБухгалтера);
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОчиститьПечатьНажатие(Элемент, СтандартнаяОбработка)
	
	ЗагрузитьОчиститьКартинку("Печать", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОчиститьПодписьРуководителяНажатие(Элемент, СтандартнаяОбработка)
	
	ЗагрузитьОчиститьКартинку("ПодписьРуководителя", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОчиститьПодписьГлавногоБухгалтераНажатие(Элемент, СтандартнаяОбработка)
	
	ЗагрузитьОчиститьКартинку("ПодписьГлавногоБухгалтера", СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКартинку(ИмяЭлементаСКартинкой)

	Модифицированность = Истина;
	ИмяФайла = "Файл" + ИмяЭлементаСКартинкой;
	ИмяАдресаКартинки = "Адрес" + ИмяЭлементаСКартинкой;
	Объект[ИмяФайла] = Неопределено;
	
	УстановитьКартинкуНаФорме(ЭтотОбъект[ИмяАдресаКартинки], Объект[ИмяФайла]);
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура АдресЛоготипНажатие(Элемент, СтандартнаяОбработка)
	ОбработатьНажатиеКартинки(СтандартнаяОбработка, "Логотип");
КонецПроцедуры

&НаКлиенте
Процедура АдресПечатьНажатие(Элемент, СтандартнаяОбработка)
	ОбработатьНажатиеКартинки(СтандартнаяОбработка, "Печать");
КонецПроцедуры

&НаКлиенте
Процедура АдресПодписьРуководителяНажатие(Элемент, СтандартнаяОбработка)
	ОбработатьНажатиеКартинки(СтандартнаяОбработка, "ПодписьРуководителя");
КонецПроцедуры

&НаКлиенте
Процедура АдресФаксимильнаяПечатьНажатие(Элемент, СтандартнаяОбработка)
	ОбработатьНажатиеКартинки(СтандартнаяОбработка, "ФаксимильнаяПечать");
КонецПроцедуры

&НаКлиенте
Процедура АдресПодписьГлавногоБухгалтераНажатие(Элемент, СтандартнаяОбработка)
	ОбработатьНажатиеКартинки(СтандартнаяОбработка, "ПодписьГлавногоБухгалтера");
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияТекстРекламыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "ПодключитьДиректБанк" Тогда
		
		СтандартнаяОбработка = Ложь;
		ОткрытьПомощник = Истина;
		Если Модифицированность Тогда
			
			ОткрытьПомощник = Записать();
			
		КонецЕсли;
		Если ОткрытьПомощник Тогда
			
			ОбменСБанкамиКлиент.ОткрытьСоздатьНастройкуОбмена(
				Объект.Ссылка, БанковскийСчет.Банк, БанковскийСчет.НомерСчета);
				
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПодсказкаНомерСчетаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьПомощник = Истина;
	Если Модифицированность Тогда
		
		ОткрытьПомощник = Записать();
		
	КонецЕсли;
	Если ОткрытьПомощник Тогда
		
		ОбменСБанкамиКлиент.ОткрытьСоздатьНастройкуОбмена(
			Объект.Ссылка, БанковскийСчет.Банк, БанковскийСчет.НомерСчета);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСкрытьРекламуДиректБанкНажатие(Элемент)
	
	ЭлектронныеДокументыБПВызовСервера.СохранитьНастройкуВидимостиРекламыДиректБанк(БанковскийСчет.Банк, Ложь);
	ВидимостьЭлементовДиректБанк = "ПоказатьГиперссылку";
	ПоказатьЭлементыДиректБанк(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

&НаКлиентеНаСервереБезКонтекста
Процедура ПоказатьЭлементыДиректБанк(Форма, ИзменитьВидимостьБаннера = Истина)
	
	Объект					 = Форма.Объект;
	Элементы				 = Форма.Элементы;
	ВидимостьБаннера		 = Ложь;
	ВидимостьГиперссылки	 = Ложь;
	Если ЗначениеЗаполнено(Форма.БанковскийСчет.НомерСчета)
		И (СтрДлина(Форма.ПодсказкаНомерСчета) = 0 // номер счета корректен
		ИЛИ Элементы.ПодсказкаНомерСчета.Гиперссылка) Тогда
		
		ВидимостьБаннера		 = Форма.ВидимостьЭлементовДиректБанк = "ПоказатьБаннер";
		ВидимостьГиперссылки	 = Форма.ВидимостьЭлементовДиректБанк = "ПоказатьГиперссылку";
		
	КонецЕсли;
	
	Если ИзменитьВидимостьБаннера Тогда
		
		Элементы.ГруппаРекламаДиректБанк.Видимость = ВидимостьБаннера;
		
	КонецЕсли;
	
	Если ВидимостьГиперссылки Тогда
		
		Элементы.ПодсказкаНомерСчета.Гиперссылка = Истина;
		ТекстГиперссылки = НСтр("ru = 'Подключить 1С:ДиректБанк'");
		Форма.ПодсказкаНомерСчета = Новый ФорматированнаяСтрока(
			ТекстГиперссылки,, Форма.ЦветГиперссылки);
			
	ИначеЕсли Элементы.ПодсказкаНомерСчета.Гиперссылка Тогда
		
		Элементы.ПодсказкаНомерСчета.Гиперссылка = Ложь;
		Форма.ПодсказкаНомерСчета = Новый ФорматированнаяСтрока("");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияПриНажатии(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.НачалоВыбора(ЭтотОбъект, Элемент,, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_КонтактнаяИнформацияОчистка(Элемент, СтандартнаяОбработка)
	УправлениеКонтактнойИнформациейКлиент.Очистка(ЭтотОбъект, Элемент.Имя);
КонецПроцедуры

#КонецОбласти

ЗаполнятьРеквизитыПоИНН = Истина;
РассылкаОповещенияИзТекущейФормы = Ложь;