////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Если Форма.Объект.СпособПогашенияСтоимости = ПредопределенноеЗначение("Перечисление.СпособыПогашенияСтоимости.ПропорциональноОбъемуПродукцииРабот") Тогда
		Форма.Элементы.ГруппаСтраницыСрокИОбъем.ТекущаяСтраница = Форма.Элементы.ГруппаОбщийОбъем;
	Иначе
		Форма.Элементы.ГруппаСтраницыСрокИОбъем.ТекущаяСтраница = Форма.Элементы.ГруппаСрокИспользованияИРасшифровка;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначенияРасшифровок(Номенклатура, ПредставлениеЕдИзмерения, СрокИспользования, РашифровкаСрокИспользования)

	Если ЗначениеЗаполнено(Номенклатура) Тогда
		ПредставлениеЕдИзмерения = Номенклатура.ЕдиницаИзмерения.Наименование;
	Иначе
		ПредставлениеЕдИзмерения = ""
	КонецЕсли; 

	РашифровкаСрокИспользования = УправлениеВнеоборотнымиАктивамиКлиентСервер.РасшифровкаСрокаПолезногоИспользования(СрокИспользования);
	
КонецПроцедуры
 

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	УстановитьЗначенияРасшифровок(Объект.Владелец, ПредставлениеЕдИзмерения, Объект.СрокПолезногоИспользования, РашифровкаСрокПолезногоИспользования);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособПогашенияСтоимостиПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	УстановитьЗначенияРасшифровок(Объект.Владелец, ПредставлениеЕдИзмерения, Объект.СрокПолезногоИспользования, РашифровкаСрокПолезногоИспользования);
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СрокПолезногоИспользованияПриИзменении(Элемент)
	
	УстановитьЗначенияРасшифровок(Объект.Владелец, ПредставлениеЕдИзмерения, Объект.СрокПолезногоИспользования, РашифровкаСрокПолезногоИспользования);
	
КонецПроцедуры

