
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	 УстановитьЗаголовкиСубконто(ЭтаФорма, Объект.СчетЗатрат);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура  УстановитьЗаголовкиСубконто(Форма, СчетЗатрат)

	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3",
								 "Субконто1", "Субконто2", "Субконто3");
	ПоляОбъекта.Вставить("Подразделение", "Подразделение");

	ЗаголовкиПолей = Новый Структура;
	ЗаголовкиПолей.Вставить("Субконто1", "ЗаголовокСубконто1");
	ЗаголовкиПолей.Вставить("Субконто2", "ЗаголовокСубконто2");
	ЗаголовкиПолей.Вставить("Субконто3", "ЗаголовокСубконто3");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(СчетЗатрат, Форма, ПоляОбъекта, ЗаголовкиПолей, Ложь);

КонецПроцедуры