
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 
	ПериодУстановитьЗаголовок(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Объект.Организация, Объект.ФизическоеЛицо, ТекущаяДата());
	Объект.Должность = ДанныеФизЛица.Должность;
		
КонецПроцедуры

&НаКлиенте
Процедура ФизическоеЛицоПриИзменении(Элемент)
	
	ДанныеФизЛица = ОбщегоНазначенияБПВызовСервера.ДанныеФизЛица(Объект.Организация, Объект.ФизическоеЛицо, ТекущаяДата());
	Объект.Должность = ДанныеФизЛица.Должность;
		
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	
	ПериодУстановитьЗаголовок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	
	ПериодУстановитьЗаголовок(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПериодУстановитьЗаголовок(Форма)
	
	Объект = Форма.Объект;
	
	ШаблонЗаголовка = НСтр("ru='Период действия: %1 %2 '");
	ТекстНачалоПериода = "";
	ТекстКонецПериода = "";
	Если ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		ТекстНачалоПериода	= НСтр("ru='c '")+Формат(Объект.ДатаНачала, "ДЛФ=D");
		ТекстКонецПериода	= НСтр("ru=' по '")+Формат(Объект.ДатаОкончания, "ДЛФ=D");
		
	ИначеЕсли  ЗначениеЗаполнено(Объект.ДатаНачала) И НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		ТекстНачалоПериода	= НСтр("ru='c '")+Формат(Объект.ДатаНачала, "ДЛФ=D");
		ТекстКонецПериода	= НСтр("ru=' - бессрочно'");
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ДатаНачала) И НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		ТекстНачалоПериода	= НСтр("ru='бессрочно'");
		
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ДатаНачала) И ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		
		ТекстКонецПериода = НСтр("ru='по '")+Формат(Объект.ДатаОкончания, "ДЛФ=D");
		
	КонецЕсли;
	
	ПодписиЗаголовок = СтрШаблон(ШаблонЗаголовка, ТекстНачалоПериода, ТекстКонецПериода);
	
	УстановитьЗаголовокГруппы(Форма, "ГруппаПериодДействия", ПодписиЗаголовок);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовокГруппы(Форма, НазваниеГруппы, ЗаголовокТекст)
	
	#Если ВебКлиент Тогда
		СистемнаяИнформация = Новый СистемнаяИнформация;
		ВерсияПлатформыБезНомераСборки = ОбщегоНазначенияКлиентСервер.ВерсияКонфигурацииБезНомераСборки(СистемнаяИнформация.ВерсияПриложения);
		Форма.Элементы[НазваниеГруппы].ЗаголовокСвернутогоОтображения = ЗаголовокТекст;
	#Иначе
		Форма.Элементы[НазваниеГруппы].ЗаголовокСвернутогоОтображения = ЗаголовокТекст;
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти


