#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ЮридическоеФизическоеЛицо")
		= Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо Тогда
		
		КПП = "";
		
	КонецЕсли;
	
	Если НЕ ОбособленноеПодразделение Тогда
		НаименованиеПолное = "";
	КонецЕсли;
	
	Если НЕ ЭтоНовый() И НЕ ОбособленноеПодразделение И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ОбособленноеПодразделение") Тогда
	
		РегистрыСведений.ЛимитОстаткаКассыОрганизаций.УдалитьЗаписиСПодразделением(Владелец, Ссылка);
	
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("Организация") и ЗначениеЗаполнено(ДанныеЗаполнения.Организация) Тогда
			ЭтотОбъект.Владелец = ДанныеЗаполнения.Организация
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		Владелец = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	КонецЕсли;
	
	// Заполняем значениями по умолчанию реквизиты, оставшиеся пустыми.
	Если ЗначениеЗаполнено(Владелец) 
		И ЗначениеЗаполнено(Родитель) Тогда
		ОбособленноеПодразделение = Родитель.ОбособленноеПодразделение;
		Если ОбособленноеПодразделение Тогда
			КПП        = Родитель.КПП;
			Префикс    = Родитель.Префикс;
			РегистрацияВНалоговомОргане = Родитель.РегистрацияВНалоговомОргане;
			НаименованиеПолное          = Родитель.НаименованиеПолное;
			ЦифровойИндексОбособленногоПодразделения = Родитель.ЦифровойИндексОбособленногоПодразделения;
			КодПоОКПО     = Родитель.КодПоОКПО;
			КодОрганаФСГС = Родитель.КодОрганаФСГС;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ПрефиксБП20 = "";
	
КонецПроцедуры

#КонецЕсли
