#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьНаименованиеПоВладельцу(ДанныеЗаполнения);
		
КонецПроцедуры

Процедура ЗаполнитьНаименованиеПоВладельцу(ДанныеЗаполнения)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("Наименование") Тогда
		// Уже заполнено
		Возврат;
	КонецЕсли;
	
	Если НЕ ДанныеЗаполнения.Свойство("Владелец") Тогда
		// Нечем заполнять
		Возврат;
	КонецЕсли;
			
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Номенклатура", ДанныеЗаполнения.Владелец);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпецификацииНоменклатуры.Ссылка
	|ИЗ
	|	Справочник.СпецификацииНоменклатуры КАК СпецификацииНоменклатуры
	|ГДЕ
	|	НЕ СпецификацииНоменклатуры.ПометкаУдаления
	|	И СпецификацииНоменклатуры.Владелец = &Номенклатура";
	
	УстановитьПривилегированныйРежим(Истина);
	ЭтоПервыйЭлемент = Запрос.Выполнить().Пустой();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если НЕ ЭтоПервыйЭлемент Тогда
		// Первому элементу для выбранной номенклатуры название предложим.
		// Но если элементов больше одного, то "угадывать" нет смысла: 
		// пользователь сам определит понятные ему наименования
		Возврат;
	КонецЕсли;
	
	Наименование = Строка(ДанныеЗаполнения.Владелец);
				
КонецПроцедуры

#КонецЕсли