
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыЗапроса = ИнтеграцияЕГАИСКлиентСервер.ПараметрыЗапросаКлассификатора();
	ПараметрыЗапроса.ИНН = ИННОрганизации(ПараметрКоманды);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ФормированиеЗапросаКлассификатора_Завершение", ЭтотОбъект);
	
	ИнтеграцияЕГАИСКлиент.НачатьФормированиеЗапросаАлкогольнойПродукции(ОповещениеПриЗавершении, ПараметрыЗапроса);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ФормированиеЗапросаКлассификатора_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат.Результат Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьПредупреждение(, НСтр("ru = 'Запрос на загрузку классификатора сформирован.'"), 10);
	
КонецПроцедуры

&НаСервере
Функция ИННОрганизации(Организация)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КлассификаторОрганизацийЕГАИС.ИНН
	|ИЗ
	|	Справочник.КлассификаторОрганизацийЕГАИС КАК КлассификаторОрганизацийЕГАИС
	|ГДЕ
	|	КлассификаторОрганизацийЕГАИС.Ссылка = &Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ИНН;

КонецФункции

#КонецОбласти